{
  "Documents" : [ {
    "Post" : "hi everyone. It's been awhile since I've been on this site but I was thinking about you and hoping everyone was good. I just need some help with my spasticity. My legs won't stop spasming during the day and during the night. It's like they're going constantly. My neurologist has prescribed Baclofen and he increased the dosage so that I am on the maximum. He also prescribed phenobarbital at night when I go to bed. I don't know what else to do it's even to the point where when I get up on my standing device like yesterday my leg spasms and my foot kicked off the bottom stand and I fell all the way down to the floor and my husband who is an injured Vet had to pick me up and that was very very painful for him. So if anyone has any suggestions on what I should do or what different medication I can take that would be very very helpfu. Thank you!",
    "Titel" : "Spasticity please help",
    "Date" : "08-27-2020, 03:03 PM",
    "User" : "Angelea",
    "Number_of_total_posts" : "46"
  }, {
    "Post" : "Hi Angelea.\nSorry to hear your spasticity has worsened. I know some people eventually get a baclofen pump. Has your neuro considered that option?\nThere is a separate forum for spasticity. There may be a few threads of interest to you while you wait for responses to your question.\nhttp://www.msworld.org/forum/forumdi...132-Spasticity\nHope you are able to find something that works.",
    "Titel" : "Spasticity please help",
    "Date" : "08-28-2020, 07:43 AM",
    "User" : "pennstater",
    "Number_of_total_posts" : "2688"
  }, {
    "Post" : "So sorry, Angela! You definitely sound like a candidate for a baclofen pump (also known as Intrathecal Baclofen Therapy, or ITB).\nThere are several people here who have one, including me. It has been a real blessing for me. I was on the maximum dose of oral Baclofen, Tizanidine, and Valium and still wasn't getting the relief I needed. I was then fortunate to find a new neurologist, a MS Specialist, who referred me to a spasticity specialist for further evaluation.\nThe medication is delivered directly to the intrathecal area of the spine, and a much lower dose is needed for relief.\nA trial is scheduled first to see if you are a candidate for one. Medication will be injected into your intrathecal space, and they will watch to see how you respond to it. Sometimes it takes more than one trial to determine if your are a candidate.\nSurgery to implant the pump and catheter which delivers the medication to your spine is scheduled if you respond to the trial.\nAnother option for some people is Botox, but it really sounds like you would be a candidate for the pump. Here is some more information for you:\nhttps://www.medtronic.com/us-en/pati...pasticity.html\nBest of luck to you, and please ask us any questions you have!",
    "Titel" : "Spasticity please help",
    "Date" : "08-28-2020, 12:07 PM",
    "User" : "Kimba22",
    "Number_of_total_posts" : "1636"
  }, {
    "Post" : "I don't usually experience spacity, but I did have it regularly during one of my MS flares many years ago. Mine usually occurred before rising in the morning. I found that it helped to prevent it when I did some stretching before getting out of bed. You might want to experiment with stretching exercises and determine when, how and where they might work best for you.\nHere's a link I found, but, try your own thing if it doesn't help.\nhttps://multiplesclerosisnewstoday.c...d-try-and-why/",
    "Titel" : "Spasticity please help",
    "Date" : "08-28-2020, 01:04 PM",
    "User" : "Mamabug",
    "Number_of_total_posts" : "4304"
  }, {
    "Post" : "I also have a pump and it changed my life. A true miracle in every sense of the word.\nMaxed out oral baclofen is no way to live life. Yuck!\nIf you have any questions please feel free to ask.\nAlso, a couple of us MSWorld members are also Medtronic Ambassadors. We're not paid, but we believe in the therapy so much we volunteer our time to discuss the treatment with people just like you.\nhttps://www.medtronic.com/us-en/pati...r-program.html",
    "Titel" : "Spasticity please help",
    "Date" : "08-28-2020, 03:47 PM",
    "User" : "Marco",
    "Number_of_total_posts" : "1737"
  }, {
    "Post" : "There are other muscle relaxers besides baclofen. Tizanidine is considered stronger and in my experience it's more effective. But tizanidine is filtered by the liver and sometimes one's liver cannot handle it. Baclofen is filtered by the kidney and seems to cause fewer problems.\nOriginally posted by Angelea View Post\nMy neurologist has prescribed Baclofen and he increased the dosage so that I am on the maximum.\nDifferent neurologists have differing ideas on what is the \"maximum.\" It's often said that the max is 80mg/day. But some MS neurologists give 2 or 3 times that amount -- far above the FDA \"limit.\"\nIn treating MS, some medicine is literally experimental medicine.",
    "Titel" : "Spasticity please help",
    "Date" : "08-28-2020, 07:52 PM",
    "User" : "Golgotha",
    "Number_of_total_posts" : "82"
  }, {
    "Post" : "Have they stopped prescribing baclofen? My neuro gave me a prescription to use as needed and it’s a big help. Lately, my caregiver told me my arms are flailing around in my sleep. If it starts waking me up will have to take one before I sleep.\nThese medications were invented to help us. Sure better than Botox.",
    "Titel" : "Spasticity please help",
    "Date" : "09-10-2020, 01:41 AM",
    "User" : "palmtree",
    "Number_of_total_posts" : "1320"
  }, {
    "Post" : "I had some dealings with spasticity and the oral baclofen helped but it doped me up big time. I've got to say, CBD really helped me with it. I've heard and read that cannabis can be a game changer for spasticity.",
    "Titel" : "Spasticity please help",
    "Date" : "09-10-2020, 08:40 AM",
    "User" : "Boudreaux",
    "Number_of_total_posts" : "578"
  }, {
    "Post" : "Hi all\nIm 55 and have through menopause. However am very tolerant of cold weather. The only thing cod are my feet and hands. I never shiver and will only wear a sweatshirt. I have transitioned to spms over the year. Most of my obstacles are coordination,moboility,fatigue.Does anyone else suffer from this? Roxy118",
    "Titel" : "TOLERANT of cold weather",
    "Date" : "12-17-2019, 08:28 PM",
    "User" : "roxy118",
    "Number_of_total_posts" : "28"
  }, {
    "Post" : "Originally posted by roxy118 View Post\nHi all\nIm 55 and have through menopause. However am very tolerant of cold weather. The only thing cod are my feet and hands. I never shiver and will only wear a sweatshirt. I have transitioned to spms over the year. Most of my obstacles are coordination,moboility,fatigue.Does anyone else suffer from this? Roxy118\nHi roxy\nMy body functions best when I'm just borderline chilly.\nBut I don't tolerate being cold at all. My muscles stiffen so much that I can barely move when I get too cold.\nI'm also heat intolerant, which causes extreme weakness, among other symptoms.\nI have a pretty small window (of decent temperature) in which my impaired nerve signals function at their best.\nTake Care",
    "Titel" : "TOLERANT of cold weather",
    "Date" : "12-17-2019, 10:42 PM",
    "User" : "KoKo",
    "Number_of_total_posts" : "4556"
  }, {
    "Post" : "I'm like KoKo. I function best between 59-63 degrees. Any colder, and I get stiff, sleepy, and stupid. Any warmer, I hurt a lot more, get weaker, and stupid. Fall has long been my favorite season!",
    "Titel" : "TOLERANT of cold weather",
    "Date" : "12-19-2019, 07:23 AM",
    "User" : "NoraS",
    "Number_of_total_posts" : "86"
  }, {
    "Post" : "Originally posted by NoraS View Post\nI'm like KoKo. I function best between 59-63 degrees. Any colder, and I get stiff, sleepy, and stupid. Any warmer, I hurt a lot more, get weaker, and stupid. Fall has long been my favorite season!\nHi NoraS,\nHave to comment here. KoKo and I had a recent discussion in the exercise forum regarding heat.\nYou chose the proper word when you said \"Any warmer, I... get weaker...\"\nI never had a problem with any kind of heat. Still don't really, but did notice a difference as far as muscle response after 15 minutes in a jacuzzi following pool exercise.\nWeaker. Muscles that were as responsive as mine can get after a workout (and a short rest), were definitely weaker, less reactive. The heat has to be the root cause.\nI can lean toward sleepy, but stupid... it may be harder to tell any difference ;-)",
    "Titel" : "TOLERANT of cold weather",
    "Date" : "12-19-2019, 10:14 AM",
    "User" : "502E79",
    "Number_of_total_posts" : "894"
  }, {
    "Post" : "Neurontine and balance/drop foot\nHi! I wrote this message under General Questions, and got no replies, so I suppose I was in the wrong place. I try again: In Norway, my questions about side-effects of neurontine is ignored. I'm on 2100 mg + 30 mg. Sarotex. I strongly suspect that problems with balance/coordination and now drop-foot is worsened or maybe even caused by side effects from the medicine. I saw someone write \"wobbeling feet\" that's excactly how I feel. My feet seems \"soft\". Anyone else with similar experience?",
    "Titel" : "Neurontine and balance/drop foot",
    "Date" : "06-24-2018, 05:42 AM",
    "User" : "Norwegian",
    "Number_of_total_posts" : "3"
  }, {
    "Post" : "Originally posted by Norwegian View Post\nI'm on 2100 mg + 30 mg. Sarotex. I strongly suspect that problems with balance/coordination and now drop-foot is worsened or maybe even caused by side effects from the medicine.\nHi Norwegian and Welcome\nI have never used Neurontin, so I'm not able to share any experience.\nOne way to find out if your balance/coordination and drop-foot is worsened or caused by Neurontin side effects, would be to taper off the drug, under the advice and supervision of your doctor.\nIf your symptoms improve, then they might be caused by the Neurontin.\nUnsteadiness and weakness are listed as possible side effects.\nhttps://medlineplus.gov/druginfo/med...l#side-effects\nHopefully other members will share their experiences.\nTake Care",
    "Titel" : "Neurontine and balance/drop foot",
    "Date" : "06-24-2018, 10:16 AM",
    "User" : "KoKo",
    "Number_of_total_posts" : "4556"
  }, {
    "Post" : "Neurontine - agan\nHi Ko ko, and thank you so much for replying! If anyone else has some expecience with neurontine and balance /drop foot, I'm most grateful for any advice.\nBest regards from\nNorwegian",
    "Titel" : "Neurontine and balance/drop foot",
    "Date" : "06-27-2018, 03:24 AM",
    "User" : "Norwegian",
    "Number_of_total_posts" : "3"
  }, {
    "Post" : "Neurontine and balance foot drop\nI am having problems with balance and foot drop and on Neurontin but had balance problems before and I think my foot drop or stick to the floor thing is due to just MS progressing. I think your neurologist should be able to assess at least.",
    "Titel" : "Neurontine and balance/drop foot",
    "Date" : "08-07-2019, 10:03 PM",
    "User" : "SummerTobin",
    "Number_of_total_posts" : "7"
  }, {
    "Post" : "I’m getting frustrated I can get a erection but it won’t last most of the time, I can’t climax either.\nI found a awesome girlfriend but she is waiting for me to figure it out, she wants kids but I don’t know what to do!\nIll speak with my neuro and see what says. I mean I’m alone I can climax myself but wen I’m having sex with my partner it doesn’t work 😡\ncould it just be psychological then ? I just don’t wanna lose this girlfriend 🙁 over this.",
    "Titel" : "Sexual issues",
    "Date" : "01-21-2019, 10:48 PM",
    "User" : "Ant1981",
    "Number_of_total_posts" : "350"
  }, {
    "Post" : "Hi ANT,\nSounds like maybe some performance anxiety....\na very common issue ( especially in new relationship situations). Do you use cialis? I was about your age when I started experiencing similar issues, not so common for a man in the thirty something age group, however considering ms is a direct hit to the nervous system and we have over 4,000 nerves in the region we are talking about...it leaves question as to how much ms contributes to our sexual abilities.\nIn my experience cealis has been very beneficial in allowing me to get through challenges like the ones you speak of. Might I also suggest maybe talking with your primary physician about this issue, sometimes they can be better to help you in this area of wellness.\nI'm only speaking from personal experience, but I have learned that when using cialis or viagra it is wise to steer clear of the generics, they don't always work and they tend to be somewhat suspect in manufacturing and distribution. Also, Google \" Trimix\" its something you may appreciate at some point in your life.\nIt may be just a temporary thing for you, and I hope it is only temporary!!! But sometimes a little pharma help along with self meditation can help a guy stay up in his game\nJust some friendly thoughts to your post.\nhope all works out for you!!!\nPeace\nRob",
    "Titel" : "Sexual issues",
    "Date" : "01-22-2019, 11:08 AM",
    "User" : "ppmsichshize",
    "Number_of_total_posts" : "25"
  }, {
    "Post" : "Getting better\nOriginally posted by ppmsichshize View Post\nHi ANT,\nSounds like maybe some performance anxiety....\na very common issue ( especially in new relationship situations). Do you use cialis? I was about your age when I started experiencing similar issues, not so common for a man in the thirty something age group, however considering ms is a direct hit to the nervous system and we have over 4,000 nerves in the region we are talking about...it leaves question as to how much ms contributes to our sexual abilities.\nIn my experience cealis has been very beneficial in allowing me to get through challenges like the ones you speak of. Might I also suggest maybe talking with your primary physician about this issue, sometimes they can be better to help you in this area of wellness.\nI'm only speaking from personal experience, but I have learned that when using cialis or viagra it is wise to steer clear of the generics, they don't always work and they tend to be somewhat suspect in manufacturing and distribution. Also, Google \" Trimix\" its something you may appreciate at some point in your life.\nIt may be just a temporary thing for you, and I hope it is only temporary!!! But sometimes a little pharma help along with self meditation can help a guy stay up in his game\nJust some friendly thoughts to your post.\nhope all works out for you!!!\nPeace\nRob\nthanks for your reply, I found that the last 2 times things are improving more and more. I’m maintaining my election longer and getting closer to climax but still struggling to get there. I feel that I’m getting more comfortable with my partner and I’ll talk to my neuro about Cialis, that just might be the ticket to resolving this annoying problem.",
    "Titel" : "Sexual issues",
    "Date" : "01-23-2019, 01:05 PM",
    "User" : "Ant1981",
    "Number_of_total_posts" : "350"
  }, {
    "Post" : "I found a solution\nAfter researching a lot I realized I could be dealing with some PIED (porn induced erectile dysfunction) my constant porn viewing and master bating over the years has routed my brain into that as the only way to enjoy sex.\nSo so it’s time to abstain from all sources of online stimuli and reboot my brains pathways to enjoy sex with another female and I know if it’s working fine alone eventually I’ll get there from not giving into my own desires alone for many weeks to complete the reboot, plus I have a supportive girlfriend who will enjoy the benefits of a reboot of my pathways to feel the enjoyment of sex with a partner together after I’m healed.\nvery informative book only this whole matter I found here:\nAddicted-to-Internet-Porn-Noah-B.E.-Church",
    "Titel" : "Sexual issues",
    "Date" : "01-28-2019, 09:28 AM",
    "User" : "Ant1981",
    "Number_of_total_posts" : "350"
  }, {
    "Post" : "Originally posted by Ant1981 View Post\nAfter researching a lot I realized I could be dealing with some PIED (porn induced erectile dysfunction) my constant porn viewing and master bating over the years has routed my brain into that as the only way to enjoy sex.\nSo so it’s time to abstain from all sources of online stimuli and reboot my brains pathways to enjoy sex with another female and I know if it’s working fine alone eventually I’ll get there from not giving into my own desires alone for many weeks to complete the reboot, plus I have a supportive girlfriend who will enjoy the benefits of a reboot of my pathways to feel the enjoyment of sex with a partner together after I’m healed.\nvery informative book only this whole matter I found here:\nAddicted-to-Internet-Porn-Noah-B.E.-Church\nKudos for your willingness to realize the problem and work on fixing it. Not many people are willing to look in that mirror.",
    "Titel" : "Sexual issues",
    "Date" : "01-28-2019, 11:09 AM",
    "User" : "Boudreaux",
    "Number_of_total_posts" : "578"
  }, {
    "Post" : "Viagra and cialis\nThanks guys, I got a px for Viagra and cialis from my neuro tbday, hopefully that is a solution for me 😃",
    "Titel" : "Sexual issues",
    "Date" : "02-11-2019, 03:55 PM",
    "User" : "Ant1981",
    "Number_of_total_posts" : "350"
  }, {
    "Post" : "Viagra\nOriginally posted by Ant1981 View Post\nThanks guys, I got a px for Viagra and cialis from my neuro tbday, hopefully that is a solution for me 😃\nHoly cow, after trying Viagra for the first time I was impressed, felt twenty years younger in the sack. It was a huge game changer!\nHighly recommend, tho not the cheapest drug.",
    "Titel" : "Sexual issues",
    "Date" : "02-14-2019, 02:48 AM",
    "User" : "Ant1981",
    "Number_of_total_posts" : "350"
  }, {
    "Post" : "Frustrated and conceref\nwell my last girlfriend my sexual issues cleared up a little with help from viagra but we broke up.\nnow I got a new girlfriend but although my erection was maintained I could not reach climax for the life of me and she left me. That was a blow to my self esteem but i don’t think MS I’d to blame completely I do pleasure myself easily and working perfectly fine... but wen with a partner it’s not the same, I think I need a patient partner to help me get over the hurdle and quit pleasuring myself like I said before.\nI just cant tell if MS plays a part in my dysfunction of my sexual organ cause it works fine solo.\ni think I know what I need to do, stop pleasuring myself and get comfortable with a new mate before sex is introduced into the relationship.",
    "Titel" : "Sexual issues",
    "Date" : "07-25-2019, 10:19 AM",
    "User" : "Ant1981",
    "Number_of_total_posts" : "350"
  }, {
    "Post" : "Originally posted by Ant1981 View Post\ni think I know what I need to do, stop pleasuring myself\nI think that is a great idea.",
    "Titel" : "Sexual issues",
    "Date" : "07-25-2019, 10:55 AM",
    "User" : "Boudreaux",
    "Number_of_total_posts" : "578"
  }, {
    "Post" : "Thank you\nthank you ii gotta sticknyo this this time like my sobriety\nOriginally posted by Boudreaux View Post\nI think that is a great idea.",
    "Titel" : "Sexual issues",
    "Date" : "07-28-2019, 11:23 PM",
    "User" : "Ant1981",
    "Number_of_total_posts" : "350"
  }, {
    "Post" : "I recently tried CBD oil because I was desperate with my walking problems. After just a week my walking has improved. My muscle stiffness is less! Maybe I was just coming out of a relapse or maybe it is because the weather has gotten cooler but I really think this stuff has helped. Has anyone else had such great results with CBD oil?",
    "Titel" : "CBD oil",
    "Date" : "09-30-2018, 09:16 PM",
    "User" : "stacey",
    "Number_of_total_posts" : "21"
  }, {
    "Post" : "I haven’t tried it yet but have been looking into it. What brand/strength/dose are you using?",
    "Titel" : "CBD oil",
    "Date" : "10-01-2018, 09:51 AM",
    "User" : "Boudreaux",
    "Number_of_total_posts" : "578"
  }, {
    "Post" : "I have been using Charlotte's Web CBD oil for about 18 months. It does help with my calf muscle tightness and ankle stiffness. I take 1 dropper at bedtime, and 1 dropper at 5am. The 5am dose allows me to fall back to sleep for a couple of hours without leg pain. 10-15 minutes after taking the CBD oil I can feel my calf muscles relax. However, my acupuncturist says CBD oil doesn't work for everyone. I gave it a try because I figured what did I have to lose!",
    "Titel" : "CBD oil",
    "Date" : "10-02-2018, 10:09 AM",
    "User" : "Canary54",
    "Number_of_total_posts" : "146"
  }, {
    "Post" : "I tried CBD oil for leg pain with no success unfortunately. It did help me sleep though. I'd give it a try.",
    "Titel" : "CBD oil",
    "Date" : "10-02-2018, 01:09 PM",
    "User" : "Shawshank",
    "Number_of_total_posts" : "40"
  }, {
    "Post" : "I've been reading about the stuff and trying to figure what is what. I finally decided to just go for it and ordered the CW. I'll report back after I use it for a while.",
    "Titel" : "CBD oil",
    "Date" : "10-02-2018, 03:33 PM",
    "User" : "Boudreaux",
    "Number_of_total_posts" : "578"
  }, {
    "Post" : "My Dose\nOriginally posted by Boudreaux View Post\nI haven’t tried it yet but have been looking into it. What brand/strength/dose are you using?\nI use Lazarus Naturals and take 1/2 dropper in morning and 1/2 at night. 1 full dropper is 1ml",
    "Titel" : "CBD oil",
    "Date" : "10-10-2018, 10:09 AM",
    "User" : "stacey",
    "Number_of_total_posts" : "21"
  }, {
    "Post" : "CBD oil dosage can be measured according to this greenthevoteok.com/cbd-oil/dosage/calculator/.\nThis is for the new users that will see this thread, i know i am posting on 6 month old thread, i was sent to this forum by a reddit user and i am trying to help people who see this thread in future",
    "Titel" : "CBD oil",
    "Date" : "06-22-2019, 11:00 PM",
    "User" : "matthan",
    "Number_of_total_posts" : "2"
  }, {
    "Post" : "Has anyone gone from Gabapentin to Lyrica then back to Gabapentin for your nerve pain. I was on the max dose of Gabapentin 3600mg per day then to 600mg Lyrica aday I have had alot of break through nerve pain across my upper and lower back I know this is ms nerve pain a as I have gone to er several times with this exact pain and it has always been ms related. I am not sure if im just maybe starting a flare even though I am on Tysabri and it is not as likely or the Lyrica is not working for me. Have any of you had this scenario? Thanks!",
    "Titel" : "From Gabapentin to Lyrica then back to Gabapentin",
    "Date" : "06-12-2019, 10:01 AM",
    "User" : "BDOBBINS",
    "Number_of_total_posts" : "36"
  }, {
    "Post" : "Hi, I am still in limbo, but I was on Gabapentin, switched to Lyrica and it made me feel drugged, woozy and totally out of it. Switched back to Gabapentin at a higher dose of 2400, but was lowered to 1800. I take Cymbalta as well. I am also taking Meloxicam for pain.I still get alot of nerve pain, so not sure where we will go from here. I swear it seems every few months I get new symptoms or severity of old symptoms.",
    "Titel" : "From Gabapentin to Lyrica then back to Gabapentin",
    "Date" : "06-12-2019, 08:12 PM",
    "User" : "WiltingRose",
    "Number_of_total_posts" : "19"
  }, {
    "Post" : "Hi BDOBBINS.\nI am sorry you are finding it difficult trying to treat your pain. If Neurontin and Lyrica are not helping there are other options you can try. WiltingRose mentioned Cymbalta which is one of the other options. I used Cymbalta for awhile and found it quite helpful.\nThis article might give you some ideas to take back to your Physician:\nhttps://www.health.harvard.edu/pain/...eve-nerve-pain\nWiltingRose, Meloxicam is an NSAID and they don't help with nerve pain although are very helpful for other types of pain. I use Meloxicam (Mobic) but it has never helped with pain related to my MS.\nI hope your Drs. figure out why you are dealing with symptoms",
    "Titel" : "From Gabapentin to Lyrica then back to Gabapentin",
    "Date" : "06-13-2019, 08:41 AM",
    "User" : "SNOOPY",
    "Number_of_total_posts" : "4237"
  }, {
    "Post" : "Snoopy, (love the name), I use Meloxicam for other pains, not nerve pain. I guess I didn't mention that part. I just had my environmental allergy test and thankfully not allergic to anything. They didn't test for husbands, so maybe that's it?? LOL. Right now I am wearing a heart monitor to check for arythymias (sp?). I've been having seizure-like episodes. I also had an EEG last week. I'm waiting on the results from it. Next week I go for my 6-7? EMG to check for neuropathy in my legs. I'm grateful I have doctors that want to get to the root cause of these symptoms. I'm sure there are many not just one cause.",
    "Titel" : "From Gabapentin to Lyrica then back to Gabapentin",
    "Date" : "06-13-2019, 09:36 PM",
    "User" : "WiltingRose",
    "Number_of_total_posts" : "19"
  }, {
    "Post" : "Originally posted by WiltingRose View Post\nI use Meloxicam for other pains, not nerve pain.\nSame here WiltingRose\nI just had my environmental allergy test and thankfully not allergic to anything. They didn't test for husbands, so maybe that's it?? LOL.\nAt least you still have sense of humor, that can be helpful for some people (me ) I rreally do hope your Drs. can give you some answers. Take care!",
    "Titel" : "From Gabapentin to Lyrica then back to Gabapentin",
    "Date" : "06-14-2019, 08:29 AM",
    "User" : "SNOOPY",
    "Number_of_total_posts" : "4237"
  }, {
    "Post" : "My neurologist has prescribed 1-10mg pill of prednisone 4 times daily for 7 days. He repeats this about 30 days after I complete the 7 day course. I don't know if I am doing harm to my body but I can feel a definite positive change when I stop the steroids for the 20 or so days between courses. Is anyone,here, doing this ?",
    "Titel" : "Low doses of steroids",
    "Date" : "04-09-2019, 03:56 PM",
    "User" : "JerryD",
    "Number_of_total_posts" : "3045"
  }, {
    "Post" : "I am sorry but the title of this thread is supposed to say 'Low doses of Steroids' ! Any and all comments are welcome !",
    "Titel" : "Low doses of steroids",
    "Date" : "04-12-2019, 03:13 PM",
    "User" : "JerryD",
    "Number_of_total_posts" : "3045"
  }, {
    "Post" : "Originally posted by JerryD View Post\nI am sorry but the title of this thread is supposed to say 'Low doses of Steroids' ! Any and all comments are welcome !\nFixed it for you Jerry!\nAlso, I've never used steroids.\nTake Care",
    "Titel" : "Low doses of steroids",
    "Date" : "04-12-2019, 03:48 PM",
    "User" : "KoKo",
    "Number_of_total_posts" : "4556"
  }, {
    "Post" : "Thanks Koko. With nearly 5500 people viewing, I expect to see more than 1 response ! I guess I am being unrealistic !",
    "Titel" : "Low doses of steroids",
    "Date" : "04-12-2019, 06:21 PM",
    "User" : "JerryD",
    "Number_of_total_posts" : "3045"
  }, {
    "Post" : "Hi,\nHaven't done the roids, pause, roids again.\nBut have been put on steroids twice for relapses and felt so ill.\nI also had my fathers experience with steroids to compare with.\nThey did a lot of damage to his body that made life very difficult and painful for him.\nSo i decided not to have them again.\ni am curious why ' low dose' ?\nAs a general rule docs hit things hard an fast with roids if the body is under attack by something.\nIts usually long term use that lower doeses are used for.\nIs this a long term thing?",
    "Titel" : "Low doses of steroids",
    "Date" : "04-12-2019, 06:34 PM",
    "User" : "Carolinemf",
    "Number_of_total_posts" : "584"
  }, {
    "Post" : "Hey Jerry!\nI have never been prescribed pulse steroids before. I'm glad you believe the steroids are having a beneficial impact on your quality of life. Steroids do two things in the body; they reduce inflammation and reduce the activity of the immune system. So you could be benefiting from one or both of the actions.\nA functional medicine doctor would put you on an anti-inflammatory diet intended to both reduce your inflammation, and calm your immune system. They would talk to you about \"gut health\" put you on pre/pro-biotics, cut out all processed foods, sugar, dairy, etc. You can read Mamabug's functional medicine experience here: https://www.msworld.org/forum/showth...ree-sugar-free\nHere's a link that partially discusses pulse steroids:\nhttp://www.nationalmssociety.org/Nat...p_Steroids.pdf\nI sure hope you found something that can improve your long-term quality of life.\nI wish you well...",
    "Titel" : "Low doses of steroids",
    "Date" : "04-13-2019, 12:36 PM",
    "User" : "Marco",
    "Number_of_total_posts" : "1737"
  }, {
    "Post" : "HI JD, I second Marco’s about reviewing the anti-inflammatory diet. If the change feels like too much all at once, cutting out high salt, high sugar, and high fat (fried) foods and drinking lots of water during a steroid course is something to seriously consider. Omitting these can make a huge difference in how some people feel when on steroids.\nJust as with cases of MS, we are all different. I’ll be interested in your updates on this.",
    "Titel" : "Low doses of steroids",
    "Date" : "04-13-2019, 01:58 PM",
    "User" : "gargantua",
    "Number_of_total_posts" : "361"
  }, {
    "Post" : "Interesting.\nNever prescribed steroids like this nor heard of it from my Dr...only had steroid IV during a flare and with my Lemtrada treatments.",
    "Titel" : "Low doses of steroids",
    "Date" : "04-16-2019, 10:22 AM",
    "User" : "pb909",
    "Number_of_total_posts" : "391"
  }, {
    "Post" : "That's exactly the reason that I started this thread !",
    "Titel" : "Low doses of steroids",
    "Date" : "04-16-2019, 04:48 PM",
    "User" : "JerryD",
    "Number_of_total_posts" : "3045"
  }, {
    "Post" : "Steroid ugggggg\nI'm not sure if this was a process for you but.....\nI had my 1st half of Ocevurs.\nOverall fine but apparently I had a pre-med steroid reaction.\nNext day my cheeks looked like Raggedy Ann, they felt like fire ants were eating their way out..\nMOODY, SNAPPY, ANGRY just awful on my wife.\nPost day 3, feel a little better, still look like rag- doll though. So I'll be fine for 10 days until get to do it again. 😂\nAs for the Ocervus I guess no reaction, now we wait to see if it'll help. I do not expect a miracle so there won't be any deep disappointment if I don't begin to feel better after the next 1 /2.\nI would just like to be able to stand tall, walk straight & think more clearly.\nOk maybe a small miracle....\nOriginally posted by Carolinemf View Post\nHi,\nHaven't done the roids, pause, roids again.\nBut have been put on steroids twice for relapses and felt so ill.\nI also had my fathers experience with steroids to compare with.\nThey did a lot of damage to his body that made life very difficult and painful for him.\nSo i decided not to have them again.\ni am curious why ' low dose' ?\nAs a general rule docs hit things hard an fast with roids if the body is under attack by something.\nIts usually long term use that lower doeses are used for.\nIs this a long term thing?",
    "Titel" : "Low doses of steroids",
    "Date" : "05-16-2019, 08:47 AM",
    "User" : "DonnaH",
    "Number_of_total_posts" : "44"
  }, {
    "Post" : "Low dose?\nAlthough 10mg is a low dose, if you take it 4x a day, 40 mg isn't real low. I guess, if it's only for 7 days, maybe it's not bad.\nI've never been Rx that. I used to have a 12-day taper following my 5-day infusion, I think.",
    "Titel" : "Low doses of steroids",
    "Date" : "05-26-2019, 03:52 PM",
    "User" : "Mamabug",
    "Number_of_total_posts" : "4304"
  }, {
    "Post" : "64 yo male, my balance is getting worse and worse and now walking with a walker, and grabbing walls and furniture in the house to steady myself. On Monday 9-18 I received my first dose of Ocrevus. When I returned home I noticed I was not grabbing for walls and furniture like I was before. Tuesday morning I was walking straight and steadily.\nI went to see 2 of my neurologist and their mouths dropped open when they saw me walking. I asked both of them how can this be from being on Ocrevus for one day and they said they didn't know. So when I got home I contacted the manufacturer and asked them if I am a freak of nature or is this Ocrevus working that fast and that good. They could not answer me because their Trial notes didn't start until after 8 weeks. It's like a light switch being flipped on giving me my balance and walk back. I'm not saying I'm cured but I would say I'm 90% back to normal.\nThursday morning, 3rd day on Ocrevus I went to pull my wife's car out and my legs felt stiff so I started to stretch them and I started doing squats on the driveway without holding onto anything. I went in and showed my wife and tears were coming out of me. I really didn't think I would ever feel like this ever again. Anyone have almost instant response from Ocrevus? I'm afraid it's all a dream.",
    "Titel" : "OCREVUScould",
    "Date" : "09-21-2017, 07:22 AM",
    "User" : "Spiders",
    "Number_of_total_posts" : "2"
  }, {
    "Post" : "Re: O treatment\nO my goodness,\nthanks so much for your share, I’m starting on Monday 1st 1/2 dose. Until I read your post I was on the fence. Amen to improving. That’s just what I’ve been trying to find on here is someone to explain the after.\nthanks\nOriginally posted by Spiders View Post\n64 yo male, my balance is getting worse and worse and now walking with a walker, and grabbing walls and furniture in the house to steady myself. On Monday 9-18 I received my first dose of Ocrevus. When I returned home I noticed I was not grabbing for walls and furniture like I was before. Tuesday morning I was walking straight and steadily.\nI went to see 2 of my neurologist and their mouths dropped open when they saw me walking. I asked both of them how can this be from being on Ocrevus for one day and they said they didn't know. So when I got home I contacted the manufacturer and asked them if I am a freak of nature or is this Ocrevus working that fast and that good. They could not answer me because their Trial notes didn't start until after 8 weeks. It's like a light switch being flipped on giving me my balance and walk back. I'm not saying I'm cured but I would say I'm 90% back to normal.\nThursday morning, 3rd day on Ocrevus I went to pull my wife's car out and my legs felt stiff so I started to stretch them and I started doing squats on the driveway without holding onto anything. I went in and showed my wife and tears were coming out of me. I really didn't think I would ever feel like this ever again. Anyone have almost instant response from Ocrevus? I'm afraid it's all a dream.",
    "Titel" : "OCREVUScould",
    "Date" : "05-11-2019, 01:31 PM",
    "User" : "DonnaH",
    "Number_of_total_posts" : "44"
  }, {
    "Post" : "My wife seems to retain water in her legs on a regular basis. Sometimes it goes away, and then other times they're full again. It's very frustrating for her when she is retaining the water because her skin feels so tight that she can't bend her legs easily. She says it feels like her skin will split!\nDoes anyone have this problem? If so, have you found a solution? Thanks!",
    "Titel" : "Retaining Water in the Legs",
    "Date" : "04-22-2019, 10:56 AM",
    "User" : "Bat21",
    "Number_of_total_posts" : "19"
  }, {
    "Post" : "Hi Bat21.\nIf your wife has not seen her Primary Care Physician that would be my suggestion.\nEdema can have many causes such as weight gain, too much sodium/salt, not drinking enough water, inactivity and more, including other health conditions.",
    "Titel" : "Retaining Water in the Legs",
    "Date" : "04-22-2019, 03:32 PM",
    "User" : "SNOOPY",
    "Number_of_total_posts" : "4237"
  }, {
    "Post" : "I'm going through &quot;Retaining Water in the Legs&quot; at this time...\nBat 21,\nI am at this time dealing with fluid in my legs. It started occasionally when I was up in my wheelchair too long and would go down after laying in bed. However, a month after the intermittent episodes, my legs swelled up so bad that the skin was very tight in my feet, ankles and lower legs. My legs were hurting. Even elevating my legs wasn't helping. I cut back using salt, stopped drinking diet soda and starting really pushing water. My neuro was concerned and ordered Lymphodemia treatments. I go twice a week. The therapist does message to stimulate the Lymph system to work more efficiently and afterward the legs are wrapped tightly with ace bandages to encourage drainage through the kidneys. I have been going for 3 weeks now and have lost 3 Liters of fluid from both legs. I am very impressed! The only thing new for me is I switched to Ocrevus infusions last fall for my MS, so I will ask my doctor if there is any relation to that.\nHowever, start with your wife's primary physician. Write down questions for the doctor. Has your wife started new medication recently? Does she see a heart specialist? Are there any other symptoms? I'm sure her doctor will direct you both in a way that is best for her.\nGood Luck to both of You!",
    "Titel" : "Retaining Water in the Legs",
    "Date" : "04-30-2019, 04:29 AM",
    "User" : "Laurie1591",
    "Number_of_total_posts" : "2"
  }, {
    "Post" : "I totally support the advice that anyone with this symptom see their PCP right away. It's an important symptom of many dangerous conditions.\nIn addition, although I am not yet in a wheelchair, I regularly read New Mobility magazine. It is produced by the United Spinal Association and is primarily directed to those in wheelchairs. As I said, I'm not an expert, but the articles in New Mobility certainly suggest that retaining fluid in the legs is an important concern for those who are in chairs.\nGood luck,\nMermaid Susan",
    "Titel" : "Retaining Water in the Legs",
    "Date" : "04-30-2019, 03:33 PM",
    "User" : "MermaidOP",
    "Number_of_total_posts" : "72"
  }, {
    "Post" : "Accorda (Ampyra company) says stopping assistance program because it is coming out as generic in 2018. BUT Nobody can tell me when that will be & price! Anybody know anything? Looks like I will just have to quit...",
    "Titel" : "Generic Ampyra",
    "Date" : "11-10-2017, 06:22 PM",
    "User" : "skeptik",
    "Number_of_total_posts" : "24"
  }, {
    "Post" : "It's stressful, I know\nAll I am told is \"call after the first of the year.\" Even if the \"generic\" is only half the price, it's still too expensive for me, and not covered at a useful tier of Plan D. I guess I best start saving for a wheelchair. But, I will \"call after the first of the year.\" Good luck, Skeptic.\nMermaid Susan",
    "Titel" : "Generic Ampyra",
    "Date" : "12-18-2017, 08:00 PM",
    "User" : "MermaidOP",
    "Number_of_total_posts" : "72"
  }, {
    "Post" : "Generic Ampyra\nOriginally posted by MermaidOP View Post\nAll I am told is \"call after the first of the year.\" Even if the \"generic\" is only half the price, it's still too expensive for me, and not covered at a useful tier of Plan D. I guess I best start saving for a wheelchair. But, I will \"call after the first of the year.\" Good luck, Skeptic.\nMermaid Susan\nPut of curiosity call who? Do you have a phone number?",
    "Titel" : "Generic Ampyra",
    "Date" : "01-07-2018, 10:18 AM",
    "User" : "55SSin17",
    "Number_of_total_posts" : "1"
  }, {
    "Post" : "Amprra\nOriginally posted by skeptik View Post\nAccorda (Ampyra company) says stopping assistance program because it is coming out as generic in 2018. BUT Nobody can tell me when that will be & price! Anybody know anything? Looks like I will just have to quit...\nI'm on Kaiser Medicare Advantage Plus and just got quoted a copay of $400 for a thirty day supply. Kaiser has an assistance program if you qualify with total gross household income at 350% of the poverty level.",
    "Titel" : "Generic Ampyra",
    "Date" : "01-18-2018, 02:31 PM",
    "User" : "PeteS-OR",
    "Number_of_total_posts" : "3"
  }, {
    "Post" : "Originally posted by PeteS-OR View Post\nI'm on Kaiser Medicare Advantage Plus and just got quoted a copay of $400 for a thirty day supply. Kaiser has an assistance program if you qualify with total gross household income at 350% of the poverty level.\nOuch...I am getting $150 copay for my monthly drag, and its already too much",
    "Titel" : "Generic Ampyra",
    "Date" : "04-01-2019, 06:14 PM",
    "User" : "ykarika",
    "Number_of_total_posts" : "3"
  }, {
    "Post" : "Ampyra cost\nI started taking 4-aminopyridine (4-ap) when my insurance denied coverage for Ampyra. It's the main ingredient in Ampyra. I pay around $40 a month from Skip's pharmacy in Florida. It works for me.",
    "Titel" : "Generic Ampyra",
    "Date" : "04-05-2019, 12:39 PM",
    "User" : "nkh18",
    "Number_of_total_posts" : "222"
  }, {
    "Post" : "Ampyra cost\nWhen my insurance denied coverage for me, I switched to 4-aminopyridine, the main ingredient in Ampyra. I get it from Skip's pharmacy in Florida for about $40 a month. It works for me, but I'm no longer walking.",
    "Titel" : "Generic Ampyra",
    "Date" : "04-05-2019, 12:51 PM",
    "User" : "nkh18",
    "Number_of_total_posts" : "222"
  }, {
    "Post" : "I'm 54 diagnosed 6mths ago after a battery of tests with PPMS.\nWHAT NOW. It was hard to swallow the diagnosis, now comes the what's going to happen next, how bad will I get, do I do Ocervus and take a chance this will slow it and not give me breast cancer or a respiratory infection that might go to pneumonia. I'm doing PT and learning how to use a cane (just in case). Most days I feel fine. Sure always sore legs and an achy back. But then again who doesn't. I have felt this way for years, off balance, lazy days, achy muscles,migraines. So now there's a name to it, now what.\nMy girlfriend, kids, and myself have done a LOT of web reading. Now I want to know what real people have to say.",
    "Titel" : "New to PPMS and this site",
    "Date" : "02-14-2019, 01:48 PM",
    "User" : "DonnaH",
    "Number_of_total_posts" : "44"
  }, {
    "Post" : "I was diagnosed with PPMS in 2003 at the age of 53. I chose to take my chances with the riskier DMD’s. I was on Tysabri for 4 years until I tested JCV positive and I’m now on Ocrevus. I know there are risks of infection and cancer. I just want to do everything possible to slow the inevitable progression.\nThere has been a slow steady progression for me. I can’t tell whether any of the DMD’s slowed it down because there’s no way to know what it would have been like without the drugs. I’m 68 and have been in a wheelchair for 3 years.\nThere is no way to predict the course of the disease for you. It’s different for everybody.\nBest wishes on your decision and your PPMS journey. Let us know how you’re doing.",
    "Titel" : "New to PPMS and this site",
    "Date" : "02-14-2019, 09:31 PM",
    "User" : "kmallory1",
    "Number_of_total_posts" : "356"
  }, {
    "Post" : "Sorry that you are facing this but hopefully you are relieved to have a diagnosis that lets you make some medical decisions. Oh, happy Valentines day. I suppose that you feel that you got an arrow to the heart with the dx.\nIt takes a good long while to digest the dx so give yourself permission to have different sorts of days in how you adjust. Please do look at lifestyle interventions- overcomingmultiplesclerosis with Dr. Jelinek has great suggestions. If you look at the NationalMS Society webpage they have a clinical trials link and many of the lifestyle studies are things you could do without being in a trial- ex. vitamin D, exercise, alpha lipoic acid, nutritional changes.\nFor me the hard part is the invisible part of MS and folks not getting the struggles. Even beyond the MS struggles, they don´t seem to get the psychological part that is required to deal with the diagnosis, its uncertainties and it´s possibilities for the future. Oh, and then there´s the financial piece and health insurance. I´m still working on not reacting to \"You look so good.\" and \"I´m so tired.\" I respond in my head, take a deep breath and let go.\nIf you don´t feel like your neurologist is approachable or really hearing you, find another one.",
    "Titel" : "New to PPMS and this site",
    "Date" : "02-14-2019, 09:39 PM",
    "User" : "Temagami",
    "Number_of_total_posts" : "881"
  }, {
    "Post" : "Hi DonnaH and welcome to MSWorld.\nOriginally posted by DonnaH View Post\nI'm 54 diagnosed 6mths ago after a battery of tests with PPMS.\nWHAT NOW.\nNow is the time to try and control the things that you can, by taking good care of yourself physically, mentally, and spiritually.\nChoose healthy foods for your body, and make an exercise plan with your physical therapist. Stretching is especially helpful.\nLet your doctor know if you have depression that lingers, or anxiety that interferes with your daily living. Mental health is as important as physical wellness.\nTake a little time in your busy day, every day, to learn and practice ways to find peace and calm for your spirit.\nLive one day at a time in today, not in the past or future.\nAs you can see, there are many things that you can do now.\nOriginally posted by DonnaH View Post\nIt was hard to swallow the diagnosis, now comes the what's going to happen next, how bad will I get, do I do Ocervus and take a chance this will slow it and not give me breast cancer or a respiratory infection that might go to pneumonia.\nMS is unpredictable. There's no way to know how you will be affected.\nYou may be a good responder to Ocrevus, but you won't know unless you try it. Keep in mind that you can always make the choice to stop taking it if you need to, or want to.\nKeep asking questions, and we'll be glad to help if we can.\nTake Care",
    "Titel" : "New to PPMS and this site",
    "Date" : "02-15-2019, 06:06 AM",
    "User" : "KoKo",
    "Number_of_total_posts" : "4556"
  }, {
    "Post" : "Welcome DonnaH,\nWas going to highlight parts of the responses from the other PPMS responders but soon realized that I agree with everything said!\nSo, since you didn't mention it, may I ask if the dx you received wasn't preceded by a dx of RRMS or SPMS?\nI ask because I found that a neuro often doesn't know the type of MS and tend to want their patients on a DMT immediately. My neurologist dx'd me as RRMS in spring 2008. 8 years later without any signs of remission he said PPMS. The DMT didn't do anything that I know of as far as slowing down the progression. But as kmallory1 said there’s no way to know what it would have been like without the drugs.\nMy progression is very slow at 11 years in, 21 since I suspected a problem. I still have good comprehension, walk, drive and my left side is near perfect... not so for right arm and leg. Will be 69 next month, so I can not whine 'bout it.\nMy $ .02... echos what has been said with strong emphasis on KoKo's opening line.\nOh, and on behalf of a lot of \"real people\" here, Welcome!\nJer",
    "Titel" : "New to PPMS and this site",
    "Date" : "02-15-2019, 10:35 AM",
    "User" : "502E79",
    "Number_of_total_posts" : "894"
  }, {
    "Post" : "[QUOTE=502E79;1517597]Welcome DonnaH,\nWas going to highlight parts of the responses from the other PPMS responders but soon realized that I agree with everything said!\nSo, since you didn't mention it, may I ask if the dx you received wasn't preceded by a dx of RRMS or SPMS?\nI ask because I found that a neuro often doesn't know the type of MS and tend to want their patients on a DMT immediately. My neurologist dx'd me as RRMS in spring 2008. 8 years later without any signs of remission he said PPMS. The DMT didn't do anything that I know of as far as slowing down the progression. But as kmallory1 said there’s no way to know what it would have been like without the drugs.\nMy progression is very slow at 11 years in, 21 since I suspected a problem. I still have good comprehension, walk, drive and my left side is near perfect... not so for right arm and leg. Will be 69 next month, so I can not whine 'bout it.\nMy $ .02... echos what has been said with strong emphasis on KoKo's opening line.\nOh, and on behalf of a lot of \"real people\" here, Welcome!\nThank you I was DX right off. I've been known as the klutz for years and just thought I was. Im not a complainer so I just kept on pumping along. My aches and pains I credited getting older.\nwith my change in dr's he sent me for an MRI. That was 6 mths ago. Since then I've had a spinal tap, and another MRI w/contrast. Blood work like crazy. At 1st I was told I had MS. My Stanford nuro needed my spinal to confirm what he thought. Well confirmed, Primary Progressive\nHe brought up Ocervus and our web search when on again.\nI have an amazing partner who's down for long road. My kids have even surprised me with concern and support. So I feel bad for the folks who don't have that.\nI'm the one who gets angry at myself for my awful mood swings, while my support doesn't hate me for it.\nI/we are preparing for the worst but I'm a fighter and won't go down without a fight....",
    "Titel" : "New to PPMS and this site",
    "Date" : "02-15-2019, 03:02 PM",
    "User" : "DonnaH",
    "Number_of_total_posts" : "44"
  }, {
    "Post" : "Hi DonnaH and welcome to MSWorld\nAt 1st I was told I had MS. My Stanford nuro needed my spinal to confirm what he thought. Well confirmed, Primary Progressive\nMultiple Sclerosis is Multiple Sclerosis regardless of what type a person may have. MS is a progressive disease. The progression is different for all of us. MS has always been known a chronic debilitating disease.\nThe type is determined by the way it behaves. Unless you have been followed by a Neurologist for some years it will take time to know what course your disease follows which in turn will give a Neurologist the knowledge of what type you may have. Do you have Spinal cord lesions?\nI was diagnosed many, many, years ago. At the time of my diagnosis my MRIs where clear but I had a positive Lumbar Puncture (o-bands). My Neurologist said the disease was affecting the spinal cord and he was correct. Through the years my MS followed a relapsing/remitting course but after many years I have transitioned to Secondary Progressive.\nInformation from the National MS Society about the different types of MS\nhttps://www.nationalmssociety.org/Wh...MS/Types-of-MS",
    "Titel" : "New to PPMS and this site",
    "Date" : "02-15-2019, 06:41 PM",
    "User" : "SNOOPY",
    "Number_of_total_posts" : "4237"
  }, {
    "Post" : "Originally posted by DonnaH\nI'm the one who gets angry at myself for my awful mood swings, while my support doesn't hate me for it.\nYeah, I hear you.... frustration can bring out the worst in each of us. Quick burst of anger at times over not being able to accomplish the simplest of things....! Arrrgh. And we move on. Such is life.\nYou appear to have loving support to continue, and a good attitude! IMO, half the battle.\nI would re-read Snoopy's entry:\nOriginally posted by snoopy\nThe type is determined by the way it behaves. Unless you have been followed by a Neurologist for some years it will take time to know what course your disease follows which in turn will give a Neurologist the knowledge of what type you may have.\nShe points out something that struck me immediately and probably others who responded to your thread.\nJer",
    "Titel" : "New to PPMS and this site",
    "Date" : "02-16-2019, 11:47 AM",
    "User" : "502E79",
    "Number_of_total_posts" : "894"
  }, {
    "Post" : "Hello!\nHello DonnaH - and welcome! I'm sure you'll find msworld a great help - I know I sure do!\nI just got back from seeing my new neuro who says PPMS but we need the results from the MRI and/or a LP before an official diagnosis. I just thought I'd share my story real quick to give you more sides. As others have already said, everyone is different and please just take each day as it comes instead of living in a future that probably isn't true anyway.\nI started having noticeable issues about 12 years ago. I'm terrible with timing, so that's a guess. My first issue was my right leg. I was very active, and would start out each day with a vigorous 4 mile walk. At the time, my youngest was about 9 years old and I was a single mom. I would bring a different child with me each morning and it was such a nice time for us But I noticed my right leg and foot was getting unusually tired right at the start of our walk. I shrugged it off and thought maybe I just needed new shoes. I kept switching shoes and nothing seemed to help, but still I shrugged it off.\nThat went on for a few years, and then my whole body just seemed to be breaking down. I was still very active and had a full daily schedule, but found myself not able to keep up, having to rest, take naps, etc. My balance was getting worse and I started falling every so often. Other things began to happen as well. Looking back now it's easy for me to see the problem: I was trying to live like nothing was wrong and that was causing all sorts of stress on the underlying issue and my body was freaking out and protesting.\nI continued to get worse and eventually (finally) saw a doctor. He said several things, took several tests, and then suggested an MRI to check for things like MS. I had no clue what MS was, so I didn't even really hear him. I did not care much for that doctor, so I found another GP and he's been my GP ever since. At my first appointment, he agreed with the first doctor: MS. I also talked to a friend who was a doctor in another country. MS.\nI finally saw a neurologist, but because my brain MRIs were clear, nothing much was done. A few other tests and such, but I felt like I was wasting my time. Since doctors made me anxious and my neuro was 3 hours away and I was not getting anywhere, I quit going for 2 or 3 years. I went back again, and then had another break, and so on.\nFast forward to our current time (for reference, I am 42 years old).\nIn the past 8 or so years I've progressed from being seemingly healthy and active, thin and in shape, to needing a cane, walker, wheelchair, or electric buggy (depending on the activity). My activities and responsibilities have been DRASTICALLY cut down by my loved ones and now all I have to do is sit around ... anything else I manage to get done is considered a bonus. Recently I have begun gaining weight, which is so hard for me to cope with. Not being active is finally taking a toll on that side of things. I do my best to eat healthy (I am very health-conscious when it comes to food!), so I think the only way to help myself with weight now is to be careful with portion size and snacking.\nI have found ways to save energy. I really, really, really want to stay as active and productive as possible, so I just set a timer for 15 to 20 minutes, work on a task at a comfortable pace, and when the timer goes off I sit down and rest as long as I feel I need to. Sometimes I'm able to get back up and do another 15 minutes of 'work' after about a half hour of rest, but usually I need to rest for at least an hour before trying to do something else.\nIt may not sound like much, but in doing things this way I am actually able to get a lot done. In the past I would push myself and then crash for several days. That means getting a lot LESS done.\nReducing stress as much as possible is so very important. Also, I believe a regular bedtime routine and daily nap is crucial.\nOther ways of adapting: I sit down as much as possible when doing tasks. Like dishes for example. I never thought I'd be sitting down to do dishes, but it sure spares my legs! I ask for help. I lower my standards and expectations of myself. I have grab bars and stools in various trouble areas of my home.\nI try to stretch every day.\nBecause of my right side weakness and some confusion, I am not able to drive much. I usually feel safe and able to drive to church and back, but that's it [mostly country roads and about 10 minutes away]. I have a friend that takes me to all of my doctor appointments and does some of my shopping. My daughter helps me out with the rest of the shopping and such.\nI've learned that life is not over!! While we may not be able to do all of the things we used to do, we can still find joy! I find joy in gardening, watching birds, and a few other things. My family does all of the hard work in the garden and I just try to go there each morning, set my stool down, and pick weeds for about 15 minutes each day. This is my happy place. Fresh air, birds singing, breeze blowing, sun shining. I get out there as early as possible to avoid the heat and the mosquitos.\nKeeping a healthy attitude is so vital to your well being. And as others have also said, be careful about anxiety and such. I had not idea that anxiety would be a problem for me, but I find myself getting more anxious as the years go by. This is just not me (well, it is now!!! but it never was in the past). I can tell my loved ones \"I'm done\" and they all know what that means. This has been a huge help. Only those who are closest to me have seen me at my worst, so when someone outside of my close circle happens to see me at my worst it's kind of scary for them to witness. \"My worst\" happens when I've done too much.\nI found this thread by searching for \"ocrevus\" - my neuro wants me to take it as soon as I am diagnosed and I am just not interested. I share the same concerns you do.\nI hope my ramblings have helped in some way.",
    "Titel" : "New to PPMS and this site",
    "Date" : "02-16-2019, 11:52 AM",
    "User" : "jjs",
    "Number_of_total_posts" : "288"
  }, {
    "Post" : "Originally posted by 502E79 View Post\nI would re-read Snoopy's entry:\nOriginally posted by SNOOPY View Post\nThe type is determined by the way it behaves. Unless you have been followed by a Neurologist for some years it will take time to know what course your disease follows which in turn will give a Neurologist the knowledge of what type you may have. Do you have Spinal cord lesions?\nShe points out something that struck me immediately and probably others who responded to your thread. Jer\nMy PPMS dx came after about a year of accumulated neurologic deficits (continuous progression with no relapses), and after the other diagnostic criteria were met per MRI results and CSF analysis.\nMaybe by going to an MS Center with MS Specialists (referred to by my neuro for confirmation of the MS 'type') helped with a quicker dx.\nTake Care",
    "Titel" : "New to PPMS and this site",
    "Date" : "02-16-2019, 12:20 PM",
    "User" : "KoKo",
    "Number_of_total_posts" : "4556"
  }, {
    "Post" : "Hi everyone. I'm here as the husband of a newly diagnosed MS sufferer.\nI'm learning as I go as we both are, but there are some things that doctors won't tell you or simply won't accept responsibility for so I have to ask people for anecdotal evidence, and hopefully you guys can be a source for me.\nI could write a novel, but I'll get to the point. My wife was given two days of 1000 mg Solu-Medrol IV in the hospital and then 1250 oral at home to help with calming down the lesion she had which started this off.\nI know all docs have different protocols, but she was not titrated down after the 3 day dose with anything.\nShe was actually feeling a lot better BEFORE her diagnostic spinal tap and eventual steroid regimen in the hospital and now she has the sensation that her head is huge and is generally feeling like crap.\nCan any of you out there share a similar experience with a high-dose steroid regimen for MS? Other folks I've asked have said yes,the steroids made them feel awful and that a couple of weeks was needed to get back to normal. She is despondent and I need to help her any way I can. Thank you.",
    "Titel" : "IV steroid megadose and possible side effects?",
    "Date" : "12-17-2018, 03:41 PM",
    "User" : "Swataz",
    "Number_of_total_posts" : "1"
  }, {
    "Post" : "Originally posted by Swataz View Post\nOther folks I've asked have said yes,the steroids made them feel awful and that a couple of weeks was needed to get back to normal. She is despondent and I need to help her any way I can. Thank you.\nHello Swataz and welcome! Thank you for coming to us for the sake of your wife. I was given 5 days of Solu-Medrol IV almost 20 years ago for a nasty flare of optic neuritis. I was not given a taper down schedule. After the 5th day I was feeling horrible! I thought I was having a heart attack, I was filled with anxiety, was crying all the time and I couldn't sleep.\nIn short, I found out I was having major panic attacks after seeing my pcp who prescribed valium to ease things up and calm me down. It took a day to kick in but helped. However, my vision did not return to near normal for about 6 weeks afterwards and is still somewhat compromised. This is my story - others have different experiences.\nI have opted to never have another IV treatment after this first time. I never wanted to go through that experience ever again. Nowadays, I hear that a taper down schedule is mostly used. I am sorry your wife is having a hard time and I can certainly empathize with her. It does take time to get back to normal.\nYou might want to talk with her neuro or primary care doctor and let them know what's going on. In the meantime, be gentle with her - her body is going through a lot of stress. My husband did all the cooking, cleaning and laundry while I recuperated - lucky me!\nWhen she is feeling better, let her know we'd love to have her check in with us.\nBoth of you take care and send her good thoughts from MSWorld",
    "Titel" : "IV steroid megadose and possible side effects?",
    "Date" : "12-17-2018, 04:56 PM",
    "User" : "Seasha",
    "Number_of_total_posts" : "4492"
  }, {
    "Post" : "My neuro told me today that high dose steroids were linked to necrodisvor decaying of the femur. Could happen on ur first dose or eleventh.",
    "Titel" : "IV steroid megadose and possible side effects?",
    "Date" : "12-17-2018, 05:56 PM",
    "User" : "Boudreaux",
    "Number_of_total_posts" : "578"
  }, {
    "Post" : "Hi Swataz, it's so great of you to reach out on behalf of your wife, she must be really special. Regarding the IV, I am unfamiliar with the dosage your wife is on. If the IV was 1,000 mg per infusion the 1,250 is even more.\nI've had the IV quite a few times, the last one was approx 2007 so things may have changed since then. My dosage was 1,000 mg IV for 5 days then an oral dose to taper off the med starting at around 5 pills of 80 mg and decreasing the dose until I'm down to 1 mg for a few days. I was told that 1,000 mg is a dangerously high dose to just stop so the oral taper was needed.\nRegardless, the entire IV/oral experience is nothing short of horrible. During the IV part, I can't sleep, have endless energy, anger easy (I'm normally such a mellow lady) and eat my face off. After the IV comes out I just crash for a few days, no high dose med to keep me awake plus all the false energy I wasted on the IV comes back to haunt me. Also I was warned to stay away from people that are sick with the flu, cold, etc. The high dose is meant to shut down your immune system (so it stops attacking and keep reducing inflammation). It just makes it very easy to catch something.\nI know it's hard to believe that when she feels this horrid things are improving but it may take a wee while for her to get through the side effects of the med. I used to say that the entire IV/oral treatment made me feel worse than my MS did but things really did improve. Only once out of approx 8 treatments did my affected body part not respond favourably, my left eye only sees light and shadows but it couldn't even see that much before the treatment.\nI wish the 2 of you well with this, please don't be shy here, there's so much great advice from all angles.\nJen",
    "Titel" : "IV steroid megadose and possible side effects?",
    "Date" : "12-17-2018, 09:29 PM",
    "User" : "Cat Mom",
    "Number_of_total_posts" : "1730"
  }, {
    "Post" : "Hi, I had four days of solu-medrol - the dosage was very high, followed by an oral taper. Sorry I don't have the exact amounts. I had it for optic neuritis where I completely lost the vision in one eye (the infusion helped).\nI did not have a horrible experience. However, I read up about how to possibly avoid bad side effects. I simply reduced sodium and sugar intake to nearly zero, unless it was natural in what I was eating. I also kept pretty low fat. I hydrated like I had the flu, and I rested as much as possible.\nThe first day of steroids made me feel like a million bucks, but I guess that's because I was relapsing and they helped with inflammation and some stabbing neuritis pain in my eye also was relieved pretty quickly. The taper was ok - the hardest part was modifying my diet because I had read that salty food can make you feel terrible when you're on steroids, but that the urge to snack salty foods is indeed powerful.\nWishing you and your wife the best.",
    "Titel" : "IV steroid megadose and possible side effects?",
    "Date" : "12-18-2018, 02:31 AM",
    "User" : "gargantua",
    "Number_of_total_posts" : "361"
  }, {
    "Post" : "I did 3 days of high dose (1000mg/day) IV steroids for three days a year ago. The first infusion day I just slept; the second infusion day I got ALL my Christmas wrapping done in one afternoon! The third infusion day, I just felt crappy...…………….and continued to feel crappy for about 5 weeks. I did no oral taper.\nI had none of the usual steroid side effects: no blood sugar issue, no swelling/water retention, no insomnia, no increased appetite, no mood swings. I just felt bad...……….like a low grade flu. Tired. achy, lack of appetite and wanted to stay in bed all the time, yet I continued to work full time.\nI had never had steroid infusions before, so I'm not sure how much they helped. Four months after my exacerbation, I left work on short term disability. I truly believe I would have had a better outcome if I had taken time off work to recover. Encourage your wife to take the time she needs to maximize her recovery!",
    "Titel" : "IV steroid megadose and possible side effects?",
    "Date" : "12-18-2018, 01:00 PM",
    "User" : "Canary54",
    "Number_of_total_posts" : "146"
  }, {
    "Post" : "Hi and welcome to the message boards. I have had several IV steroid infusions in the last 2 years. In January 2017, my neurologist gave me 5 days of steroids, 1000mg per dose. Then, my neuro prescribed a tapering dose of steroids for 3 or 5 days. I didn't have any problems with them. In February 2018, I had 3 days of the same stuff with 3 days of a taper. No problems.\nI am curious. Is your wife being treated by an MS specialist ? IMO you need to have an MS specialist to treat MS ! Good luck !",
    "Titel" : "IV steroid megadose and possible side effects?",
    "Date" : "12-18-2018, 08:26 PM",
    "User" : "JerryD",
    "Number_of_total_posts" : "3045"
  }, {
    "Post" : "I can only speak for myself but I was in the hospital and had 5 days of high dose IV steroids. When they discharged me they refused to give me tapering steroids so I ended up calling my PCP and he sent something in for me. Stopping steroids cold turkey can be bad and I wasn't going to risk another trip to the hospital.",
    "Titel" : "IV steroid megadose and possible side effects?",
    "Date" : "12-18-2018, 08:43 PM",
    "User" : "Daisycat",
    "Number_of_total_posts" : "705"
  }, {
    "Post" : "I have had IV steroids multiple times at home. The dosage was 1000mg though. Depending on flare, they were prescribed for either 3,4, or 5 days.\nInsomnia was the biggest issue. I would get headaches, but from not sleeping. Then I would start to feel horrible. You can only go so far on an hour's sleep. So if she needs something to sleep, let the neuro know. That helped me.\nI had the oral Prednisone taper the first time, but didn't tolerate it too well. So after that, no taper following IV steroids.\nI hope your wife is feeling better. Thanks for looking out for her.",
    "Titel" : "IV steroid megadose and possible side effects?",
    "Date" : "12-20-2018, 07:57 AM",
    "User" : "pennstater",
    "Number_of_total_posts" : "2688"
  }, {
    "Post" : "I've only had steroids for a flare once, seven years ago. I had 3 days of 1000mg IV with no taper. I thought that tapers weren't done very often anymore, but with the other responses here maybe I'm mistaken. I'm the opposite of most people, steroids make me sleepy and sort of spacey. I was super careful to limit sugar and salt intake, and also took a few days of Zantac to prevent heartburn.\nI have no real issues with IV steroids, but I cannot tolerate oral steroids at all. I did a 9 mg taper for something other than MS and it made me suicidal.\nSometimes steroids make MS symptoms better right away, but sometimes symptoms continue to get worse in spite of the steroids.",
    "Titel" : "IV steroid megadose and possible side effects?",
    "Date" : "12-31-2018, 09:23 PM",
    "User" : "TheMiddleWay",
    "Number_of_total_posts" : "27"
  }, {
    "Post" : "Steroid Taper\nI had 5 days of 1000mg IV with 25 day taper. Physically I felt fine and my double vision and migraines cleared up in 2-3 days. Although I felt normal emotionally, my wife noticed that I was angered easily and not my usual cheery self. I believe the taper is important and you should question your doctor if it is not prescribed in case of a future event.\nGood luck and a good year to you both!\nScott",
    "Titel" : "IV steroid megadose and possible side effects?",
    "Date" : "01-06-2019, 09:48 AM",
    "User" : "dingo",
    "Number_of_total_posts" : "9"
  }, {
    "Post" : "I recently got a new Dr. Ho TENS unit as I find it useful for pain in my back and leg, and it came with an extra set of earlobe clips that it claimed promoted sleep and relaxation. Great, I gave it a go last night. Funny sensation of tickling in my ears while working but not entirely unpleasant. What was a welcome surprise was that when I took it off and rolled over to go to sleep, I noticed I did not have my usual full body random twitching that I normally have to get through as I fall asleep. I watched and waited...nothing! Did a bit of googling just now and found tens on your ears is called CES or Cranial Electrostimulation and can be helpful for spasticity. This is encouraging, it’s only been 1 night but I intend to continue my personal research into this! Just wanted to share and ask if anyone else has tried earlobe TENS and what your experience was.",
    "Titel" : "TENS unit used on ears with surprise results",
    "Date" : "12-24-2018, 07:23 AM",
    "User" : "Safire1310",
    "Number_of_total_posts" : "7"
  }, {
    "Post" : "Originally posted by Safire1310 View Post\nI recently got a new Dr. Ho TENS unit as I find it useful for pain in my back and leg, and it came with an extra set of earlobe clips that it claimed promoted sleep and relaxation. Great, I gave it a go last night. Funny sensation of tickling in my ears while working but not entirely unpleasant. What was a welcome surprise was that when I took it off and rolled over to go to sleep, I noticed I did not have my usual full body random twitching that I normally have to get through as I fall asleep. I watched and waited...nothing! Did a bit of googling just now and found tens on your ears is called CES or Cranial Electrostimulation and can be helpful for spasticity. This is encouraging, it’s only been 1 night but I intend to continue my personal research into this! Just wanted to share and ask if anyone else has tried earlobe TENS and what your experience was.\nSafire1310 ~\nWow, that is encouraging!\nSo glad that you got relief for body twitching with the earlobe TENS unit.\nSounds promising for spasticity relief.\nPlease continue to share your experiences with it.\nThank you!\nTake Care",
    "Titel" : "TENS unit used on ears with surprise results",
    "Date" : "12-24-2018, 09:46 AM",
    "User" : "KoKo",
    "Number_of_total_posts" : "4556"
  }, {
    "Post" : "What part of zee lobe?",
    "Titel" : "TENS unit used on ears with surprise results",
    "Date" : "12-24-2018, 07:48 PM",
    "User" : "Temagami",
    "Number_of_total_posts" : "881"
  }, {
    "Post" : "On my earlobe, the bottom, is how these clips I have are meant to be used.",
    "Titel" : "TENS unit used on ears with surprise results",
    "Date" : "12-25-2018, 12:06 AM",
    "User" : "Safire1310",
    "Number_of_total_posts" : "7"
  }, {
    "Post" : "For those of you that take fatigue meds, do you take them as soon as you get up or do you wait until you feel tired? If you take a second dose, when do you take that?\nSome days my med helps me and other days it doesn't help at all. I also try to not take it everyday.",
    "Titel" : "Fatigue Meds",
    "Date" : "07-15-2016, 12:34 PM",
    "User" : "its2much",
    "Number_of_total_posts" : "819"
  }, {
    "Post" : "FIGHTING FATIGUE\nHello! I too suffered from fatigue. Dr. prescribed meds (don't remember what)\ndidn't give me much relief. Then I tried sub-lingual Vit.B (under your tongue) , after eating breakfast. Repeat after lunch. Very easy to do and cherry flavored!\nGood Luck",
    "Titel" : "Fatigue Meds",
    "Date" : "07-15-2016, 05:15 PM",
    "User" : "marol",
    "Number_of_total_posts" : "21"
  }, {
    "Post" : "I have had mixed results, Adderall did not help at all,Provigil ( modafinil) helped a little at first but soon that wore off and quit working, now I am taking Nuvigil, and it is to soon to tell yet if it is helping. With the first two I did try taking them at different times of the day with differing results, but none of the results were sufficient. Good luck",
    "Titel" : "Fatigue Meds",
    "Date" : "07-15-2016, 07:31 PM",
    "User" : "hunterd",
    "Number_of_total_posts" : "3099"
  }, {
    "Post" : "nuvigil\nI'm currently having a bout of fatigue and my nuvigil doesn't really seem to be working. I find it takes forever to kick in...like 4 hours ish. I take it as soon as I get up or if I wake up before getting up I take it then. It could be 4 or 5 am. I can still sleep.\nI also use adderall (the quick acting) for days I need extra energy. It's more like a jittery awake feeling though. I take it around noon.\nI prefer the nuvigil. It seems to give me more motivation to get things done. Taking a day off (which I rarely do!) does seem to make it more effective. Neither are a miracle cure and I wish they worked better.",
    "Titel" : "Fatigue Meds",
    "Date" : "10-15-2018, 07:57 PM",
    "User" : "knitter2",
    "Number_of_total_posts" : "5"
  }, {
    "Post" : "I am a 100% service connected veteran with a SMC, special monthly connection. For a service connected veteran the VA has many levels of service commection. I started many years ago with 10% for tinnitus then 20%, 70% PTSD and 100% for MS. I was then rated SMC R1 and finally SMC R2 which for me is the end of my journey.\nI would be interested in hearing from any other veterans that are service connected.\nRich",
    "Titel" : "Veterans with SMC rating",
    "Date" : "06-23-2018, 05:32 PM",
    "User" : "richjh101",
    "Number_of_total_posts" : "48"
  }, {
    "Post" : "I'm SC 10%\nHi, Rich,\nI'm Service Connected 10% for sinuses but am on appeal (over 8 years now) to add asthma to it.\nI am not SC for MS. While my symptoms did start while I was on active duty, I never relayed any of them to my providers (you know how they are at sick call, even if you are an officer!) so can't support a claim. I was diagnosed about 14 years after I got off AD.\nWhile I'm not SC for MS, I have Blue Cross Federal (I work at the VA), and the only copays I pay are pharmacy for non-SC meds. I have had much of my treatment and testing for MS done at the VA and all of that was covered by Blue Cross Fed and the VA didn't charge me co-pays. So that is nice!\nI'm glad you were able to get SC for MS! That can be a huge hurdle to overcome.",
    "Titel" : "Veterans with SMC rating",
    "Date" : "06-25-2018, 06:16 PM",
    "User" : "cptmelissa",
    "Number_of_total_posts" : "41"
  }, {
    "Post" : "I kinda backed into the service connection for MS. My neurologist saying “it was more likely than not” that by the VA taking me off Betaseron for 3 months while I was in the PTSD program causing me to have a major exacerbation. It was this attack that led to my major disability.\nIt took 9 years for my final claim and a trip to the BVA “Board of Vertrns Appeals” to be finally have my claim accepted.\nRich\nOriginally posted by cptmelissa View Post\nHi, Rich,\nI'm Service Connected 10% for sinuses but am on appeal (over 8 years now) to add asthma to it.\nI am not SC for MS. While my symptoms did start while I was on active duty, I never relayed any of them to my providers (you know how they are at sick call, even if you are an officer!) so can't support a claim. I was diagnosed about 14 years after I got off AD.\nWhile I'm not SC for MS, I have Blue Cross Federal (I work at the VA), and the only copays I pay are pharmacy for non-SC meds. I have had much of my treatment and testing for MS done at the VA and all of that was covered by Blue Cross Fed and the VA didn't charge me co-pays. So that is nice!\nI'm glad you were able to get SC for MS! That can be a huge hurdle to overcome.",
    "Titel" : "Veterans with SMC rating",
    "Date" : "06-26-2018, 02:02 PM",
    "User" : "richjh101",
    "Number_of_total_posts" : "48"
  }, {
    "Post" : "whats your experience on gabapenton what did you used it for and you still on it",
    "Titel" : "Gabapenton",
    "Date" : "09-01-2016, 09:26 AM",
    "User" : "DebRA",
    "Number_of_total_posts" : "94"
  }, {
    "Post" : "I have been on Gabapenten (sp) for years. It is supposed to keep nerve pain in my legs from flaring. I think it works It seems to be under control.. I do not know if I can attribute it to it or the Tysabri I'm on. ?? Anyway I am thankful the nerve pain isn't worse.",
    "Titel" : "Gabapenton",
    "Date" : "09-01-2016, 06:28 PM",
    "User" : "lindaincolorado",
    "Number_of_total_posts" : "899"
  }, {
    "Post" : "I was put on Gabapentin for pain. I haven't had any great side effects from it, apart from it making me feel a little bit ambivalent about most things when on a higher dose.\nI've recently discovered, as I've lowered my dose, that it's been helping with nystagmus type symptoms so an added bonus there. I've weaned down to 300 mg per day but will probably have to go back up to 600 as it's quite nice only seeing one of some things.",
    "Titel" : "Gabapenton",
    "Date" : "09-01-2016, 06:37 PM",
    "User" : "Poppy7402",
    "Number_of_total_posts" : "241"
  }, {
    "Post" : "I started on gabapentin for parathesias, had electric shock sensations and also spasms in my legs. Took 100 3 x a day and it was much better. Recently started having seizures though and they have increased my dose to 200-200-400. My balance is way off from that dose though and I've fallen a few times. Seizures are still going on too so not helpful for that. So back down to 200-100-200 and moving on.",
    "Titel" : "Gabapenton",
    "Date" : "09-02-2016, 08:13 AM",
    "User" : "AriD",
    "Number_of_total_posts" : "351"
  }, {
    "Post" : "I was up to 800mg three times a day with a morphine as well. There is no doubt that I would give up the morphine way before I ever gave up the Gabapenton. It was upped to 1200mg 3 times a day and could have gone up to 1600mg at max dose. I have been switched to Lyrica and have not decided if it is doing enough yet.",
    "Titel" : "Gabapenton",
    "Date" : "11-17-2017, 06:22 PM",
    "User" : "MarkDunck",
    "Number_of_total_posts" : "16"
  }, {
    "Post" : "Gabapentin\nI was on Gabapentin, Baclofen and Morphine for years. I made the switch to Prialt which is a non narcotic. I had to wean of the Morphine while increasing the Prialt. This took around 6 months. I have found this medication to be more efficient in controlling my chronic pain. This medication has to be administered through a Baclofen pump. As a side benefit I have been able to eliminate any oral Baclofen.\nRich\nOriginally posted by MarkDunck View Post\nI was up to 800mg three times a day with a morphine as well. There is no doubt that I would give up the morphine way before I ever gave up the Gabapenton. It was upped to 1200mg 3 times a day and could have gone up to 1600mg at max dose. I have been switched to Lyrica and have not decided if it is doing enough yet.",
    "Titel" : "Gabapenton",
    "Date" : "06-25-2018, 01:13 PM",
    "User" : "richjh101",
    "Number_of_total_posts" : "48"
  }, {
    "Post" : "Gabapentin provided marginal relief for me. Medical Marijuana is substantially more helpful for pain and spasticity. I do not take Gabapentin since starting MMJ 10 moths ago. I take MMJ at a 1:1 ratio of CBD:THC",
    "Titel" : "Gabapenton",
    "Date" : "06-25-2018, 01:59 PM",
    "User" : "Poolwatcher",
    "Number_of_total_posts" : "127"
  }, {
    "Post" : "Long story short, I'd been really grouchy for awhile. Exhausted, not able to focus for long, etc. I realized after awhile it was from unceasing neuro pain. I'd been taking the same amount of Gabapentin, 2400-3600 (give/take a few hundred mgs.) for the past 5-6 years. It wasn't working as well for me anymore. It crept up so slowly that I didn't pt it all together.\nI tolerated gabapentin quite well, no issues, and when it worked well it was a life saver! But I wasn't getting enough relief. So doc said to try Lyrica. Hrm. Skeptical. A few days ago I took my first dose. Joy! The burning, stabbing, needling, tingling in my arms, face, and legs quieted to a beautiful dull awareness...then, JOY! I had almost 2 hours of NO pain and just mild-feeling numb weirdness.\nI admit, I fricken' cried from relief. I am taking 400mg, spread out in 4 doses through the day/evening. I hope-hope-hope Lyrica continues to work for me...as I am allergic to tricyclic antidepressants and Cymbalta (terrible cardiac issues from both), so end of the neuro-pain line for me.\nJust wanted to post in case some one was in the same pain-boat.",
    "Titel" : "Gabapentin to Lyrica = excellent!",
    "Date" : "08-25-2016, 10:35 PM",
    "User" : "KateA2",
    "Number_of_total_posts" : "320"
  }, {
    "Post" : "It works for me\nKate,\nI take two 75mg twice per day for a few yearsand have found it much better than Gabapentin which I had since 1984.\nRich",
    "Titel" : "Gabapentin to Lyrica = excellent!",
    "Date" : "06-23-2018, 05:43 PM",
    "User" : "richjh101",
    "Number_of_total_posts" : "48"
  }, {
    "Post" : "Hi all!\nI have been living with MS for a long time. ON in 1985. Diagnosis in 1990. Like many of you spasticity is a problem.\nIn 2003 I got my first baclofen pump which has helped.\nNow my 2nd pump is over 6 years old and will need to be replaced sometime soon. I'm not really sure why I'm posting except I have a different doctor who handles my pump refills. He is also a neurosurgeon so he'll be doing the surgery.\nI guess I'm just nervous because I'm older (58) than I was before and also will be having the surgery in a different hospital and by a different doctor than my first two pumps. Guess I'm just looking for support.\nThanks! Ei",
    "Titel" : "Time for a new pump!",
    "Date" : "06-21-2018, 07:00 AM",
    "User" : "Leenyi",
    "Number_of_total_posts" : "116"
  }, {
    "Post" : "1 yr old \"pumpster\" here and 57. If you have confidence in your new team, you should be good to go. Good luck and God speed! (and loose limbs).",
    "Titel" : "Time for a new pump!",
    "Date" : "06-21-2018, 09:49 AM",
    "User" : "Brad1138",
    "Number_of_total_posts" : "84"
  }, {
    "Post" : "Thanks Brad.\nI'm not too worried since I didn't have any problems with my other pump surgeries. I just don't like being in the hospital.\nI'm pretty self sufficient but they won't even let me go to the bathroom by myself!\nThanks again! Ei",
    "Titel" : "Time for a new pump!",
    "Date" : "06-21-2018, 03:02 PM",
    "User" : "Leenyi",
    "Number_of_total_posts" : "116"
  }, {
    "Post" : "I agree. Being in a hospital is no fun. They also loaded me up with antibiotics: extra, supreme no fun!",
    "Titel" : "Time for a new pump!",
    "Date" : "06-22-2018, 06:55 AM",
    "User" : "Brad1138",
    "Number_of_total_posts" : "84"
  }, {
    "Post" : "I had my pump replaced last year. It barely counts as a hospital visit when they send you home as soon as you open your eyes. I was in at 7:00, out at noon. Half of that was filling out paperwork and waiting. I’m 67, so being older did not seem to matter.\nI hope your replacement goes well.",
    "Titel" : "Time for a new pump!",
    "Date" : "06-22-2018, 11:24 AM",
    "User" : "kmallory1",
    "Number_of_total_posts" : "356"
  }, {
    "Post" : "Wow kmallory! That's great they got you in and out so quickly. I had all three of my surgeries in a hospital. It was outpatient but I had to spend the night. Then they released me in the morning. It was a real pain.\nThanks for your response it sounds like you have a good attitude!\nHey Brad I came across an old thread of yours. You failed your test dose? Does the pump work for you now?\nMine works ok. Keeps me from being stiff as a board. Also cuts out the annoying spasms, but it's not perfect.\nThanks for your responses.\nEi",
    "Titel" : "Time for a new pump!",
    "Date" : "06-22-2018, 04:54 PM",
    "User" : "Leenyi",
    "Number_of_total_posts" : "116"
  }, {
    "Post" : "Thanks for your response kmallory!\nI forgot about people saying they were in and out so quickly. My surgeries were considered outpatient too but I had to spend the night. It's a real pain. I'm glad you didn't have any problems.\nHey Brad. I came across an old thread. You failed your test dose. Does the pump work for you now?",
    "Titel" : "Time for a new pump!",
    "Date" : "06-22-2018, 05:07 PM",
    "User" : "Leenyi",
    "Number_of_total_posts" : "116"
  }, {
    "Post" : "Sorry about the similar posts I didn't think the first went through. Take care.",
    "Titel" : "Time for a new pump!",
    "Date" : "06-22-2018, 07:16 PM",
    "User" : "Leenyi",
    "Number_of_total_posts" : "116"
  }, {
    "Post" : "Originally posted by Leenyi View Post\nT\nHey Brad. I came across an old thread. You failed your test dose. Does the pump work for you now?\nFirst test dose at 50 didn't do a thing. Then, a month later, they tried 100, and it worked. I had a pump installed in April '17.",
    "Titel" : "Time for a new pump!",
    "Date" : "06-23-2018, 07:08 AM",
    "User" : "Brad1138",
    "Number_of_total_posts" : "84"
  }, {
    "Post" : "Baclofen pump replacement\nLennyi,\nI am 69 and will be going in for my 3rd pump in a few months. I have never thought about the surgery since I have always handled them very well. I have been through quite a few surgeries since 1984. I have had lumbar spinal fusions with rods and screws, sacral stimulator in and out, colostomy and a few more.\nI have no Baclofenin my pump now. The main medication is Prialt (Ziconotide)which replaces Morphine and Baclofen. For me it works better than both medications.\nRich",
    "Titel" : "Time for a new pump!",
    "Date" : "06-23-2018, 05:13 PM",
    "User" : "richjh101",
    "Number_of_total_posts" : "48"
  }, {
    "Post" : "Hithere\nMyheart goes out to all those people who have 'full on' MS symptoms.\nHowever,we would really like to know if anyone else out there is having the samesingular symptom as my wife.\nShewas diagnosed with MS some seventeen years ago when she was thirty following aMRI scan that showed up a lesion in the brain.\nLittleor no problems apart from slight limp since.\nThena few years ago her left leg starting spasming with increased frequency andincreased pain making sleep very difficult.\nRecentMRI scan show no further lesions in brain or spine and consultant said this wasvery unusual and is reasonably confident that spasms will not spread anyfurther.\nTreatmentoffered is the usual MS drugs but we were wondering if there are any otherpatients with such a similar 'singular sclerosis' and if there are, whattreatment did they have?\nAllcomments gratefully appreciated.\nKindregards\nStephenand Margery",
    "Titel" : "Is my wife Margery the only person in the world with this singular MS symptom?",
    "Date" : "04-25-2017, 08:48 AM",
    "User" : "stephenjohnpric",
    "Number_of_total_posts" : "1"
  }, {
    "Post" : "Hi John and Margery,\nI don't have a \"singular\" lesion but I have had the same relatively small quantity for about 20 years.\nI have constantly heard from docs -no new lesions, stable. And compared to many others dealing with ms i consider myself to be very fortunate in that my level of disability isn't very severe especially considering i have had ms for over 30 yrs now.\nBut i have been researching a lot more in the last few yrs and have learned a lot that i wasn't previously aware of. As well researchers have learned a lot of new info as well.\nFor example it is no longer a reliable supposition to say - no new lesions, stable.\nBecause although the lesion load used to be the principle way to gauge progression and disability , it is now known that 'white matter damage' isn't the only damage being done.\nIn the back ground 'grey matter damage\" is occurring and this is now believed to contribute more to overall disability than lesions by some.\nThis 'grey matter damage' can cause brain and nerve atrophy and cause the patient to progress despite no visible increase in lesion load.\nIf Margery has had ms for 17 yrs plus it is possible that she may be transitioning to spms as well so you may like to discuss this with doc.\nHope this helps,\nAll the best,\nCaroline.",
    "Titel" : "Is my wife Margery the only person in the world with this singular MS symptom?",
    "Date" : "04-25-2017, 07:13 PM",
    "User" : "Carolinemf",
    "Number_of_total_posts" : "584"
  }, {
    "Post" : "No, but did he label it spasticity? This is common MS symptom and there are meds that can treat the symptom.\nAs far as singular, I would say singular, until it's not. We can hope it doesn't progress, but noone an guarantee it wont. Since it's been mild for 17years, that is a good prognosis.\nHas your wife had a c-spine MRI as well as brain? If not, may be worth getting to see what is going on there.",
    "Titel" : "Is my wife Margery the only person in the world with this singular MS symptom?",
    "Date" : "04-25-2017, 08:26 PM",
    "User" : "pennstater",
    "Number_of_total_posts" : "2688"
  }, {
    "Post" : "Hi Stephen:\nOriginally posted by stephenjohnpric View Post\nShe was diagnosed with MS some seventeen years ago ... Little or no problems apart from slight limp since.\nIf your wife has had little to no problems in 17 years, then I'm guessing that she hasn't had a lot of MRIs in that time. While it's possible that your wife has had only one lesion in her brain in all this time, it's also possible that there have been other lesions at other times, but that one has been the only one present at the time of her MRIs so is the only one that was ever captured in an image.\nIt's well known that lesions, particularly small ones, can come and go on their own over time. If a person doesn't have MRIs very often, it's possible that small lesions have come and gone over time and were just never present at the time an MRI was done. There's a great online article available that contains time-lapse videos showing how one man's brain lesions waxed and waned over MRIs taken a month apart over the course of a year. Any two of those images taken months apart could have looked essentially the same, leading to the false impression that nothing significant had happened in between them. If the link works properly, you can see it here: http://www.msdiscovery.org/news/news...more-meets-eye.\nOriginally posted by stephenjohnpric View Post\nconsultant said this wasvery unusual\nYes, it is very unusual for a person with MS to have only one lesion over a large span of years, but 1) it can happen due to the randomness of MS and the great variability that exists in presentation, and 2) there remains the unknown possibility that there may have been other lesions that have come and gone and never caused any significant symptoms that were never caught on MRI.\nOriginally posted by stephenjohnpric View Post\nconsultant ... is reasonably confident that spasms will not spread any further\nThat's a reasonable assumption based on the one longstanding lesion. If no other significant lesions have shown up over 17 years, there may not be any significant lesions in the future that will cause spasticity. That's not a guarantee, but it's a reasonable assumption to make based on 17 years of history.\nIt's also reasonable to assume that that one lesion is acting as lesions do over time and causing more symptoms as the nerves affected by the lesion deteriorate. The continuing decline of the nerve cells can cause new symptoms even though the lesion looks the same on MRI.\nSo that part of your wife's history is not unusual -- normal and expected progression of MS (even only one lesion!) over time leading to new symptoms. Even with treatment medications available over the last 15 years, some people with MS still transition to the secondary progressive stage at about 15 years. It sounds like that's what's happening in your wife's case.\nAlso, spasticity is very common in people with MS. So your wife's case isn't at all unusual in that respect. It doesn't really matter how many lesions are causing the spasticity or where they are. The treatment options are the same -- medications that include a nerve \"quieter,\" a muscle relaxer, or a combination of both. Other things like physical therapy, judiciously applied heat, or massage can help prevent or relieve some people's spasticity. But spasms that occur at night and affect sleep seem to respond best to the regular and continuous taking of medication so that a steady-state level (as much as possible) can be achieved that will carry the prevention or reduction of spasticity through the night.\nI had one very large spinal cord lesion 15 years ago that has resolved to the point that it's not visible on my MRIs anymore, but the leg spasms -- particularly at night -- have remained. I take baclofen regularly every night to prevent the terrible, painful leg spasms that used to wake me up, sometimes several times a night.\nYour wife's leg spasticity and pain aren't uncommon, and the treatment meds are pretty much the same for everyone. I hope she's able to be successful with one of them and get some relief.",
    "Titel" : "Is my wife Margery the only person in the world with this singular MS symptom?",
    "Date" : "04-26-2017, 01:17 AM",
    "User" : "jreagan70",
    "Number_of_total_posts" : "897"
  }, {
    "Post" : "The link that JR posted is a wonderful video that every MS patient should watch. The way our lesions come and go is amazing.\nBut as to a patient being plagued with only one lesion, first there's this entry in\nWheelchair Kamikaze (a very popular MS blog.) He has only had one lesions and it has not changed in all his years with MS, yet his condition is progressing. Unlike your wife, his lesion\nhasn't changed in all these years. He's had specialist after specialist examine him and MS is the closest diagnosis they can come up with...here's his story:\nhttp://www.wheelchairkamikaze.com/20...rosis-and.html\nPersonally, I have one lesion that is characteristically MS, and takes up a good bit of real estate\nin an area of my brain that isn't very large. But most, if not all, of my symptoms have been linked\nto that one lesion. But there again, in the \"snapshots\" (MRIs) they've taken over the years, nothing\never charges, at least not in the \"swatches of time\" we've observed my brain.\nI'm off MS meds for the last couple years, and it hasn't affected anything.",
    "Titel" : "Is my wife Margery the only person in the world with this singular MS symptom?",
    "Date" : "04-29-2017, 12:13 PM",
    "User" : "rdmc",
    "Number_of_total_posts" : "2568"
  }, {
    "Post" : "Hello, Stephen and Margery.\nSounds, sadly, pretty par for the course to me. I've had MS since 1997.\nWhen diagnosed, I was told if you hadn't had any \"bad\" (motor not sensory) exacerbations after ten years, you probably had \"benign\" MS. (Add three years bonus for Beta.)\nI swear, a month after reaching the magic benign number, and thinking yay for me, it went pear-shaped.\nI was walking across the office and my left leg just locked up and my foot started dragging.\nLiterally instantly.\nSteroids really worked three times, then I wasn't allowed anymore. It's been slowly, very slowly downhill ever since.\nTrouble with MS - it's always benign until it isn't.\nThere are drugs that can help with the symptoms and the disease. You are not alone.\n💐 To you both.",
    "Titel" : "Is my wife Margery the only person in the world with this singular MS symptom?",
    "Date" : "05-01-2017, 04:23 AM",
    "User" : "Thinkimjob",
    "Number_of_total_posts" : "2851"
  }, {
    "Post" : "Originally posted by jreagan70 View Post\nHi Stephen:\nIf your wife has had little to no problems in 17 years, then I'm guessing that she hasn't had a lot of MRIs in that time. While it's possible that your wife has had only one lesion in her brain in all this time, it's also possible that there have been other lesions at other times, but that one has been the only one present at the time of her MRIs so is the only one that was ever captured in an image.\nIt's well known that lesions, particularly small ones, can come and go on their own over time. If a person doesn't have MRIs very often, it's possible that small lesions have come and gone over time and were just never present at the time an MRI was done. There's a great online article available that contains time-lapse videos showing how one man's brain lesions waxed and waned over MRIs taken a month apart over the course of a year. Any two of those images taken months apart could have looked essentially the same, leading to the false impression that nothing significant had happened in between them.\nI had one very large spinal cord lesion 15 years ago that has resolved to the point that it's not visible on my MRIs anymore, but the leg spasms -- particularly at night -- have remained. I take baclofen regularly every night to prevent the terrible, painful leg spasms that used to wake me up, sometimes several times a night.\nI have never heard anything like this before. I have had symptoms for years but MRIs didn’t show anyhting. I was always told that lesions would be present. Now, I’m questioning clear scans.\nHowever, I’ve read that having contrast often can actally cause MS. I’m wary of having chemicals injected often. When does a doctor\ndetermine that an MRI should be done? Is it based on severity of symptoms?",
    "Titel" : "Is my wife Margery the only person in the world with this singular MS symptom?",
    "Date" : "04-10-2018, 12:28 AM",
    "User" : "Bewildered1",
    "Number_of_total_posts" : "8"
  }, {
    "Post" : "Originally posted by Bewildered1 View Post\nI have had symptoms for years but MRIs didn’t show anyhting. I was always told that lesions would be present. Now, I’m questioning clear scans.\nHowever, I’ve read that having contrast often can actally cause MS. I’m wary of having chemicals injected often.\nContrast does not cause Multiple Sclerosis.\nIt is important to have blood work to check Kidney function before having contrast. Contrast is filtered out of the body through the Kidneys/urinary tract.\nWhen having a MRIs with contrast be sure to drink plenty of water before the MRIs, not too much for obvious reasons. After the MRIs are done drink more water as this will flush the contrast out after 1 or 2 times of urinating.\nMultiple Sclerosis literally means many scars. The lesions MS causes is scaring due to demyelination (stripping away Myelin which is the protective coating for our nerves). MRIs are ever changing in MS, there can be more or less lesions and some that are not detectable. If a person has MS there will always be lesions, it's not possible to never have MS type lesions and have this disease, it's just not.\nI was diagnosed a very long time ago. The MRI was fairly new and we had 2 MRI machines in the entire State. My MRIs were clear. My Neurological evaluation, positive Lumbar Puncture, and symptoms gave the clinical picture for MS and I received my diagnosis. I now have lesions and have for many years. Note: There was a different criteria for diagnosing MS at that time.",
    "Titel" : "Is my wife Margery the only person in the world with this singular MS symptom?",
    "Date" : "04-10-2018, 09:23 AM",
    "User" : "SNOOPY",
    "Number_of_total_posts" : "4237"
  }, {
    "Post" : "Hi\nI am looking to see what other med-combo's people are taking for spasticity?\nThe background to this I have successfully weaned off Klonopin because it was causing me serious memory problems. Klonopin really helped my spasticity into the next day and especially at night. I take Baclofen during the day. Without Klonopin anymore I have doubled my Baclofen but it is not really as effective as Klonopin + Baclofen in combination. The pain/stiffness in my upper ribs, spine and neck is really bothering me.\nI'm just wondering if I can take something else in combination with Baclofen that would improve how it's working for the musco-skeletal/spasticity issue? I also take Duloxetine in the morning for neurological pain, but it doesn't do anything for the other types of pain and stiffness.\nThanks",
    "Titel" : "What med combo keeps your spasticity under control?",
    "Date" : "01-24-2016, 03:52 PM",
    "User" : "Guzzy",
    "Number_of_total_posts" : "141"
  }, {
    "Post" : "My combination\nHello.\nI wouldn't say it controls my spasticity, but it helps manage it.\nI take 80 mg of Baclofen daily. We have discussed going up to 120 mg, but would rather add in new meds before topping off the Baclofen.\nI just started on Zanaflex which I take 12 mg daily.\nI take 10 mg of Valium at bedtime. I do still have a lot of lower limb spasticity issues that this does not manage, so it is a work in progress.\nBest of luck,\nSazed",
    "Titel" : "What med combo keeps your spasticity under control?",
    "Date" : "02-01-2016, 06:26 PM",
    "User" : "Sazed",
    "Number_of_total_posts" : "51"
  }, {
    "Post" : "my spasticity is controlled by baclofen via a baclofen pump. If you have any questions regarding a baclofen pump you can feel free to send me an email and I will be happy to answer any questions that I can.",
    "Titel" : "What med combo keeps your spasticity under control?",
    "Date" : "02-01-2016, 08:43 PM",
    "User" : "hunterd",
    "Number_of_total_posts" : "3099"
  }, {
    "Post" : "For me personally, my spasticity is kept to a level of being manageable by taking Zanaflex 2 or 4 mg at bedtime. I take it at bedtime, because my spasticity is worse at night.",
    "Titel" : "What med combo keeps your spasticity under control?",
    "Date" : "02-01-2016, 09:02 PM",
    "User" : "Mom To One",
    "Number_of_total_posts" : "2"
  }, {
    "Post" : "My solution is Dantrolene, 3X a day, and Botox injections in a couple of muscles every 3 months. I still have a bit of break-thru spasticity but it is usually manageable with stretching and massage.\nI hope you find the best solution for you.\nEcho",
    "Titel" : "What med combo keeps your spasticity under control?",
    "Date" : "02-05-2016, 08:47 PM",
    "User" : "Echo2099",
    "Number_of_total_posts" : "273"
  }, {
    "Post" : "Carolinemf\nHi, I'v given up on baclofen as it increased my fatigue. But i take diazepam and polaramine each night. The spasticity is worse at night and prevents me sleeping. This combo used with heat applied to the worst areas allows me a good nights sleep and has been beneficial to me for 4 years now. all the best.",
    "Titel" : "What med combo keeps your spasticity under control?",
    "Date" : "02-12-2016, 07:59 AM",
    "User" : "Carolinemf",
    "Number_of_total_posts" : "584"
  }, {
    "Post" : "Xanax and baclofen works for me.",
    "Titel" : "What med combo keeps your spasticity under control?",
    "Date" : "03-12-2016, 03:04 AM",
    "User" : "Susanaccorn",
    "Number_of_total_posts" : "1"
  }, {
    "Post" : "I take 60mg baclofen at bedtime.",
    "Titel" : "What med combo keeps your spasticity under control?",
    "Date" : "03-12-2016, 03:44 PM",
    "User" : "REG53",
    "Number_of_total_posts" : "1528"
  }, {
    "Post" : "medication for spasms\nI only get spasms I my right leg and usually get a warning that one is about to start. A get electrical impulses in my foot and lower leg as a first sign.\nWhen this starts I take Topamax 50 - 75 mg usually about eight oclock in the evening for about 10 days. This usually prevents the full spasm. I think this is an off label use of this drug.\nSpasms are annoying and painful. Hope this helps.",
    "Titel" : "What med combo keeps your spasticity under control?",
    "Date" : "03-16-2016, 01:40 PM",
    "User" : "Lyndagail",
    "Number_of_total_posts" : "19"
  }, {
    "Post" : "Hi All\nI have been using a Baclofen Pump to control my spasticity, since 1999. .. Not the same pump...lol\nI am on my 4th pump which has spanned 3 generations of the pump.\nTake Care, Bob",
    "Titel" : "What med combo keeps your spasticity under control?",
    "Date" : "03-17-2016, 09:01 PM",
    "User" : "BobOP",
    "Number_of_total_posts" : "146"
  }, {
    "Post" : "jimmy leg\nmy baclofen pump does a pretty good job at keeping jimmy leg at bay. but when any other triggers are present - if it gets hot or cold, if i stub my toe (?) or sit in one position for too long, etc., it comes back. it seems nothing is perfect.",
    "Titel" : "What med combo keeps your spasticity under control?",
    "Date" : "06-05-2016, 02:12 PM",
    "User" : "zenhead",
    "Number_of_total_posts" : "16"
  }, {
    "Post" : "MS &amp; Stroke Spasticity\nI Tried Baclofin & Zanaflex many times over the years. I hallucinate and go through Psychotic episodes. After two heart attacks my spasticity got unbearable. Then after having hip replacement needed due my Steroid treatments I found that Percocet eased my spasticity so I could sleep at night. A Paranoid Neurologist had me try Gabapentin. This helped but only partially worked. So I now after 15 years use a still low dose of OxyContin and 1800 mg of Gabapentin. Now what no one believes is that as per side effects of these two drugs it's the Gabapentin which gets me close to a Maryjane High. This sucks as being high all the time destroys any relief it might offer. The OxyContin only makes me dizzy and sleepy. With great difficulty I found a Neurologist who also is a Pain management Specialist. As my condition is long term Chronic and because of my low dose long term non-addictive use of OxyContin this Doctor and the DEA has no problem with my treatment. Of course I have to plan to pee in a cup after an hour drive by my wife. I'm sure many of you know how stressful this is. Oh this Pain management doctor is almost the only one Between NYC & Albany. I know no one will Admit such use due to fear of being cut off from effective treatments but I still try to find a discussion. jude",
    "Titel" : "What med combo keeps your spasticity under control?",
    "Date" : "08-31-2016, 10:48 AM",
    "User" : "wjaher",
    "Number_of_total_posts" : "2"
  }, {
    "Post" : "Standard combo\nGabapentin and Tizanadine 3x a day every 8 hours and Klonapin at night. Pain still occurs and spasms appear some days still, but I can’t function without.",
    "Titel" : "What med combo keeps your spasticity under control?",
    "Date" : "03-18-2018, 09:33 AM",
    "User" : "jnstaylor98",
    "Number_of_total_posts" : "12"
  }, {
    "Post" : "I have a baclofen pump.",
    "Titel" : "What med combo keeps your spasticity under control?",
    "Date" : "03-20-2018, 08:58 AM",
    "User" : "Marco",
    "Number_of_total_posts" : "1737"
  }, {
    "Post" : "I have a Baclofen pump that is filled with Prialt for pain and it has completely replaced the Baclofen for spasticity. It is a non-narcotic replacing Morphine.\nRich",
    "Titel" : "What med combo keeps your spasticity under control?",
    "Date" : "03-22-2018, 04:24 PM",
    "User" : "richjh101",
    "Number_of_total_posts" : "48"
  }, {
    "Post" : "HI\nI was baclofin besides for gabipentin and Zanaflex the baclofen really made me crazy so I stopped and changed to trileptal witch helped a lot. I found later that the zanaflex wasn't doing anything so I stopped that.\nalso I found that after I started with Trileptal my fatigue diminished a lot my Nero says he can't think of a reason why besides that pain takes a lot of energy so less pain = less fatigue",
    "Titel" : "What med combo keeps your spasticity under control?",
    "Date" : "03-26-2018, 11:26 AM",
    "User" : "msser",
    "Number_of_total_posts" : "4"
  }, {
    "Post" : "Anyone have side effects from Baclofen? What is your dose and did you start slowly? I just started this drug and it is difficult to get up and around. Any advice?",
    "Titel" : "Baclofen",
    "Date" : "03-17-2017, 06:56 AM",
    "User" : "suenan",
    "Number_of_total_posts" : "29"
  }, {
    "Post" : "I take baclofen. Yes it DID cause me to feel sleepy at first, but over time that side effect has gone away.\nWhen I started taking it I was rx'ed up to 40 mg / day with 20 mg pills which I split, so 10 mg 4x/day. Actually during a bad patch of spasticity I maxed out on 80 mg a day, but am currently taking between 30 - 50 mg a day.\nI believe that it only stays in your system for like 4 hours and so I take 10 mg throughout the day to attempt to keep the amount in my system 'steady'. BTW my neuro allows me to adjust the dosage as needed up to 80 mg/day, but since it works at a lower dosage that is where I try to keep it .\nGood luck during the 'getting adjusted to it' period. As I recall it didn't take very long but I understand that when every day is spent trying to stay awake it seems like forever.",
    "Titel" : "Baclofen",
    "Date" : "03-17-2017, 09:00 AM",
    "User" : "msgijo",
    "Number_of_total_posts" : "748"
  }, {
    "Post" : "I have been on it for so many years ?? I am rx'd 10 mg 6 times a day. This seems to work for me.\nGood Luck",
    "Titel" : "Baclofen",
    "Date" : "03-17-2017, 11:14 AM",
    "User" : "lindaincolorado",
    "Number_of_total_posts" : "899"
  }, {
    "Post" : "Hi suenan,\nBaclofen is one of the very few symptom management medications that was FDA approved for MS Spasticity. When taking Baclofen it is important to start out slowly, increase very slowly and if getting off of Baclofen decreasing very slowly.\nBaclofen can cause sleepiness but when your body gets used to the current dose that side effect will go away...usually. Each time an increase is made expect to feel more tired until your body once again adjusts.\nI have been on and off Baclofen several times through the years. Currently I take 10mg 4 times a day.",
    "Titel" : "Baclofen",
    "Date" : "03-17-2017, 01:09 PM",
    "User" : "SNOOPY",
    "Number_of_total_posts" : "4237"
  }, {
    "Post" : "Thanks everyone, this information is a big help. I have 10 mg tablets, but the script says to take two at a time. I think that's the problem.",
    "Titel" : "Baclofen",
    "Date" : "03-17-2017, 02:54 PM",
    "User" : "suenan",
    "Number_of_total_posts" : "29"
  }, {
    "Post" : "Hi. I was prescribed one 3mg tablet three times a day. The second day I fell asleep and missed three hours of work. I also got rubber legs , that with mobility issues we not a good combination. I told my neuro that he would have a hard time getting his work done too if he was taking them!!! So now I only take one regularly before bed and only take them during the day if I'm really stiff. Otherwise I would rather put up with the stiffness than the side effects of the Medicean. Just my expirences. Every body is different. Made me spacey as well.",
    "Titel" : "Baclofen",
    "Date" : "03-17-2017, 07:57 PM",
    "User" : "oceanpride",
    "Number_of_total_posts" : "261"
  }, {
    "Post" : "Hi,\nThe increased fatigue etc put me off Baclofen. Foggy enough too so found other ways to help with spasticity.\nAll the best.",
    "Titel" : "Baclofen",
    "Date" : "03-18-2017, 11:20 AM",
    "User" : "Carolinemf",
    "Number_of_total_posts" : "584"
  }, {
    "Post" : "I take 15 mg at 6:00 am, 10 at 10:30, 15 at 3 pm and 20mg at 8 pm. I do get breakthroughs spasms when I exercise.\nI started Marinol a few weeks ago, and that has improved my ability to recover fast from exertion, except today. Darn.",
    "Titel" : "Baclofen",
    "Date" : "03-19-2017, 01:59 PM",
    "User" : "Poolwatcher",
    "Number_of_total_posts" : "127"
  }, {
    "Post" : "About a year\nI've been taking Baclofen for about a year, after requesting it for spasticity in my legs. I started with 10mg every 8 hours as needed, but quickly found that it only lasts about 4 hours. I was advised to take 20mg every 8 hours, but feel very spacey when I take 20 mg. So now I take 10mg every 4 hours as needed.\nI've noticed that a lot of posts on this thread say they take it constantly every day. Is that something I should be doing? My neurologist never told me one way or another, but she also never offered me anything for relief until I asked specifically for Baclofen.",
    "Titel" : "Baclofen",
    "Date" : "12-29-2017, 07:28 AM",
    "User" : "kristinawilson4",
    "Number_of_total_posts" : "6"
  }, {
    "Post" : "I take 20mg 3 times per day. Just wanted to say, as Snoopy said to come off the medicine slowly, my neuro said when you just stop, it can cause seizures.\nJen",
    "Titel" : "Baclofen",
    "Date" : "12-29-2017, 03:20 PM",
    "User" : "Cat Mom",
    "Number_of_total_posts" : "1730"
  }, {
    "Post" : "Hi Suenan, I was on baclofen for a couple of months on a low dose but my head was constantly foggy, I couldn't concentrate couldn't focus I felt like I had been poisoned, it just wasn't for me, my neurologist wanted me on it so I persisted but couldn't handle the feeling, things weren't right in my head I have read good reports about the drug good luck Craig",
    "Titel" : "Baclofen",
    "Date" : "12-29-2017, 03:50 PM",
    "User" : "dastardly",
    "Number_of_total_posts" : "234"
  }, {
    "Post" : "This topic always gets me so upset because I've been battling chronic pain for over five years without any sustained relief. The new opioid medication regulations that began in October of this year are in my opinion, wrong-headed and counterproductive. They punish chronic pain sufferers like us, who have done nothing wrong, unless you're one of those people that think pain is a character-builder, or God's plan for you.\nMoreover, I predict that it will do little to reduce drug overdoses for people who abuse Rx drugs, and here's an example of why I saw that: my nephew, who has a long history of abusing drugs like OxyContin, overdosed on heroin this past Tuesday. Fortunately a first responder administered Narcan, which revived him and probably saved his life. For now.\nI think it's likely that he wouldn't have turned to heroin if controlled dose Rx drugs had been available to him. Here is an in-depth article that discusses this issue. (From the Atlantic under Features if my link doesn't make the cut): http://www.theatlantic.com/features/...idemic/382020/\nThe money quote:\nThe crackdown on doctors might have stanched the flow of prescription pills, but it did so with a deadly externality: West Virginians have turned to heroin—a cheaper and, frequently, more accessible high. Law enforcement officials here told me that heroin is now their “number-one problem.”\nMy nephew has been through numerous drug rehab programs over the years, and yet here we are again. There's really no reason to believe at this point that another stint of \"treatment\" with a devastating price tag is going to change his behavior. But in lieu of any other options, we will again cough up the $$$ to the \"recovery\" industry that has a failure rate so abysmal that if it were a new drug, would never even be considered for Phase I. But one thing that will be different for this round is that the next time he relapses, there's a really good chance that he will choose a street drug that will kill him.\nMeanwhile, those of us who suffer not just day by day, but hour by hour, will go untreated. I see no good news for anyone here.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "12-07-2014, 09:58 AM",
    "User" : "J-Bo",
    "Number_of_total_posts" : "422"
  }, {
    "Post" : "I stopped taking opioid pain meds about 2yrs ago when my hospital based medical plan instituted a new Pain Clinic model for administration of pain meds. My decision to stop opioids was the result of my first appointment with the Pain Specialist, but that experience is a bit OT to this thread.\nI've since then read several interesting articles regarding the new rx'ing rules implemented by DEA, the related cost and inconvenience to some of the most seriously ill patients.\nThe additional cost of monthly office visits for rx refills is a primary concern, plus the demands of another OV more frequent than my MS, MRIs, etc. Add to the increased cost is the fact that a pain 'specialist' charges more per office visit. Also the cost of monthly urine testing.\nConsider the impact to the DEA as legalization of MJ becomes more wide spread. I think the DEA's new business model is based on keeping themselves 'relevent', and to minimize the impact of job losses and budget cuts.\nThen there's the GP who wants to increase earnings by becoming certified in Pain Management, many who own their own labs for monthly urinalysis.\nThe new DEA regs are just so counterintuitive considering the burden on an already streatched health care delivery system and counter to reducing the cost on the 'system' and the cost burden on patients.\nThere must be a better solution to the Pain Med abuse problem, but I just don't think the new regs are the correct answer to this problem.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "12-08-2014, 02:21 PM",
    "User" : "MSW1963",
    "Number_of_total_posts" : "1680"
  }, {
    "Post" : "Regulators brought this upon themselves and us when they declared pain to be \"the fifth vital sign.\" That implied no one should have any pain ever, and if a patient does have pain, then medication should be prescribed to eliminate it.\nWell guess what? More pain med prescriptions were written, and drugs being what they are, more people used, then abused them. At least with prescription drugs, the FDA sees to it that you get exactly what it says on the label.\nNow, as the OP and Atlantic point out, new stiffer regulations (for monthly office visits and drug tests) are brought onboard to fix the problems created by the old regulations to \"fix\" pain, and they are causing people to go back to heroin off the street. Predictably this causes more illegal drug trafficking and drug overdose deaths.\nThose who pay the price are those who have a legitimate need for medication to treat their chronic pain. They are assumed to be criminals and drug abusers until \"proven\" otherwise - after jumping through all the hoops and expense of Pain Management Clinics, more visits and drug testing.\nI don't think pain is character-building, and I realize pain cannot be eliminated completely from the planet. But how about making it possible for patients with legitimate chronic pain to get enough relief to carry on with their minimal daily activities - caring for themselves, their homes, their families, maybe even holding a job.\nMS itself is bad enough, with no cure at present; at least let us get treatment for some of the symptoms.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "12-08-2014, 10:31 PM",
    "User" : "onlyairfare",
    "Number_of_total_posts" : "1123"
  }, {
    "Post" : "Thanks MSW and onlyairfare for your thoughtful responses. It helps to know I'm not the only one who feels frustrated about these wrong-headed policies. Sometimes I blame puritanical American thinking and other times I want to wring the necks of people who ruin it for us by using painkillers for recreation. But what really frosts me is the irony that the last thing I want to do is get high. I don't even like to drink because too often, MS makes me feel \"sloshy\" enough, and it's not fun. I'd be willing to wager that most MSers feel the same.\nAt the moment, I'm trying LDN as there are some claims that it can help with pain. I'm only about a week into it, and am just at a starting dose so it's too soon to tell. It would be so nice to never have to be treated like a criminal or a child ever again by these pain management people. Keeping my fingers crossed.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "12-14-2014, 01:03 PM",
    "User" : "J-Bo",
    "Number_of_total_posts" : "422"
  }, {
    "Post" : "I was recently at a conference where it was discussed that American's expectations are ZERO pain and I believe that is part of the problem. We have become a society where everything has to be perfect, everyone has the right to live as if they are an heiress, the fingerpainting your kid made in kindergarten is a masterpiece etc. I really hope our expectations become more realistic on so many levels.\nIt is very sad that many of the people with opiate dependence were actually prescribed these medications inappropriately to begin with and these likely well meaning providers created the addiction. That said however someone came about it the literature does NOT support that opiates are effective for long term pain control and they have been shown to be problematic in many other areas.\nI'm not a fan of withholding pain medication from patients in pain but also do not think obtunding our patients with opiates on a long term basis is the answer either.\nI hope benzodiazepines are next on the list and overall believe it is time to start investigating other methods of pain control.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "12-14-2014, 06:03 PM",
    "User" : "Jules A",
    "Number_of_total_posts" : "3582"
  }, {
    "Post" : "Frankly, people are going to get addicted to whatever they want to. Be it food, drugs, passions/hobbies, gambling, Alcohol..etc.\nThursday, I had to give my Soc. Sec. # for the Vet to dispense pain meds for my little 9 pound dog! Guess I should be feeling great, they didn't request a pee test.\nSomething is more than just wrong for making the legitimate patients suffer more expense and for me personally, just getting in to the doc when I need to has been a major effort..trying to feel well enough on the day of the appointment, to go in.\nI live 2 doors down and across the street from a dope dealer. The police could care less, I've called in so many buys they referred me to the Drug Task Phone # and no one calls back. The real problem is: 'THE POLICE DON'T WANT TO DO THEIR JOBS.' Or, they'd stop the damn traffic'ing and Leave REAL patients alone.\nSomething is very wrong, if the Gov't wants pee tests, it needs to pay for them. Its' $40. per test for me. Sadly, I dropped out of pain clinic and was immune to the pee tests, at one point, not sure now.\nWhen I took it upon myself to get off all those opiates, I tossed them in a jar. That has made me a 'target' for family members stealing and selling drugs. Even with that information, not one arrest! I've spent $10's of thousands of dollars for security, etc. They just over-ride electronics...\nwhy make a police officer do his job? Really, there is no public over site of their behavior, at all. Doesn't matter who you are, when the theft is regular and frequent..they try to make the patients lunatics and take them in. Fortunately I have a psych eval, but, it is a real pain.\nHaving the largest insurance carrier of America (The Gov't) regulate healthcare, something is wrong, very wrong. fed",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "12-15-2014, 01:57 AM",
    "User" : "Fed Up",
    "Number_of_total_posts" : "873"
  }, {
    "Post" : "Yes, Jules A said it well:\nFrankly, people are going to get addicted to whatever they want to. Be it food, drugs, passions/hobbies, gambling, Alcohol..etc.\nAnd moreover, I really wish people would learn the difference between addiction and dependence. The first means that you will use just about anything because you crave the high or the feeling that the substance or behavior gives you. Dependence is needing to maintain a certain level to avoid withdrawal. It is accurate to say that Gabapentin, Lyrica, Cymbalta, and the whole host of other antidepressants and anti-seizures also cause dependence because you cannot stop taking them suddenly without adverse effects. Yet they hand those out like candy.\nAnd if we want to talk about overdoses, let's start talking about Tylenol, shall we?\nAs for expecting all the pain to be gone, I don't even know where to start. I would pay serious money to just have a level six day every now and then. Most people I know would have thrown in the towel ages ago if they had to cope with the kind of pain I do every day. And if some people expect perfection, that is not my fault. I just want to have hope that I'm not going to spend the rest of my life rocking and crying. Sorry if that expectation is too high.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "12-15-2014, 02:45 PM",
    "User" : "J-Bo",
    "Number_of_total_posts" : "422"
  }, {
    "Post" : "Fed Up, I had a client I consulted with on a regular basis for years, located on the outer edges of the Central Business District.\nParking was always a problem in that area, I'd find myself parking a couple of blocks away, walking in front of a Pill Mill Clinic, with patients openly selling their scrips and blocking my access to the side walk as they conducted their drug transactions.\nThe worst part is that Police Headquarters, an historic building in this large city, was one block away from the Pill Mill.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "12-15-2014, 05:02 PM",
    "User" : "MSW1963",
    "Number_of_total_posts" : "1680"
  }, {
    "Post" : "This is the new prohibition. I never took drugs before my diagnosis. First, I got ON so I had a high dose of dilaudid ordered for me in the hospital. Then, my PCP was prescribing 10mg of Percocet per month +1 1/2mg of Xanax.\nI asked my doctor if she was worried about addiction. She kept assuring me that it was ok. Then I got a jaw infection that required two months of IV antibiotics in the hospital. I was prescribed 2mg of dilaudid every 3 hours. As the jaw healed, I was still asking for dilaudid. They asked me what hurt. I said my eye., maybe at that point I was experiencing rebound pain I still don't know.\nAfter I got out of the hospital, I was still taking the 10mg Percocet. First, once a day, then 2 times, then, every eight hours. I was dependent and I knew a tolerance was building but the terrible achy feeling of MS was something I just didn't want to feel.\nMy PCP didn't want to keep prescribing to me so she sent me to a pain management doctor.\nHis office was wonderful. It was in the a Cancer Center which was a beautiful building. I had a great experience with him and over the four years we seemed to building a good relationship based on trust.\nThen, I went to my October appointment at the Cancer Center and his office was GONE. They gave me his new address so,I hobbled over there in the heat. Finally made it there and they rushed me into a tiny office with a man sitting at the desk. My beloved pain doctor was angry and said, \"YOU ARE LATE!\" I had just lost 15 minutes going to the wrong office. He was talking really fast about now they had a new system. I would have to come every month and all prescriptions would be sent electronically.\nSo I went to my November appointment on time, hoping he would be in a better mood. He said, well I'm going to have to test you now. That was the first time he had ever tested me without a month's advance notice. I wasn't worried because I take my medication the way I am supposed to.\nWell, in December I go in for my appointment. I came a half hour early so I wouldn't be late and he kept me waiting an hour after the appointment time. He walks in with his laptop, doesn't say hello, looks at the results of my test and says, are you taking any barbiturates? I said, \" I was taking Donatol but they don't make it anymore.\" He said, \"well your barbiturate level,was 5000. The maximum it should be is 50. Would you like to take the test again to see if it's,out of your system? I said, no thank you.\nWhen I left the office I was scared. I know for sure I did not have barbiturates in my system that day. What if he tests me again and it shows up something illegal and I get arrested? He obviously has a bogus lab. Anything could happen. I talked to the office manager who has been very approachable lately. She told me others patients have come to her upset about the lab results. She says she wants to change labs. But for. me the doctor patient relationship has been severely damaged.\nI don't know what to do. If I go off the pain meds, I will have long term withdrawal effects and be in pain.\nI get so annoyed when they say, \" the new war on drugs ins being waged in the doctors office.\" They should let doctors practice medicine.\nDoes anyone have any suggestion on how to handle this? If I stomp out saying I'm getting a new pain doctor, that would be drug addict behavior. If I stay I could be getting into who,knows what. My pain doctor is a very good person. He wants to help people and, at the same time, he is not a pill mill. Why does the DEA make such a mess? I think they are destroying more lives than they are saving.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "12-15-2014, 10:09 PM",
    "User" : "palmtree",
    "Number_of_total_posts" : "1320"
  }, {
    "Post" : "Wow, this is the dilemma that I am up against now. I've been using Norco for pain in my arm, at night, for the last 3-4 years. I always make the medication last longer than the Rx allows so they know I am not taking too many or selling them or ?\nSo now I have to see my GP, who as my lead Doc manages the pain meds, which I never understood as they tested everything and concluded I was having pain as a result of MS. He already sent an email saying I needed to be seen at least twice per year and take urine tests. He didn't say what all they are testing for but I assume most everything?\nI really don't want to subject myself to regular trips to the hospital as I am trying to work a few more years while I'm still able. I guess I'll be trying to get by with just the mega-gabapentin routine and see if that helps?\nGrrrrrrr.............Frustrating..........",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "12-16-2014, 11:13 PM",
    "User" : "MS TOO",
    "Number_of_total_posts" : "216"
  }, {
    "Post" : "Palmtree, I was trying to avoid getting into my personal experience with my pain med docs, but after reading a couple of things in your post that sound erriely similar to my own experiences, here goes.\nI was on Vicodine for 10yrs, rx by my MS doc for the first 5yrs, then a PM doc when I relocated to the P.N.West. The PM doc and I had a cordial doc/patient relationship. His knowledge of MS pretty limited, but he always wrote my refills 3 refills, one rx on three seperate scrips to accomodate my MS.\nThe nursing staff on the other hand play the 'bad cop' while the PM doc played the role of 'good cop'. I found the good cop/bad cop totally alien to anything I'd ever experienced, it totally bewildered me. But, I'd never had a urinalysis during my 4yrs as a patient there, because I complied with the terms of the PM treatment contract.\nMy PM doc also moved to a new location. I have visual spatial deficites, I get lost easy even in familiar places, stores, etc. The first couple of appointments after the docs moved, I would get horribly lost, paniced, but I was determined to at least show up for my appointment even if only out of courtesy.\nI explained to the receptionist that I realized I was late, was extremely sorry, and understood if they had to reschedule my appointment. Explained that the relocation combined with the spatial skills problems, were cognitively incompatiable for me. (To say the nursing staff must have received their training in the state prison is putting it mildly.)\nEventually there was a mix up in the number of refills, and I left the office with 2 refills versus the usual 3 refills. When I called the office to request the 3rd refill, explaining the error made on the earlier rx, the refil was refused. I was given an appointment for later in the week.\nMy decades of insomnia was now complicated by the increased pain over the next few days. I always seemed to wait until early AM to take sleep meds, which naturally only make me hung over and sleep deprived the following day for my appointment.\nI was sleep deprived and hung over, just a mess when I showed up for the appointment to clear up the error made on my previous rx, 2 refills versus the usual 3 refills. I brought a copy of the original rx I request from the pharmacy to document the error.\nWhen I showed up for the appointment, there was a derigatory comment about my balance problems, lack of focus/blood shot eyes, and despite being properly dressed and groomed, I was obviously distressed from the sleep med hang over combined with being sleep deprived and the stress I anticipated during this office visit that was clearly developing into a showdown with a doc I previously had a very good relationship with.\nI was immediately escorted to the office building bathroom by a nurse, standing guard out side of the bathroom stall, for a urnine test. I wasn't allowed to have my purse with me!It was a humilating experience.\nI knew I wouldn't be returning to this doc, but I agreed to the urine test because I waned documentation in my file that my urine was clean per the terms of PM treatment contract.\nI went for my next neuro appointment about 2 months later, explained the 2 versus 3 refills misunderstanding at the PM clinic, and my neuro refilled the pain med rx.\nIt didn't take very long for my neuro's hospital plan to establish a PM clinic, which I was referred to. As usual, I was sleep deprived and experiencing mild balance problems.\nThe receptionist commented about my obvious state of poor balance, bloodshot eyes and impaired coordination. Explaining that I have MS with chronic insomnia, ineffective sleep med complications and balance problems made no impression what so ever. I was a marked woman already.\nThings deterioted quickly once I saw the PM doc during the initial visit. There were obvious cultural and english second language differences that contributed to a very awakard first and last appointment with the PM doc.\nThere was some PM doc grunting sounds, deep disapproving breaths and other non verbal negative judgments when she looked at my bottle of pain meds.\nAgain I agreed to the urine test in order for my records to reflect that I had nothing in my system other than 2 non narcotic meds rx'ed by my MS doc, knowing I wouldn't be returning to the PM clinic.\nI was not only offended by the PM Contract as 'medical care', I couldn't afford additional cost of monthly visits for another specialist and the cost of monthly labs.\nI couldn't rely on being able to comply with the terms of the PM Contract demands for monthly OVs. It's necessary for me to break up grooming and personal hygine preperations for my Neuro visists over 2 days because of fatigue, insomnia, etc., and I only see my neuro every 3 months, MRIs 3x a year.\nThe constant pain is very difficult to contend with day to day, in addition to the negative consequences on my physical and mental well being. I'm near the threshold for tolerating it much longer.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "12-17-2014, 01:02 PM",
    "User" : "MSW1963",
    "Number_of_total_posts" : "1680"
  }, {
    "Post" : "I forgot to mention that doc offices make their share of mistakes, errors, etc. I've experienced 2 very serious oversights by my MS doc's office.\nOne involved postponing my monthly TY infusion while I was evaluated for PML based on a new, serious mobility issue. I got a call from my Neuro that I had changes on MRIs, first in 8-10yrs, but no PML. No discussion about when I would resume infusions. I assumed it would be handled by the MS doc staff. After all I can't call the infusion center asking where's my TY when infusions were suspended by my doc.\nThat call never came, so I called my neuro's office, left a voice message about resuming my Ty infusion. I got a voice mail from a nurse asking what rx refill did I need.\nA few more days of voice mail/phone tag, and almost 60 days since my last Ty infusion with the danger of a Rebound exacerbation looming. I finally got the Ty appointment. That was not the only potentially huge 'office admin' problem I experienced over the years. But I'm not nit-picky, I realize office staff changes, short staffed due to illness, things happen even in my usually very well run MS docs office.\nAll that to say that doc offices make errors all the time, including MS docs and PM docs.\nSo when I look at the PM Clinic Patient Compliance Contract necessary to continued pain treatment, it's strikes me as more than a bit ironic. Even hipacratic/sp?, to put the patient to such high compliance standards, with the patient always under threat, even when an office error is responsible, or the standards in the contract are inconpitable, unrealistic for some patients.\nThe patient is the offender under suspition, regardless of the circumstances. That relization led me to the decision that despite daily pain, deteriotating physical and mental health as a result, it was not in my best interest to continue treatment at this time.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "12-17-2014, 02:26 PM",
    "User" : "MSW1963",
    "Number_of_total_posts" : "1680"
  }, {
    "Post" : "My GP has always been the one who prescribed my pain med. I don't take much and it doesn't eliminate pain, but it does make it tolerable. My pain is due to facial and tongue spasm.\nWell I've complied with the once a month appt. and found the appts. okay because I then use it to \"catch up\" with other issues I need to discuss with him (since it's my GP it really has come in quite handy.)\nFor instance, I had pneumonia and after I finished my antibiotics (I was diagnosed at the ER) I was supposed to have an appt with the GP. Of course he didn't have any appts for weeks, but I had my \"standing\" drug Rx appt. so I was in good shape because that also became my pneumonia follow up appt.\nHowever, I was struck with the ridiculousness (is that a word?) last appt at GP. It was late on a Friday, and for some reason he wasn't there so I saw the NP. Of course the NP couldn't give me the RX for the pain med, it had to be signed by the GP...so I had to go back the next week to pick up the RX. Fortunately, I wasn't completely out of the med, but if I had been, I would have had to go three days without it (I was there on a Friday afternoon and the office doesn't open till 9 on Monday...so that would have been a painful weekend.\nAnother new thing...when my husband drops my RX off at the pharmacy, he has to have my ID...just to drop it off. I can understand them requiring my driver's license when he picks it up for me, but to need an ID just to drop off a RX is a little over the top in my book.\nI've never been asked to do a urine test though...I find that hard to believe that a person with a chronic illness gets treated like a drug abuser...it's not bad enough we have pain, we have to jump through hoops to get a Rx.\nOf course I should have seen this coming...when it became harder to get a $5 box of Sudafed than it was to pick up my $3000 box of Betaseron, I should have surmised things were going downhill",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "12-20-2014, 03:53 PM",
    "User" : "rdmc",
    "Number_of_total_posts" : "2568"
  }, {
    "Post" : "Wow, looks like a lot of us have common experiences with pain management! It kind of makes you wonder why these doctors would even want to go into this specialty when they seem to have so much contempt for their patients. I know that sounds harsh, but really, these stories are chilling. I have some of my own, and not dissimilar to many of yours.\nThere’s just so much to comment upon and respond to here, and I really appreciate everyone’s sharing on this topic.\nHere’s something palmtree said that struck a nerve with me:\nIf I stomp out saying I'm getting a new pain doctor, that would be drug addict behavior.\nYes, we put so much effort into avoiding the “drug-seeking” label. Sadly, we can maintain an irreproachable record for years, and then have one little, innocent slipup (I had one of these recently), and you are literally in a world of hurt. The rules are arbitrary and contradictory:\nExhaust your supply, and you’re depending on them too much. Don’t take them all, and you’re hoarding so you can take more all at once to get high.\nTell them your pain is an 8, and you’re not hurting enough to need meds. Tell them it’s a 10, and you’re exaggerating.\nComport yourself in a normal, rational manner, and you must not be in that much pain. Come off as agitated or depressed, and you need group therapy—no pain meds for you.\nAnd as someone up-thread said, things can be written into your record easily and without your knowledge. All it takes is one self-righteous, vindictive, or sadistic doctor, nurse, or PA who is having a bad day and you’re done. No chance for appeal or redemption. God help you if they cut you off when you’ve built up a dependency—it’s off to a detox unit with you.\nI don’t know about you, but I am so sick of living under this medical terrorism. I am so tired of being under constant suspicion and assumed to be incapable of making my own decisions. I have had it with being treated like I’m weak and self-indulgent because I just want the Pain. To. Stop.\nI am so very sorry for all of us, and am out of ideas and out of hope.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "12-22-2014, 03:49 PM",
    "User" : "J-Bo",
    "Number_of_total_posts" : "422"
  }, {
    "Post" : "I asked my general doctor about this and he told me that at one point doctors were encouraged to treat pain agressively - hence the pain scale etc. It went pretty overboard and now they are stepping back from that mentality. I agree that it does punish people like us, but I do think that there was abuse in the areas they are looking at (how much particular doctors prescribe narcotics). It sucks, but it is what it is.\nMy neuro group only allows one doctor in the practice to prescribe narcotics. My neuro says it makes it easier for them to deal with the newest regulations.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "01-05-2015, 04:19 PM",
    "User" : "salamandertom",
    "Number_of_total_posts" : "757"
  }, {
    "Post" : "Such a pain, excuse the pun, we have to out up with to help us with the pain we live with. My PCP Neuro have a relationship where my PCP writes all my scripts or refills. Therefor one doctor is in control. I remember the day I went for a refill of my opioid painkiller and the nurse said she needed a urine sample. I was more than a bit shocked.\nWell as luck would have I could not provide the sample. When my PCP saw it was me waiting he told the nurse I was the last person she needed to worry about. My PCP and I have a very good relationship. But every month I go expecting to give that urine sample.\nYes it is an inconvenience, yes it does get costly but it's the price we pay for relief. I have climbed the mountain to morphine and there are days that it barely takes the edge off the pain yet I still take them as prescribed. But if there is a day when I have to take an extra pill it is allowed. My doctor knows I am not abusing nor misusing nor will I ever.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "01-05-2015, 06:47 PM",
    "User" : "Waydwnsouth1",
    "Number_of_total_posts" : "998"
  }, {
    "Post" : "I read an article on MSN about VA hospital patients being hit with new Opioid Rx regs. Even the medical providers agree the new regulations pose significant burden on patients, and agree the new DEA regs were not well thought out.\nVA was already dealing with covering up long appointment delays, monthly appointments for pain med refills is sure to improve that problem. <not>",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "02-19-2015, 11:38 AM",
    "User" : "MSW1963",
    "Number_of_total_posts" : "1680"
  }, {
    "Post" : "Originally posted by MSW1963 View Post\nVA was already dealing with covering up long appointment delays, monthly appointments for pain med refills is sure to improve that problem. <not>\nThat truly is a shame that our veterans have to deal with this too, MSM.\nI have a new thought related to pain medication that's making me want to scream \"Why hasn't somebody put this together and gotten the ball rolling?!?!\" I've applied to participate in the Ibudilast/MN-166 trial for progressive forms of MS. (thread here: http://www.msworld.org/forum/showthr...rogressive-MS)\nSo of course I've been reading whatever I can find about it, and look at this:\n\"Ibudilast crosses the blood–brain barrier and suppresses glial cell activation. This activity has been shown to make ibudilast useful in the treatment of neuropathic pain and it not only enhances analgesia produced by opioid drugs, but also reduces the development of tolerance.\"\nNot only that, but another trial of Ibudilast is seeking to address opioid abuse, and says this:\n\"</not>Recent preclinical studies demonstrate that while ibudilast increases the analgesic effects of opioids, it decreases the rewarding effects of such drugs. It has also been shown that ibudilast suppresses morphine-induced release of dopamine, a primary neurotransmitter involved in the rewarding and reinforcing effects of abused drugs.\"\nIn other words, maybe we could have a pain med that in itself, relieves pain, and also helps opioids relieve pain better with a lower dose, while at the same time reduces the desire to abuse them. Doesn't this sound like a huge game-changer in pain management to you?\nSo where are all these ultra-concerned people who are so worried about pain medication abuse? Why aren't they jumping up and down, hollering about how we should research combining Ibudilast with opioids to see if we can't come up with an effective pain reliever that reduces drug abuse risk? Aren't they clamping down pain meds only because they really care about our well-being? Yeah, I never bought that, either.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "03-07-2015, 02:35 PM",
    "User" : "J-Bo",
    "Number_of_total_posts" : "422"
  }, {
    "Post" : "All the horror stories make me feel very blessed.\nSince the regulations came into effect the only change for me is I have to go to the office to pick up a paper script once a month instead of them giving me 1 + 5 refills. With difficulties getting around that is annoying but nothing like what you folks are running into.\nI am sure it helps that I have been seeing the same PCP for 7 years and using the same pharmacist for even longer. I started out at 2 5mg vicodin a day and now after 7 years I am up to 4 5mg a day. Every time I needed to bump up the script I just told my doctor and he did it. I am not sure how that will go if I need another increase with the new regulations on the books. I have actually been weaning down to most days only 3 a day so I hope to never have to cross that bridge.\nAs far as the new regulations go there is NO mandatory drug test involved. The only effective change is that doctors can not write refills, and all scripts must be written out no phoning them in any longer. IF your doctor is requiring a drug test or any other hoops that is them not the DEA. Unfortunately for those who's doctors are requiring such things it will be very difficult to change doctors at this point as it would instantly make you appear to be a drug seeker. It is important to know your rights though just to give you confidence when dealing with your doctor. I know it is hard to stand up to a doctor and could ruin the relationship but honestly if your doctor is acting like that the relationship is already ruined.\nOne other thing I will add. I smoke pot both to help me sleep at night, to reduce muscle spasms and for the neuroprotective properties. I am not in a medical marijuana state but both my PCP and my Neurologist know that I smoke. That being the case a drug test would screw me royally so I am very cautions about what I agree to at the doctors office. Perhaps my legal gray area makes me more aware of the laws and my rights.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "03-07-2015, 09:31 PM",
    "User" : "TaoWarrior",
    "Number_of_total_posts" : "171"
  }, {
    "Post" : "Originally posted by Jules A View Post\nI hope benzodiazepines are next on the list and overall believe it is time to start investigating other methods of pain control.\nAt thsi time there is an initiative to legalize medical marijuna in my state. I never used drugs, never advocated for their use recreationally or otherwise, so for me this a departure from my usual mo. Today I wrote a letter to a state House of Representative legislator (not mine) based on a quote from him in my newspaper. The following is the text from my letter:\nDear Representative Curtin:\nFirst, thank you for going into public service. I am sure your intentions to serve were not to become wealthy. Second, you are not my representative, and so probably feel no obligation to respond to this letter. Nevertheless, I would be thrilled to have a dialogue with you about your views with regard to legalization of marijuana.\nToday's Columbus Dispatch quoted you as saying, \"This issue is about trying to create a $1 billion industry for ten individuals and their friends.\" While I am not personally affiliated with anyone spearheading the proposed legislation, nor am I a member of NORML (I tend to laugh at people invested in trying to make it easier to use marijuana under the guise of compassion for people with medical issues), I am in favor of the legalization of medical marijuana. On that note, taken as said, your quote is incorrect.\nMarijuana needs to be studied to allow scientist and growers to produce standards for dosage the same as opiods or other synthetics in use currently. I am a patient with multiple sclerosis. Obviously I don't welcome my symptoms or the prospect of disease progression, but since there is no cure for my condition, and the pain management alternatives are known to be addictive and have a plethora of undesirable side effects, it only seems prudent to explore other avenues. That said, medical researchers know that to study one issue typically leads to the development of many offshoots. For example, I benefited from Tysabri, a medication that was developed to treat Crohn's disease.\nPlease don't shut this proposal down out of hand. Please consider diverting funds gained from its passage toward research to develop better medicines.\nRespectfully,\nBadAttitude",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "08-13-2015, 12:15 PM",
    "User" : "BadAttitude",
    "Number_of_total_posts" : "107"
  }, {
    "Post" : "Attacks on pain sufferers\nPeople who are in pain have been a convenient target for Law and Order weirdos and DEA groupies for years. I was DX'd with MS in '99, and was able to fight my way through a labyrinth of obstacles to get access to good pain meds.\nI finally was prescribed methadone, and it worked well, still does 15 years later. My days would end at 10 AM if I were lucky, on bad days I just wouldn't get up at all.\nOnce my pain was treated, I felt like I had shed 100 lbs of misery...\nA couple of years later, I returned to work.\nIf for some reason my treatment was stopped, I would have stopped, too. No more job, no more paying taxes, and complaining like everyone else about long work days, low pay and traffic jams on my commute.\nI commuted every day on my BMW motorcycle, rain or shine to a job I loved. And when I was ready to retire, I did, on my terms/\nWhen I hear about about various politicians or medical \"experts\" going about how HORRIBLE pain meds are and how the doctors that prescribe them are Evil Doers or Drug Dealers....\nIt makes me so angry that I wish I could just kick them in their shins and ask \"This is how my whole body feels every darn day, without proper treatment, butt out of something you don't understand!\"",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "11-06-2015, 09:18 PM",
    "User" : "jstinnett",
    "Number_of_total_posts" : "74"
  }, {
    "Post" : "Originally posted by onlyairfare View Post\n........how about making it possible for patients with legitimate chronic pain to get enough relief to carry on with their minimal daily activities - caring for themselves, their homes, their families, maybe even holding a job.\nMS itself is bad enough, with no cure at present; at least let us get treatment for some of the symptoms.\nExactly! Addicts are going to do what addicts do, whether pain sufferers are treated or not.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "11-06-2015, 09:21 PM",
    "User" : "jstinnett",
    "Number_of_total_posts" : "74"
  }, {
    "Post" : "Originally posted by jstinnett View Post\nWhen I hear about about various politicians or medical \"experts\" going about how HORRIBLE pain meds are and how the doctors that prescribe them are Evil Doers or Drug Dealers...\nThose politicians and medical experts are referring to doctors like Lisa Tseng who was just convicted of three counts of second-degree murder for wantonly prescribing opioids to people she knew were addicts and people she never even examined and who had no medical need for the drugs, especially not in the shocking amounts she was prescribing them. Six or seven of her other patients also died from overdoses, but she wasn't charged in their deaths.\nIf you want to blame someone for a situation you don't like, stop blaming the messengers and start blaming the ones who are REALLY responsible for why people who legitimately need opioid painkillers can't get them: the prescribers who are enabling deaths and the criminals and addicts they cater to.\nIt's appalling to me that so many MSers condemn pharmaceutical companies that spend billions of dollars to develop legitimate MS treatment medications and charge for them accordingly, but then give a free pass to doctors, addicts and drug traffickers who are directly responsible for them not being able to get the pain-relieving medications they need, choosing to instead condemn the messengers and those who are trying to prevent a pandemic of needless deaths.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "11-07-2015, 12:58 AM",
    "User" : "jreagan70",
    "Number_of_total_posts" : "897"
  }, {
    "Post" : "Methadone\nHey jstinnett, glad to hear that you've gotten so much pain relief and improvement in your life! I just recently started methadone a few weeks ago at a very low dose, and think it might be helping a little. For the first time in about 8 years, I'm starting to feel like there might be some hope instead of dreading the possibility that I might have to life through 20 more years of this hell. There might even be a chance that this could save my life.\nI have a lot of questions, and I'd be really interested in learning more from your experience. Would you be willing to share your knowledge? If so, I'd like to start a thread just for this in the Medications area of this forum.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "11-08-2015, 11:47 AM",
    "User" : "J-Bo",
    "Number_of_total_posts" : "422"
  }, {
    "Post" : "Such a \"sore\" subject. I went to a pain clinic in another state in which my ex stole my pain medication I hid, locked up, etc. and he found every spot. I was stuck...if I reported him, I'd get kicked out of the pain clinic.\nMy father was a prescription med addict, so I am well versed.\nThe new regulations are hideous for those of use looking for some relief. It doesn't give me relief so much as some relaxation ability to deal with the spasms. Now on top of the monthly required written prescription, the mayor of our wonderous state is now looking to limit the # of you may receive every month!!\nI am also enraged having dealt with a family member who was an addict and an ex who was an addict. That people are calling it a disease. That people should be forgiven. That they are not; responsible for their actions. I do believe that addicts should be forgiven, if they go through rehab and remain clean. BUT, and I am sorry if I do offend anyone, I do believe that addicts are responsible for their actions and that they are responsible for the state they find themselves in. They were the one who took their first hit and the second and the third, etc. No one forced the drugs on them. They had the decision to walk away at any time.\nI know this. I did.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "11-09-2015, 12:28 PM",
    "User" : "gwynnf",
    "Number_of_total_posts" : "84"
  }, {
    "Post" : "Originally posted by Waydwnsouth1 View Post\nSuch a pain, excuse the pun, we have to out up with to help us with the pain we live with. My PCP Neuro have a relationship where my PCP writes all my scripts or refills. Therefor one doctor is in control. I remember the day I went for a refill of my opioid painkiller and the nurse said she needed a urine sample. I was more than a bit shocked.\nWell as luck would have I could not provide the sample. When my PCP saw it was me waiting he told the nurse I was the last person she needed to worry about. My PCP and I have a very good relationship. But every month I go expecting to give that urine sample.\nYes it is an inconvenience, yes it does get costly but it's the price we pay for relief. I have climbed the mountain to morphine and there are days that it barely takes the edge off the pain yet I still take them as prescribed. But if there is a day when I have to take an extra pill it is allowed. My doctor knows I am not abusing nor misusing nor will I ever.\nSHAME on that doctor for making the nurse out to be the enemy. That nurse/medical tech was ONLY doing what that office requires from EVERYONE, and the DOCTOR knows that.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "02-20-2016, 08:03 PM",
    "User" : "Fishytrout",
    "Number_of_total_posts" : "151"
  }, {
    "Post" : "I don't know how I found this thread; searched for eye pain and Gilenya, but it's truly awesome. All these people!\nAustralia follows America, so we're cracking down on opiates.\nAddicts are shifting to OxyContin and of course, heroin because police are now testing drivers for drugs, as well as alcohol.\nMore \"drug drivers\" are caught in our little town than drink-drivers.\nBut the catch is the drug test is a saliva sample. Take meth or marijuana and you'll eventually get caught.\nSo those who choose to abuse drugs have gone back to heroin and all the other opiates. And the overdoses are back on the rise.\nNext year, we'll need a script for what are currently over-the-counter painkillers containing codeine.\n(It's the paracetamol that's the real disaster in an overdose of these drugs anyway.\nPresumably, pain management clinics and urine tests are on the way.\nWhat I find bizarre is that if you have chronic pain and a chronic disease, it's not like you're taking these drugs for fun.\nWe're about to be allowed \"medical marijuana\". We're assured no-one will get any enjoyment out of it.\nProhibition just doesn't work, but we keep on keeping on.\nStupidest thing of all - if there is something I might enjoy - like real marijuana - why can't I have it?\nI'm not getting much fun out of anything else - pain, insomnia, exhaustion, MS drug side effects etc.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "04-12-2017, 02:53 AM",
    "User" : "Thinkimjob",
    "Number_of_total_posts" : "2851"
  }, {
    "Post" : "Originally posted by Thinkimjob View Post\nI don't know how I found this thread; searched for eye pain and Gilenya, but it's truly awesome. All these people!\nThinkimjob - look under \"Vision Problems\" - 'Eye, pain headache light sensitivity' . Yeah I had it - it was one of the reasons I gave up on Gilenya.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "04-12-2017, 08:09 AM",
    "User" : "msgijo",
    "Number_of_total_posts" : "748"
  }, {
    "Post" : "Hi Thinkimjob,\nI believe its also to make drugs less available to those who use common cold remedies etc for making meth.\nIt will be a bit of a pain in the butt having to get more scripts though.\nHopefully the powers that be will allow for that with people like us by allowing us to get a script with more than 1 months supply on it.\nI take 3 drugs at present that require me to either see the doc each month or to pay an extra $20 for the service of getting the script written up for me to pick up.\nThis is extra cost and effort I could do without.\nOn another subject- where did you hear about the medical MJ?\nI am interested in trying this . Could prob source the other stuff but have no interest in the euphoria.\nCaroline",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "04-15-2017, 07:10 PM",
    "User" : "Carolinemf",
    "Number_of_total_posts" : "584"
  }, {
    "Post" : "Originally posted by Carolinemf View Post\nHi Thinkimjob,\nI believe its also to make drugs less available to those who use common cold remedies etc for making meth.\nIt will be a bit of a pain in the butt having to get more scripts though.\nHopefully the powers that be will allow for that with people like us by allowing us to get a script with more than 1 months supply on it.\nI take 3 drugs at present that require me to either see the doc each month or to pay an extra $20 for the service of getting the script written up for me to pick up.\nThis is extra cost and effort I could do without.\nOn another subject- where did you hear about the medical MJ?\nI am interested in trying this . Could prob source the other stuff but have no interest in the euphoria.\nCaroline\nIt should be coming soon to Queensland.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "04-19-2017, 05:56 AM",
    "User" : "Thinkimjob",
    "Number_of_total_posts" : "2851"
  }, {
    "Post" : "Thanks Thinkimjob.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "04-23-2017, 05:19 PM",
    "User" : "Carolinemf",
    "Number_of_total_posts" : "584"
  }, {
    "Post" : "So this so called Opiod Epidemic is actually a heroin epidemic. The relationship(s) to prescription pain medication is that 1.) synthetic fentanyl is being used as an extra addicting agent in heroin. As fentanyl is a prescribed medication all pain medications suffer\nhttps://www.nbcnews.com/storyline/am...idemic-n814956\nIf you read the story you will actually see where the CDC has done a 3 State study and found that over half of these deaths have synthetic heroin in them and more than that have elicit drugs. So this means that heroin and other illegal drug overdoses are being counted as opiod deaths and thus an epidemic. 2.) Most users of heroin have started with prescription pain meds and were either not getting enough (government regulations) or being cut off and this is what they felt that they needed to do to manage their pain.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "11-17-2017, 06:17 PM",
    "User" : "MarkDunck",
    "Number_of_total_posts" : "16"
  }, {
    "Post" : "Prohibition worked soooo well with alcohol, after all.\nI fell over a month or two ago, and tore the rotator cuff tendon in my shoulder. I need that shoulder to hold me upright on my rollator. Have to use the arm, even though it should be in a sling. It hurts quite a lot, as you can imagine.\nDr gave me a week's worth of Panadeine Forte. It worked; I could at least sleep.\nSince then I've been using over-the-counter panadeine. Bought a packet of 40 tablets on Monday. \"Why do you need to take this drug?\" Asked the 16 year-old behind the counter.\n\"Because I'm in pain,\" I replied.\nNext year, these drugs will only be available with a prescription. That means another trip to the doctor.\nMaking it hard to get opiates for pain relief is not going to stop people using them.",
    "Titel" : "The New Prohibition Era-Opioid Pain Meds",
    "Date" : "12-13-2017, 01:11 AM",
    "User" : "Thinkimjob",
    "Number_of_total_posts" : "2851"
  }, {
    "Post" : "I'm a little bit anti-pharmaceutical. I believe that many meds contribute to liver issues, and create additional side effects and try to avoid them when possible.\nI used to take Oxybutrin for urinary fx issues. Now I use a combination of Magnesium/Calcium supplements and Uva Ursi.\nI used to take Trazedone, PRN, to help me sleep. Now, I mostly use a yoga breathing technique, and very occasional, take Melatonin.\nI needed an anti-biotic, this spring for a toe nail infection caused by getting a pedi. When it came back, instead of going on anti-biotics again, I used an essential oil.\nI've thought about taking something to manage my fatigue, but, I'm on SSDI, so, I can fit naps in and I'd rather avoid a med when I can. I did take Energ-V by Nature's Sunshine for about a month or two, and it may have helped. It seems like I can get by with one daily nap more frequently than the two I used to take.\nDoes anyone else have supplement suggestions\nfor MS symptoms that you experience?\nOne exception that I make to avoiding pharmaceuticals, though, is I do take a DMD (disease modifying med). This isn't a med to treat symptoms, though. It's a med to manage my MS.\nI'm on Copaxone. I don't forget what my life with MS was life prior to Copaxone. I really believe that it is doing it's job: reducing the fx of flares, reducing the severity of flares, and delaying progression of the disease. Different meds have different rates of effectiveness for different people, but, that's what works for me.",
    "Titel" : "Treating Symptoms -- Using meds vesus using supplements",
    "Date" : "10-23-2016, 09:03 AM",
    "User" : "Mamabug",
    "Number_of_total_posts" : "4304"
  }, {
    "Post" : "I was treated for 4 years for depression/anxiety and med free for 5 months. What helped me was therapy and mindfulness, and will be using light therapy starting the end of this month.\nI tried stretching for spasticity, but do need baclofen now.\nI am on provigil, but may stop once I make sure my water exercises are habit. Along with one hour daily of learning something new and daily nap, hoping this will keep me physically and cognitively less fatigued.",
    "Titel" : "Treating Symptoms -- Using meds vesus using supplements",
    "Date" : "10-23-2016, 09:21 PM",
    "User" : "pennstater",
    "Number_of_total_posts" : "2688"
  }, {
    "Post" : "Thanks for your response, Kathy. I like the way you expanded your answer to include other medication alternatives -- not just supplements, as I asked about, but also therapy, mindfulness, light therapy, stretching, etc. Those, actually, are more \"intentional\" than just popping a supplement in my mouth is. Good suggestions.\nFor me, I guess one of my helpful additions to my life is volunteering. Although it's somewhat \"cliche\", I feel like I often \"get more than I give\". Another one, although not nearly as enjoyable for me (because I've never liked exercise), is going to Curves once or twice a week. I should go more frequently, but, at least I'm doing something. These are not exactly alternatives to a medication, but, perhaps a preventative to depression, MS progression that comes with inactivity, etc.\nI've been checking back on this thread, looking for additional responses for others, if anyone has them.",
    "Titel" : "Treating Symptoms -- Using meds vesus using supplements",
    "Date" : "10-27-2016, 09:45 AM",
    "User" : "Mamabug",
    "Number_of_total_posts" : "4304"
  }, {
    "Post" : "Mindfulness and D-Mannose\nI started mindfulness meditation several months ago to help me cope with MS. I meditate with an app on my phone every morning before I do anything else. I think it is helping.\nAlso, on this board under UTI's, D-mannose was suggested to prevent UTI's which I have been getting every 2 to 3 weeks. I would rather prevent than take anitibiotics to cure. I ordered the supplement on Amazon and will start using it when I receive it.\nI, too, don't like to take medicine. I am on Aubagio and recently needed to start medicine for high blood pressure. I wish I could just quit all of it but quitting those could have too many bad outcomes so I take them religiously.",
    "Titel" : "Treating Symptoms -- Using meds vesus using supplements",
    "Date" : "10-31-2016, 02:46 AM",
    "User" : "loopey",
    "Number_of_total_posts" : "370"
  }, {
    "Post" : "Thanks loopey. lol -- I think we just posted on each other's threads. I was one of those who recommended D-Mannose on your thread, but I just posted there this morning.",
    "Titel" : "Treating Symptoms -- Using meds vesus using supplements",
    "Date" : "10-31-2016, 11:50 AM",
    "User" : "Mamabug",
    "Number_of_total_posts" : "4304"
  }, {
    "Post" : "loopey,\nI am also trying to avoid getting UTI's and have used D-mannose ! I, now, use vitamin C powder, about 3000 milligrams daily ! The doctor that I saw for my urinary problems told me that the issue with UTI's is that bacteria in the bladder causes the infection to go uncontrolled. High doses of vitamin C 'acidifies' the urine and kills off the bacteria. It has been working for me, so far. Good luck",
    "Titel" : "Treating Symptoms -- Using meds vesus using supplements",
    "Date" : "10-31-2016, 03:00 PM",
    "User" : "JerryD",
    "Number_of_total_posts" : "3045"
  }, {
    "Post" : "Originally posted by pennstater View Post\nI was treated for 4 years for depression/anxiety and med free for 5 months. What helped me was therapy and mindfulness, and will be using light therapy starting the end of this month.\nI tried stretching for spasticity, but do need baclofen now.\nI am on provigil, but may stop once I make sure my water exercises are habit. Along with one hour daily of learning something new and daily nap, hoping this will keep me physically and cognitively less fatigued.\nKathy, will you share your experience with mindfullness? What it is, what you do specifically and what it helps you with.",
    "Titel" : "Treating Symptoms -- Using meds vesus using supplements",
    "Date" : "11-02-2016, 03:14 PM",
    "User" : "jamilea",
    "Number_of_total_posts" : "875"
  }, {
    "Post" : "Mindfulness- great intro is the book Wherever you are, there you go.\nBeing in the moment.\nFocusing on your breath.\nIf your exhale is longer than your inhale, you will go into the rest and digest mode instead of the fight or flight mode.\nIf you lie on your back, feet flat, knees bent, you are in the constructive rest pose that resets your nervous system and is anti-inflammatory (10 min. works).",
    "Titel" : "Treating Symptoms -- Using meds vesus using supplements",
    "Date" : "11-02-2016, 07:03 PM",
    "User" : "Temagami",
    "Number_of_total_posts" : "881"
  }, {
    "Post" : "My brother used to suffer from Multiple Sclerosis and was prescribed some marijuana strains by a licensed medical practitioner. Luckily, strains purchased from an authorized\nworked wonders and, today, he is doing absolutely fine.\n**Email address removed by Moderator in compliance with MSWorld Guidelines.",
    "Titel" : "Treating Symptoms -- Using meds vesus using supplements",
    "Date" : "11-27-2017, 11:14 PM",
    "User" : "rodriguezsmith",
    "Number_of_total_posts" : "2"
  }, {
    "Post" : "Long-term treatment with prolonged-release fampridine (Ampyra) offered persistent clinical and subjective benefits in walking function in gait-impaired patients with multiple sclerosis (MS), researchers reported.\nIn an extension study of the FAMPKIN trial, MS patients had an 11.5% improvement in walking speed, a 10.7% improvement in endurance, and a 6.1-point improvement in self-perceived ambulatory function over baseline during the first open-label year of treatment, according to Linard Filli, PhD, of University Hospital Zurich, and colleagues.\nThose effects remained stable during a follow-up year of double-blind controlled treatment, with improvements in those respective endpoints of 13.1%, 12%, and 7.4 points compared with placebo, they reported online in Neurology.\nOverall, patients had significant improvement in the Timed 25-Foot Walk (T25FW) (P=0.0274), the 6-Minute Walk Test (6MWT) (P=0.0002), and the 12-item MS Walking Scale (MSWS-12) (P=0.0483) over those two years, they added.\nIn an email, Filli noted that one of the most interesting findings of the study was the fact that a third of those who initially had poor improvement with the drug had a much different response after two additional years on the medication.\nThe rest of the article is here: http://www.medpagetoday.com/mastery-...ry-in-ms/63046",
    "Titel" : "Ampyra Works Long-Term for MS Patients With Gait Disturbance",
    "Date" : "02-10-2017, 09:30 AM",
    "User" : "Marco",
    "Number_of_total_posts" : "1737"
  }, {
    "Post" : "Thank you, Marco! This is just the information I logged in for. I'm surprised I'm the first responder.\n(I always find your posts very informative and helpful!)",
    "Titel" : "Ampyra Works Long-Term for MS Patients With Gait Disturbance",
    "Date" : "09-01-2017, 07:29 PM",
    "User" : "dolule",
    "Number_of_total_posts" : "69"
  }, {
    "Post" : "Thanks for posting this information Marco. I have been taking the compounded version of Ampyra (4-Aminopyridine) for some four years. I really think it has been very helpful for me. My walking has deteriorated but not too badly. The neurologist tells me we can just deal with the symptoms so I am probably SPMS. I walk with two walking poles and not long distances, however I think the 4-Aminopyridine has kept me upright and functioning with no side effects. Glad to see there is now research to support this.",
    "Titel" : "Ampyra Works Long-Term for MS Patients With Gait Disturbance",
    "Date" : "10-02-2017, 09:53 PM",
    "User" : "indulge",
    "Number_of_total_posts" : "15"
  }, {
    "Post" : "I wonder if anyone found that Ampyra helps spasticity?",
    "Titel" : "Ampyra Works Long-Term for MS Patients With Gait Disturbance",
    "Date" : "10-25-2017, 03:32 PM",
    "User" : "there",
    "Number_of_total_posts" : "171"
  }, {
    "Post" : "I am scheduled for baclofen trial in 2 weeks.\nI was told to fast after midnight before trial. When asked why I would need to fast, they said I would be asleep from anesthesia.\nAlso told I would need pre admission testing.\nWere these things done before your trial? If not, what is protocol prior to, and day of trial?",
    "Titel" : "Baclofen trial",
    "Date" : "09-14-2017, 10:31 PM",
    "User" : "lori4055",
    "Number_of_total_posts" : "2"
  }, {
    "Post" : "It sounds like the protocol for baclofen pump surgery, not the test. It's been many years since I had the test, but it certainly did not involve anesthesia.\nSince it involves being admitted to the hospital as an outpatient, blood tests might be required.",
    "Titel" : "Baclofen trial",
    "Date" : "09-15-2017, 09:02 AM",
    "User" : "kmallory1",
    "Number_of_total_posts" : "356"
  }, {
    "Post" : "I've had two tests done the last year. I was told \"nothing by mouth\" after midnight both times. I think they was to see the effect of the baclofen on your body. Both spinal taps took about 30 minutes. I was wide awake. Definitely no anesthesia. My first test was 50mcg: no effect. My second test was 100mcg. I now have a pump. Good luck!",
    "Titel" : "Baclofen trial",
    "Date" : "09-15-2017, 11:55 AM",
    "User" : "Brad1138",
    "Number_of_total_posts" : "84"
  }, {
    "Post" : "Hello has anybody faced problems when using Aubagio as im slowly losing my teeth form this medication",
    "Titel" : "Hi",
    "Date" : "09-10-2017, 02:27 PM",
    "User" : "Ashley80",
    "Number_of_total_posts" : "1"
  }, {
    "Post" : "Other Aubagio Problems\nI have not yet had any problems with my teeth (but wouldn't be surprised). I have been on Aubagio for almost 5 years and I now have high blood pressure (a noted side effect) and constant stomach problems. I stayed with it because it is hard to know what is a side effect or MS or something else. I haven't had any flares or new lesions but now I don't think I can handle the stomach problems any more and taking meds for high blood pressure.\nI see my neuro next week and just want to stop.\nHow long have you been on Aubagio and are you certain it is the cause of your problem with teeth?",
    "Titel" : "Hi",
    "Date" : "09-11-2017, 01:52 AM",
    "User" : "loopey",
    "Number_of_total_posts" : "370"
  }, {
    "Post" : "Does anyone have experience with this? My doctor wants me to try it; I've honestly never heard about it as a treatment until now.\nHave you had it? How long does it last? Has it made a huge difference in your quality of life?",
    "Titel" : "Botox for leg spasticity",
    "Date" : "12-19-2014, 05:36 PM",
    "User" : "msesq",
    "Number_of_total_posts" : "94"
  }, {
    "Post" : "Hey msesq. I hope you are doing well. Considering you are asking about Botox, I guess you are having significant spasticity. I'm sorry, I know how painful and debilitating that spasticity can be. I was considering Botox, but eventually decided on a Baclofen pump. I'll tell you what little I do know about Botox.\nBotox is injected directly into the muscles and relaxes muscles by disrupting the communication between the brain and muscles. Botox does this by attaching to nerve endings and prevents them from transmitting signals to the muscles that eventually cause spasms. The number of injections required will be determined by the area treated. Electrical impulses may be used to ensure the injections are working properly. The injection benefits are normally realized a few days after the procedure and then lasts from 3-6 months. The procedure is then repeated every few months to maintain the effectiveness.\nSince, I never tried Botox, I cannot discuss any experienced benefits or side effects. What I can say, is that when my spasticity was removed so was the related pain. I had no idea how much spasticity was truly impacting my quality of life. If you have tried PT, stretching, oral anti-spasticity medications, acupuncture, massage, and other treatments have failed, then you have many options left. Trying Botox would be an experiment that lasted a few months. If you don't like the results, you could stop with relatively little residual damage. Make sure you clearly understand your costs before agreeing to the treatment.\nPlease update us when you can, and I hope whatever treatment you decide on will serve you well.\nYou can read more about Botox here: http://www.nationalmssociety.org/Tre...ications/BOTOX",
    "Titel" : "Botox for leg spasticity",
    "Date" : "12-19-2014, 07:53 PM",
    "User" : "Marco",
    "Number_of_total_posts" : "1737"
  }, {
    "Post" : "Thanks for the well wishes and the information, Marco.\nActually my spasticity has been well managed on Baclofen. The issue that I'm having is that I'm trying to get pregnant, and my doctor doesn't want me to keep taking it. I don't feel comfortable not taking anything, and she mentioned Botox as a solution since I'll be injecting only in my left leg. I still have to be evaluated so we'll see how it goes.",
    "Titel" : "Botox for leg spasticity",
    "Date" : "12-19-2014, 09:00 PM",
    "User" : "msesq",
    "Number_of_total_posts" : "94"
  }, {
    "Post" : "First, congratulations. What an exciting time in life, when trying to create a life. I hope it meets all your expectations. Having MS, means you also know things don't always go perfectly according to plan -- so you are better prepared for hiccups along the way. Amazing how MS hardships better prepare you for other areas of your life. Again, Congratulations!\nI cannot comment on Botox and pregnancy. I believe it has not been studied so that conversation is completely between you and your doctor.\nWhat I do know, is that Botox does not travel far from the injection site and far less travels in your blood. That's why it can be used in the face because it travels so little distance from the injection site. So if your injection location is limited, that is exactly what Botox is supposed to help. Based on what you said, it does appear that you match the Botox criteria and match it well. If you proceed, I hope it works amazingly well for you. Please keep us update. More importantly, I hope you will consider posting a baby picture into the Creative Center once it is available.\nMerry Christmas to you and yours!!!",
    "Titel" : "Botox for leg spasticity",
    "Date" : "12-20-2014, 09:21 AM",
    "User" : "Marco",
    "Number_of_total_posts" : "1737"
  }, {
    "Post" : "Botox for muscle spasms\nI have a Baclofen pump, and use oral Baclofen when needed. Because of painful spasms in a calf muscle or muscles in one leg not responsive to other treatment, my neurologist used a Botox injection. Injection did not hurt; spasms were gone for 3 months.",
    "Titel" : "Botox for leg spasticity",
    "Date" : "07-10-2017, 09:17 AM",
    "User" : "Agent86",
    "Number_of_total_posts" : "12"
  }, {
    "Post" : "Just wondering how many of you have been able to get approval/prior authorization for this drug from your insurance company? Has anyone had their doctor contact the insurance company and then received a denial?",
    "Titel" : "Modafinil",
    "Date" : "08-11-2016, 11:50 AM",
    "User" : "its2much",
    "Number_of_total_posts" : "819"
  }, {
    "Post" : "Provigil (Modafinil) has generally been easily available in Western Pennsylvania from Highmark BCBS and UPMC insurance for many years. Originally, each person had to appeal each denial. Then, the main neuros made the case across the board that Provigil is appropriate after Amantadine doesn't work for MS Fatigue. Now it's generally available.\nI don't understand why there is such variability across the U.S. and with different insurance plans?\nIs it availabile on Medicare?\nAny comments are appreciated.\nThank You,\nAlan",
    "Titel" : "Modafinil",
    "Date" : "08-11-2016, 07:20 PM",
    "User" : "alanpgh",
    "Number_of_total_posts" : "186"
  }, {
    "Post" : "Approval for Provigil\nI am sorry that you seem to be having difficulty getting your insurance to approve Provigil. I believe the problem is that the FDA has approved the use of the drug for only 3 specific diagnoses: 1. Narcolepsy 2. Obstructive Sleep Apnea and 3. Shift Work Disorder. Unfortunately the debilitating fatigue caused by MS doesn't fit into those categories. Obviously doctors prescribe drugs for off-label uses all the time. I know a number of people who post on this discussion board take it. It seems to me that with proper documentation and the support of your doctor, you should be able to successfully appeal the denial with your insurance carrier. I wish you the best of luck.",
    "Titel" : "Modafinil",
    "Date" : "08-12-2016, 01:00 AM",
    "User" : "jessiesmom",
    "Number_of_total_posts" : "364"
  }, {
    "Post" : "Appeal Letters from the National MS Society\nThis link to sample Insurance Appeal Letters from the National MS Society might be of help:\nhttp://www.nationalmssociety.org/Nat...rs-Toolkit.pdf\nBest Wishes!\nAlan",
    "Titel" : "Modafinil",
    "Date" : "08-12-2016, 01:28 AM",
    "User" : "alanpgh",
    "Number_of_total_posts" : "186"
  }, {
    "Post" : "When I went to fill my prescription for Modafinil (Provigil) the insurance company denied coverage, the Pharmacy let my Dr. know that same day, Dr. called the insurance company and Modafinil was approved. My prescription was ready for me to pick up the day after it was denied.",
    "Titel" : "Modafinil",
    "Date" : "08-12-2016, 10:36 AM",
    "User" : "SNOOPY",
    "Number_of_total_posts" : "4237"
  }, {
    "Post" : "I think that this discussion is important to the MS community . It makes me absolutely furious that the FDA, law enforcement, the NMSS, the health care insurance companies and every other MS related organization treats this drug like it is heroin ! All of the aforementioned know, full well, the usefulness of these drugs in the treatment of MS. To deny access to an MSer' is cruel and inhuman !\nI take Modafinil and I have been for several years. At first, I was denied by my insurance company but my neuro appealed. And now, there is no push back .",
    "Titel" : "Modafinil",
    "Date" : "08-12-2016, 12:03 PM",
    "User" : "JerryD",
    "Number_of_total_posts" : "3045"
  }, {
    "Post" : "This is Great News Snoopy!\nI'm glad you were quickly approved.\nit seems the insurance companies are giving us some slack, compared to many of their past practices.\nIn my experience, the NMSS has always been supportive of the science behind Provigil being effective for MS Fatigue. This is exemplified by the availability of sample appeal letters for Provigil and many other treatments.\nThank You all for your comments.\nAlan",
    "Titel" : "Modafinil",
    "Date" : "08-12-2016, 12:46 PM",
    "User" : "alanpgh",
    "Number_of_total_posts" : "186"
  }, {
    "Post" : "Oh my insurance approved it. But they only pay like 5% of the cost of it. While it worked OK when I started on it the longer that I took it the less effect it had, and now it is simply not worth the cost to me to take it.\nDoctors are dead set against trying any ADD type drugs so I am just tired all the time. It's normal .",
    "Titel" : "Modafinil",
    "Date" : "08-12-2016, 02:56 PM",
    "User" : "msgijo",
    "Number_of_total_posts" : "748"
  }, {
    "Post" : "For me, Provigil has made a transformative difference in reducing my fatugue level and improving my quality of life.\nInterestingly, Nuvigil (slow release Provigil) did not work for me, but Provigil does work. For some people, the opposite is true. Each person is different.\nGood Luck Everyone!\nThank You for your comments!\nAlan",
    "Titel" : "Modafinil",
    "Date" : "08-12-2016, 03:52 PM",
    "User" : "alanpgh",
    "Number_of_total_posts" : "186"
  }, {
    "Post" : "I had it denied for years, even following neuro appeal.\nMy neuro would prescribe double the dosage I needed, When I only needed a 100mg per day, he would also prescribe it 2/x day instead of 1/day. This was his idea because he was furious as well that they would not cover. The\nSo the one 90 day Rx lasted me 360 days for the 100mg dosage. I used a pill cutter and cut each week.\nWhen I needed a higher dosage, I wound up ordering from Canada. The pill was actually manufactured in India. I found it helped clear some cog fog for me, but not the physical fatigue.\nWhen I stopped working and switched to husband's medical plan, it was a different insurer. So again, denied, neuro appealed, and this time, successful. When I started again filled in US, both physical and cognitive were better.\nSo possibility Rx shipped by Canadian pharmacy not exact same formulary or could also just be that since not working, fatigue in general is somewhat better.\nIt does suck that here in the US, insurers have so much control over our meds. Until the FDA is pressured into listing MS Fatigue as usage, we are at our insurer's mercy.",
    "Titel" : "Modafinil",
    "Date" : "08-16-2016, 06:11 AM",
    "User" : "pennstater",
    "Number_of_total_posts" : "2688"
  }, {
    "Post" : "Originally posted by its2much View Post\nJust wondering how many of you have been able to get approval/prior authorization for this drug from your insurance company? Has anyone had their doctor contact the insurance company and then received a denial?\nI am on Medicaire part D. I never had a problem but provigil didn't work for me. Switched to Adderall and also had no insurance issues. I'm in Ohio. No pre auth or anything.\nOnly time that happened to me was with testosterone and the approval took like a week.",
    "Titel" : "Modafinil",
    "Date" : "08-17-2016, 10:57 AM",
    "User" : "hitdog042",
    "Number_of_total_posts" : "1"
  }, {
    "Post" : "Originally posted by pennstater View Post\nUntil the FDA is pressured into listing MS Fatigue as usage, we are at our insurer's mercy.\nThat isn't how it works. The FDA doesn't choose what a drug is used for. The use is chosen by the patent holder/manufacturer in their new drug application.\nThe use is chosen by the applicant. The applicant presents clinical data that, it is hoped, demonstrates that the drug is safe (which is a relative term) and effective for the use being applied for. The FDA then approves or rejects the drug for that specific use. The FDA has no influence over what use is chosen, or the use the drug is approved for, other than to agree that the drug is safe and effective for that use.\nBecause drug trials cost multi-millions of dollars, drug companies limit the number of uses applied for in order to keep the cost of the trials down. If there is the potential of profit for other uses, the company will then run more clinical trials for the second purpose. It has to apply for the additional use(s) separately.\nAn example of this is Ampyra, which is approved only to increase walking speed. There doesn't appear to be any potential for profit in testing and applying for another other use.\nAnother example is Tysabri. After it was approved for MS, Biogen did separate trials and applied separately for its approval for treatment of Crohn's disease. Obviously there was the potential for profit in using it to treat another disease.\nThe specific use(s) for a drug is part of the drug's labeling. The FDA doesn't forbid use of drugs off-label, but it forbids drug companies to advertise or in any way promote off-label uses.\nOnce a drug loses patent protection and goes generic, there's no motivation for anyone to do clinical trials to get a new use approved. They can't get another patent for that use because it's the same drug, and there's no way to make back the money that would be spent on drug trials.\nNor does the FDA have any influence over what drugs insurance companies put on their formularies or what uses of the drugs the insurers cover.\nSo that's why the FDA can't be pressured to add an approved use to force an insurer to cover the cost of a drug. They don't control it.",
    "Titel" : "Modafinil",
    "Date" : "08-17-2016, 11:38 PM",
    "User" : "jreagan70",
    "Number_of_total_posts" : "897"
  }, {
    "Post" : "I had no problems with coverage\nWhen my Neuro prescribed 100 mg Modafinil, I had no problems with the insurance (UHC) covering it and my co-pay was $70. I think he had to tell them it was specifically for MS. The 100 mg had no effect so he upped it to 200mg per day and that helped with my fatigue for a few months but then seemed to stop working. I may be switched to Nuvigil soon (Dr appt next week, so we'll see). As stated by someone above, it is a lot to pay for a drug when it seems to not be working anymore.\nTeri",
    "Titel" : "Modafinil",
    "Date" : "08-26-2016, 05:49 PM",
    "User" : "tahoeteri",
    "Number_of_total_posts" : "13"
  }, {
    "Post" : "I had a lot of trouble with insurance approval. First time they denied it and my neurologist filed a lot of paperwork and I was able to get it for a year. This past January they denied it again even though I was taking it and it was really making a difference for me. They said I needed to have sleep apnea or narcolepsy to get it approved this year. Ridiculous!\nAnyway had a sleep study to try to get some proof for insurance since I have had sleep issues of waking up every 90 minutes every night. Well I have sleep apnea so got the Modafinil back. Didn't believe I had that and still not sure since I still wake up every 90 minutes with the mask on. Just had second study in the hospital which didn't show sleep apnea so seeing sleep neurologist again this week to decide what's going on.\nI'm afraid though if they take back the diagnosis I'll lose the Modafinil which will mean tough days ahead. I just had to come off Ampyra two weeks ago because I'm having seizures now. Without both not sure if I'll get back to work after I recover from this relapse.\nSorry for going off track but yes some insurances can be real tough on allowing Modafinil for MS. Good luck with the battle!\n** Moderator's note - Post broken into paragraphs for easier reading. Many people with MS have visual difficulties that prevent them from reading large blocks of print. **",
    "Titel" : "Modafinil",
    "Date" : "08-27-2016, 12:59 PM",
    "User" : "AriD",
    "Number_of_total_posts" : "351"
  }, {
    "Post" : "Where do you live, and what is your insurance?\nMany insurance plans cover Provigil for MS if you appeal.\nHere are the appeal templates from the MS Society:\nhttp://www.nationalmssociety.org/Nat...rs-Toolkit.pdf\n(Thank you MS Society for the appeal templates!)\nIn your case, perhaps the Sleep Apnea diagnosis will help.\nPlease keep us updated.\nBest Wishes!\nAlan",
    "Titel" : "Modafinil",
    "Date" : "08-27-2016, 07:09 PM",
    "User" : "alanpgh",
    "Number_of_total_posts" : "186"
  }, {
    "Post" : "I live in Massachusetts. My insurance wouldn't cover either drug unless diagnosis of sleep disturbance. My neurologist actually copied and sent in long appeals including all the information from the MS Society three times as well as her own evidence. Didn't help still denied every time until I got sleep apnea diagnosis. Insurance said it didn't matter what MS Society said because both drugs are still considered off label for MS and therefore they wouldn't cover it.\nWhat's ridiculous about it is that they did approve it the year before. Just trying to save money.",
    "Titel" : "Modafinil",
    "Date" : "08-27-2016, 10:26 PM",
    "User" : "AriD",
    "Number_of_total_posts" : "351"
  }, {
    "Post" : "Got my approval letter yesterday!\nLetter says they have approved coverage effective 5/26/16 (gee, can we turn back the clock?) through 8/24/2017! Neuro ordered 200mg twice a day for 30 days. I checked drug pricing - for 30 pills it's about $8 - for 60 pills it's 30 times that - $243. WHY??????",
    "Titel" : "Modafinil",
    "Date" : "08-28-2016, 10:39 AM",
    "User" : "its2much",
    "Number_of_total_posts" : "819"
  }, {
    "Post" : "Originally posted by its2much View Post\nI checked drug pricing - for 30 pills it's about $8 - for 60 pills it's 30 times that - $243. WHY??????\nIs that the cost through your insurance company pharmacy?\nIt may not matter where those prices came from. The discrepancy between the two prices is because the $8 price is obviously a mistake. $80 for 30 200-mg pills is still suspiciously low, but at least it's approaching the realm of reality.\nModafinil is expensive. Even the lowest prices for 30 pills are rarely under $100. So at an average low cost of about $125 for 30 pills, the $243 cost for 60 pills is the realistic one.\nIf you can actually get 30 pills for about $8, that would be a gift. You should probably say grace every time you take one.",
    "Titel" : "Modafinil",
    "Date" : "08-29-2016, 11:31 PM",
    "User" : "jreagan70",
    "Number_of_total_posts" : "897"
  }, {
    "Post" : "took forever to get it\nI have been on for several years now. My doctor sent letters and did have the sleep study test done.\nI had to do without it last year as my insurance decided not to pay. I had hard time coping without it. Medicare does cover-I think- as does my insurance. Insurance pays for it as a Tier 4 so it does not cover that much.",
    "Titel" : "Modafinil",
    "Date" : "09-05-2016, 02:07 PM",
    "User" : "lightweaver",
    "Number_of_total_posts" : "12"
  }, {
    "Post" : "Coverage Restrictions In Ohio\nOriginally posted by hitdog042 View Post\nI am on Medicaire part D. I never had a problem but provigil didn't work for me. Switched to Adderall and also had no insurance issues. I'm in Ohio. No pre auth or anything.\nOnly time that happened to me was with testosterone and the approval took like a week.\nAlso in Ohio w/Medicare Part D but have had a very different experience. Very strict requirements-quantity restrictions, detailed proof of alternative medication trials, annual Prior Authorizations, Appeals. All the paperwork is off-putting to doctors and patients alike.\nCan you recommend an excellent doctor in your area?",
    "Titel" : "Modafinil",
    "Date" : "02-02-2017, 08:39 PM",
    "User" : "kllmentyn",
    "Number_of_total_posts" : "1"
  }, {
    "Post" : "Seems not to be as strict in PA.\nBut it might depend on the insurance company and doctor being proactive.\nCan anyone update us on the ability to get Provigil (of course, the generic version) in other states / countries?\nThank You,\nAlan",
    "Titel" : "Modafinil",
    "Date" : "02-02-2017, 09:56 PM",
    "User" : "alanpgh",
    "Number_of_total_posts" : "186"
  }, {
    "Post" : "Any variation among generic manufacturers of Modafinil?\nHave any of you noticed a variation in effectiveness among different manufacturers of the generic forms of the drug?\nMany thanks for any feedback.\nAlan",
    "Titel" : "Modafinil",
    "Date" : "02-02-2017, 11:13 PM",
    "User" : "alanpgh",
    "Number_of_total_posts" : "186"
  }, {
    "Post" : "Provigil prescripton was changed to Modafinal - now it is not approved for me.\nI was on Provigil and later modafinal for almost two years. When I tried to renew a prescription a few months ago, it was denied. The reason is I have been on SSDI since April 2015 and do not have a job (last job was second shift) so obviously, poor cognition and fatigue do not matter to me anymore.\nI am starting Amantadine this week. We shall see how that works for fatigue!",
    "Titel" : "Modafinil",
    "Date" : "05-02-2017, 11:06 AM",
    "User" : "Memphis Slim",
    "Number_of_total_posts" : "17"
  }, {
    "Post" : "Are you appealing the denial?\nThere is a standardized appeal letter from the MS Society. I can send later if you don't have it.\nLet us know.",
    "Titel" : "Modafinil",
    "Date" : "05-02-2017, 01:22 PM",
    "User" : "alanpgh",
    "Number_of_total_posts" : "186"
  }, {
    "Post" : "Modafinil\nOriginally posted by its2much View Post\nJust wondering how many of you have been able to get approval/prior authorization for this drug from your insurance company? Has anyone had their doctor contact the insurance company and then received a denial?\nI have been on Modafinil for a year and have gotten preauthorized through Cigna Advantage.",
    "Titel" : "Modafinil",
    "Date" : "07-06-2017, 11:50 AM",
    "User" : "Tim1843",
    "Number_of_total_posts" : "1"
  }, {
    "Post" : "I have been on Modafinil for a couple of years. I was given a script for Provigil. My insurance company balked at paying for it. My neurologist fought them and Keystone IBC relented. I began the generic, Modafinil and have been using it for several years . Good luck",
    "Titel" : "Modafinil",
    "Date" : "07-09-2017, 09:34 AM",
    "User" : "JerryD",
    "Number_of_total_posts" : "3045"
  }, {
    "Post" : "Had been using modafinil for years, quite helpful for MS related fatigue. About 4 months ago, Insurance (Independence BC, Philly area) refused coverage and rejected all appeals. The Insurance company found a doc who disputed the evidence of effectiveness. To purchase a 30 day supply of 200 mg tabs would cost about $800. (!)\nPart of this may be the FDA decision to classify the drug as Schedule iv b/o addictive potential. (Say what?) I am told that Provigil became popular with students who were using (abusing) it to try to get better grades.\nOnline pharmacies advertise the drug. Has anyone done this successfully?",
    "Titel" : "Modafinil",
    "Date" : "07-10-2017, 09:09 AM",
    "User" : "Agent86",
    "Number_of_total_posts" : "12"
  }, {
    "Post" : "Laying down inside the tight tube of the MRI machine, with my head imobilized inside a plastic cage, I watched through the tiny mirror just over my head as the technicians in another room preparaed the computers for my MRI. While I was waiting, I thought about what the nurse told me while I was getting dressed for the MRI, she said, \"this is your 12th MRI with us.\" I had four MRI's previous to coming to this clinic, therefore I was now about to experience my sixteenth MRI in twenty-three years.\nAs I watched the technitians, I caculated that I have had one MRI about every 11.6 months over those many years. And I remembered that all those MRIs had bee virtualy clean. The only lesions that were ever found were \"too tiny\" and did not corelate with my MS symptoms (of which there have been many). While I has having these thoughts I was holding on to the soft plastic emergency plunger with a cord that ran out to the technicians. And when I pressed the emergency plunger, it was not because I was having a claustriphobic attack, but because I was tired and I could not take it anymore.",
    "Titel" : "My last MRI?",
    "Date" : "06-16-2017, 06:26 AM",
    "User" : "driftless",
    "Number_of_total_posts" : "3"
  }, {
    "Post" : "Funny ... I wrote later about this topic to a friend with the ending, \"I will just have to postpone MRI number sixteen untill another day.\" I was too abrupt in how I ended the orginal, above; I like this new endeding better.",
    "Titel" : "My last MRI?",
    "Date" : "06-16-2017, 07:23 AM",
    "User" : "driftless",
    "Number_of_total_posts" : "3"
  }, {
    "Post" : "Hi driftless and welcome to MSWorld\nAnd when I pressed the emergency plunger, it was not because I was having a claustriphobic attack, but because I was tired and I could not take it anymore.\nI found the above quote interesting. Tired, meaning fatigued or tired of dealing with the disease? You couldn't take what? Being in the MRI machine?\nshe said, \"this is your 12th MRI with us.\" I had four MRI's previous to coming to this clinic, therefore I was now about to experience my sixteenth MRI in twenty-three years\nYou have been diagnosed with MS for Twenty-Three years?\nThe written word is easily misunderstood and I am just looking for clarification --- if you don't mind",
    "Titel" : "My last MRI?",
    "Date" : "06-16-2017, 09:57 AM",
    "User" : "SNOOPY",
    "Number_of_total_posts" : "4237"
  }, {
    "Post" : "Hi Driftless,\nTo me it sounds like your just tired of everything. Did you finish the MRI? and have follow up with doc?\nI've had ms for over 32years now and have lost count how many MRI\"S i've had or other tests, treatments etc . It can become a huge blur of medical apts etc that we don't get the chance, or experience the desire to live life. It feels like we are constantly at war ( with ourselves sometimes).\nThis can result in the overwelming desire to just quit all this and live as best we can.\nI think we would all be able to identify with this . and many have done it , including me, hoping for the best.\nIf this is where your at , at this point in your life, then i don't think it would impact greatly on your health if you took a break from it all. Sometimes our attitude to living is more important than a few tests or treatments and deserves some effort to get back on track.\nYou will know when to get back to the medical pros- the first time some symptom comes and bites you on the butt is generally the time we refocus.\nGood luck with everything and i hope it helped to share your feelings.\nCaroline.",
    "Titel" : "My last MRI?",
    "Date" : "06-16-2017, 07:13 PM",
    "User" : "Carolinemf",
    "Number_of_total_posts" : "584"
  }, {
    "Post" : "The first time I took steroids for double vision, it restored my vision within a few days. I had a big flare in January with right side weakness, extreme head to toe numbness, spasticity, and pain. I did 4 days of solu-medrol and it did absolutely nothing. It's been 5 months and I'm not better. I had to go on temporary disability, and this flare has been devestating physically, mentally, and financially. Why didn't steroids work?",
    "Titel" : "steroids didn't work",
    "Date" : "05-20-2017, 07:51 PM",
    "User" : "pyrmama2",
    "Number_of_total_posts" : "4"
  }, {
    "Post" : "Originally posted by pyrmama2 View Post\nWhy didn't steroids work?\nThe steroids probably DID work... at what steroids do. Unfortunately, a lot of people have a mistaken idea idea about what steroids do and are supposed to do. So when steroids don't do what they aren't *supposed* to do, people say they didn't \"work\" and blame the steroids.\nOriginally posted by pyrmama2 View Post\nThe first time I took steroids for double vision, it restored my vision within a few days.\nActually, the steroids did NOT restore your vision. Steroids reduce inflammation. They don't heal anything. They HELP to promote healing by providing a quieter environment in which the body's actual healing processes can take place. Your double vision resolved when the damaged nerves were able to recover their function in an environment of reduced inflammation. The steroids didn't do anything to heal the nerves or restore your vision. Because steroids don't do any healing, they have NO effect on the final outcome of a flare. Research has shown many times that the end result of a flare is the same whether the flare is treated with steroids or not treated with steroids at all.\nThe mistake people make about steroids is that they think steroids affect the final outcome. They don't. So there's no reason to treat with steroids if the only hope is that they'll \"work\" and \"make it better.\" The benefit to steroids is that they *can* -- but there's no guarantee -- reduce the healing *time* and shorten the duration of the symptoms. And they do that by providing that quieter environment that allows the body's own healing processes to take place. And when someone has extensive debility from a flare -- like you do -- there's great benefit in restoring (or trying to) as much function as possible as quickly as possible.\nSo THAT'S why your flare was treated with steroids. In your position I would have done exactly the same thing. And I have done it several times. Here's the critical point. IF not a lot of damage has been done and steroids are administered quickly, that quieter environment can allow nerves to heal quickly and fairly completely. BUT IF too much damage has already taken place before the steroids are administered, there's too much damage to overcome and the nerves can't heal.\nSometimes healing is actually fairly complete, just slow. Sometimes the amount of healing is limited because some of the damage is *already* permanent. Sometimes all of the damage is permanent and there is little to no recovery. All of that damage happened independent of the steroids, and there's nothing steroids can do because they don't heal anything on their own. And when steroids don't do something they aren't supposed to do and can't do, it can't be said that they didn't \"work.\"\nOriginally posted by pyrmama2 View Post\nI did 4 days of solu-medrol and it did absolutely nothing. It's been 5 months and I'm not better.\nI think we've established that the Solu-Medrol probably did quite a lot of what it does. It just wasn't what you wanted it to do. So you can let them off the hook now. :-) Five months isn't really enough time to recover from a body-wide flare. That's not realistic. Recovery can take years. It took me *8* years to recover from a large spinal cord injury. Your body *wants* to recover, and it will to some degree if you give it a chance. But it can't if you keep going back and re-embedding the injury by focusing on it over and over and over. Instead, try embedding your *recovery* by talking about THAT over and over and over. Your brain will go after whatever you tell it to go after. So why not tell it to go after something you want instead of something you don't?",
    "Titel" : "steroids didn't work",
    "Date" : "05-20-2017, 10:33 PM",
    "User" : "jreagan70",
    "Number_of_total_posts" : "897"
  }, {
    "Post" : "Hi pyrmama2,\nFor weakness you might consider working with a Physical Therapist(PT). PT and exercise are both important for regaining and improving strength and mobility. Your Neurologist can give you a referral for PT.\nThere are symptom management medications that can help some symptoms. There are very few symptom management medication that have been FDA approved specifically for MS, most of the medications prescribed for MS symptoms are used \"off label.\" Muscle relaxers are used for spasticity.\nExercise and PT is helpful for MS symptoms such as fatigue, spasticity and pain. Some people have had improvement in numbness with Neurontin, but it can be hit or miss.",
    "Titel" : "steroids didn't work",
    "Date" : "05-21-2017, 03:38 PM",
    "User" : "SNOOPY",
    "Number_of_total_posts" : "4237"
  }, {
    "Post" : "Good advice. I just never have delt with any flares this serious. My 'flares' were so minor for the 11 years that I have been diagnosed, I wasn't prepared for this.",
    "Titel" : "steroids didn't work",
    "Date" : "05-22-2017, 04:58 AM",
    "User" : "pyrmama2",
    "Number_of_total_posts" : "4"
  }, {
    "Post" : "Sorry you're feeling like this, how frustrating for you. This won't help with your current issues but if you have to do the steroids again maybe ask for 5 days of IV with an oral dose to follow, tapering you off slowly. I've only had one flare that left permanent damage (left eye is blind) and I didn't get the oral taper. It was my first flare, the one that led to the DX, so I didn't know about the oral. I hope you get some answers you need and end your suffering.\nJen",
    "Titel" : "steroids didn't work",
    "Date" : "05-22-2017, 07:05 PM",
    "User" : "Cat Mom",
    "Number_of_total_posts" : "1730"
  }, {
    "Post" : "Originally posted by Cat Mom View Post\nSorry you're feeling like this, how frustrating for you. This won't help with your current issues but if you have to do the steroids again maybe ask for 5 days of IV with an oral dose to follow, tapering you off slowly. I've only had one flare that left permanent damage (left eye is blind) and I didn't get the oral taper. It was my first flare, the one that led to the DX, so I didn't know about the oral. I hope you get some answers you need and end your suffering.\nJen\nOriginally posted by Cat Mom View Post\nif you have to do the steroids again maybe ask for 5 days of IV with an oral dose to follow, tapering you off slowly. I've only had one flare that left permanent damage (left eye is blind) and I didn't get the oral taper. It was my first flare, the one that led to the DX, so I didn't know about the oral.\nThis is making that mistaken implication that steroids -- and in particular an oral taper -- have some effect on the final outcome of a flare. Research has shown that steroids have NO effect on the final outcome of a flare.\nFurther research has shown that an oral taper also has NO effect on the outcome of a flare, and oral tapers are no longer recommended. If anything, the additional steroid ingested with a taper adds to the risk of additional steroid damage -- diabetes, bone death, osteoporosis, glaucoma -- for no benefit. Does that taper still sound like a good idea?\nThe practice of oral steroid tapers came from diseases like lupus and rheumatoid arthritis that sometimes show rebound flares of inflammation after sudden cessation of high dose steroids. Many years of use of high-dose steroids in MS have shown that MS doesn't have rebound flares. No rebound, no need for a taper. Doctors who don't keep up with practice recommendations might still prescribe tapers, but they're not in the patients' best interest.\nI take high-dose steroids 4 times a year and I haven't done a taper in at least 10 years. My doctor wouldn't prescribe one even if I asked for it.\nAnd certainly, long-lasting effects after a flare has nothing to do with whether a relatively small taper was done 5 months before.\nSo no benefit plus additional risk of harm has eliminated the outdated practice of an oral steroid taper.",
    "Titel" : "steroids didn't work",
    "Date" : "05-22-2017, 10:42 PM",
    "User" : "jreagan70",
    "Number_of_total_posts" : "897"
  }, {
    "Post" : "Sorry to hear, it also left me with the side effects, but it works in the short run. I have seen people with terrible side effects and i no longer used them",
    "Titel" : "steroids didn't work",
    "Date" : "05-23-2017, 07:19 AM",
    "User" : "AmyForever",
    "Number_of_total_posts" : "29"
  }, {
    "Post" : "Has anyone ever taken Tegretol? My doctor wants me to go on it. I want to know your experience with it. TIA",
    "Titel" : "Tegretol",
    "Date" : "02-04-2015, 04:32 PM",
    "User" : "aprilmitt",
    "Number_of_total_posts" : "56"
  }, {
    "Post" : "Is it for pain relief? I was on it (as Carbamazepine) a few years ago in combination with several other meds. It didn't help me, but nothing except Ambien has ever helped me with pain, so I'm not the best person to go by. I don't recall any side effects, but I do remember that I had to chew it. It wasn't the worst thing* I've ever tasted, but I didn't enjoy it.\n*The worst thing in the \"therapeutic\" category I've ever tasted was liquid Co-Q10. If anyone ever suggests it to you instead of capsules, just say no.",
    "Titel" : "Tegretol",
    "Date" : "02-04-2015, 08:25 PM",
    "User" : "J-Bo",
    "Number_of_total_posts" : "422"
  }, {
    "Post" : "I was on Tegretol (Carbamazepine CR) for just over a year due to severe trigeminal neuralgia and neuropathic skin pain. I didn't seem to have any great side effects with it and found it far more effective than the Gabapentin I'm now on.",
    "Titel" : "Tegretol",
    "Date" : "02-04-2015, 11:19 PM",
    "User" : "Poppy7402",
    "Number_of_total_posts" : "241"
  }, {
    "Post" : "I was on it very briefly but had an allergic reaction and had to come off it. I didn't have to chew it though. On neuron-tin now but was told it wouldn't be as effective. Hope it helps you.",
    "Titel" : "Tegretol",
    "Date" : "02-05-2015, 12:35 AM",
    "User" : "AriD",
    "Number_of_total_posts" : "351"
  }, {
    "Post" : "thank you for the replies\nI'm having dizzy spells along with a tinglin/electric shock feeling simultaneously for the last month or more. It started as 2-4 a day. Now its up to almost 30 a day and it happens when I'm driving. It literally lasts for 3 seconds and then I'm fine again. I had a brain mri and no new lesions.",
    "Titel" : "Tegretol",
    "Date" : "02-05-2015, 06:04 AM",
    "User" : "aprilmitt",
    "Number_of_total_posts" : "56"
  }, {
    "Post" : "I didn't know that Tegretol does all that. I started taking it for seizures. One day I had a seizure (scared everyone). So the neuro said seizures aren't from MS so they sent me for an EEG and they said there's nothing in my brain pointing to epilepsy. So then they sent me for an MRI and then said - Ohhh, Your white lesions are overlapping with your gray matter (something like that) so the MS was actually what caused the seizure but it really wasn't an MS problem. So that neuro panicked and put me on a high dosage of tegretol and I felt terribly sick and thought that was the end of me...\nWell it finally worked it out and I took tegretol for 5 years. No problems except I think it makes you tired. (or maybe the MS made me tired ). So after 5 years with no seizures I stopped the tegretol and then 5 years after that I had a seizure. So back to tegretol. I stopped after 5 years but when I started taking ampyro to help my walking I went back to tegretol but only 100 mg/day.\nI'm not in any pain (never was), so maybe the tegretol is what keeps me pain free",
    "Titel" : "Tegretol",
    "Date" : "02-05-2015, 10:32 AM",
    "User" : "DonnaD",
    "Number_of_total_posts" : "126"
  }, {
    "Post" : "I have found that the second generation Trileptal works much better than Tegretol. However, I became allergic to Trileptal (oxcarbazipine) Now I am back on Tegretol for Trigeminal neuralgia and seizures. Personally, it doesn't do much for me but help me sleep at night. I take other meds for seizures because it didn't help. For my TN I get steroid shots in my face and head.\nIt may work for you, especially since you don't know if you have MS or not. It is really good for peripheral neuropathy. Try it. If it doesn't work, ask for something else.\nSide effects: None except drowsiness, but if I take it all day I get used to it. Now I only take it at night to help me sleep.\nGood luck\nLisa",
    "Titel" : "Tegretol",
    "Date" : "02-06-2015, 01:53 PM",
    "User" : "22cyclist",
    "Number_of_total_posts" : "2496"
  }, {
    "Post" : "Tegretol extended release vs normal tablets\nThanks for the info I've read in this thread..\nIs it possible that the Carbamazepine ER formula could have different side effects than the normal release tablets? (Besides the method of release, I mean it's the same medicine and same dosage so shouldn't side effects be the same? Yet they're not, ugh!!!!)\nI started taking Tegretol (carbamazepine) 100mg twice a day, for a week. That helped but I was tired, I'd rather be tired than go through the \"brain tremors\" not seizures, and flipping nerve pain to no end.\nThen, I just switched to 200mg ER (extended release) to be taken only at night. I woke up swollen and have been agitated and miserable all day.\nMy doctor doesn't think it should be any different except the nature if the release, obv. but I'm a hot mess. All other things are the same and have been addressed, yadda...\nAny info on this med dosage and ER tablets would be greatly appreciated!\nP.S. Doctor and Pharmacist said the 200mg ER is a 24 hour release tablet. But the paperwork that come with the Rx say 12 hour. Anyone in the know?\nThis med seems to be the best choice out of all the other ines for me, so I'm trying to figure how to take it and not swell back up like a balloon. (I've worked sooooo hard to keep the edema down from all the absolutely necessary steroids in the past, I can't take welling back up again 😰.)\nTHANK YOU!!! 🎗🎗🎗",
    "Titel" : "Tegretol",
    "Date" : "10-05-2016, 10:37 PM",
    "User" : "Ikaika",
    "Number_of_total_posts" : "95"
  }, {
    "Post" : "Hi Ikaika:\nOriginally posted by Ikaika View Post\nIs it possible that the Carbamazepine ER formula could have different side effects than the normal release tablets?\nThe side effects for the ER formula might be the same as for the normal release, but because of the extended release, the side effects are also extended release -- they can't clear up quickly as they would with the formula that clears quickly. Because the side effects can't clear up quickly, they might seem different.\nOriginally posted by Ikaika View Post\nDoctor and Pharmacist said the 200mg ER is a 24 hour release tablet. But the paperwork that come with the Rx say 12 hour. Anyone in the know?\nYou would do better to rely on the scientific information in the prescribing information, which has been reviewed and approved by the FDA.\nYour doctor and pharmacist are correct that the ER formula has the capability of releasing something over 24 hours. But that doesn't at all mean that the tablets release a perfectly metered amount of medication that is exactly the same over 24 hours and that the med only needs to be taken once every 24 hours. (I can see how your doctor may not understand this, but your pharmacist should know better.)\nThe amount of medication varies over the 24 hours, and the level peaks in the blood somewhere between 3 and 12 hours (which could be why you're waking up swollen and puffy if you take it at bedtime). And that's why, in regular usage, the ER version is taken 2X a day instead of once -- because the peak level should be renewed every 12 hours, not every 24. The normal/conventional tablets peak at about 4-5 hours, and they're usually taken 4X a day to renew the peak level about every 4-5 hours.\nOriginally posted by Ikaika View Post\nThis med seems to be the best choice out of all the other ines for me, so I'm trying to figure how to take it and not swell back up like a balloon.\nIf your body can't release the extended edema that may come with the extended-release med, you may not be a candidate for the ER version. The normal, quicker-acting med may allow the edema to dissipate quickly so it doesn't accumulate and you don't swell up, but the trade-off may be that you'll have to take the med more often. But that might not be so bad if you can get the benefits of the med without accumulated side effects.",
    "Titel" : "Tegretol",
    "Date" : "10-06-2016, 11:40 PM",
    "User" : "jreagan70",
    "Number_of_total_posts" : "897"
  }, {
    "Post" : "Update from my above response about having reaction to tegretol and coming off it. I had a mild rash on my arms so stopped taking it. Took neurontin instead.\nEight weeks ago, I started having myoclonic seizures/ movement disorder. Got high dose steroids oral then one week later high dose iv steroids when the oral doses didn't stop them. Still had them.\nSo my doctor increased my neurontin and started me on clonazapam for seizures without effect. My doctor decided to try tegretol again since I only had had a mild rash. Seizures went away within a couple of days. Was so happy...\nWell, two weeks later I got so sick. High fevers, rigors, increased liver functions, severe leg spasms, and more. Was hospitalized for a week. Multiple tests. No infection. The infectious disease doctors told me they have seen this with tegretol many times before. That I was lucky I got into the hospital when I did. Still trying to recover. Out of work eight weeks so far.\nSo no more tegretol for me. Off for two weeks now and no seizures yet. But just started having weird electrical sensations in my right arm which was happening when I had the seizures. Hoping hoping they aren't coming back.\nTegretol can do wonders but be cautious of its devastating side effects.",
    "Titel" : "Tegretol",
    "Date" : "10-10-2016, 11:38 PM",
    "User" : "AriD",
    "Number_of_total_posts" : "351"
  }, {
    "Post" : "I pray you are feeling better now! Some relief!!\nOriginally posted by AriD View Post\nUpdate from my above response about having reaction to tegretol and coming off it. I had a mild rash on my arms so stopped taking it. Took neurontin instead.\nEight weeks ago, I started having myoclonic seizures/ movement disorder. Got high dose steroids oral then one week later high dose iv steroids when the oral doses didn't stop them. Still had them.\nSo my doctor increased my neurontin and started me on clonazapam for seizures without effect. My doctor decided to try tegretol again since I only had had a mild rash. Seizures went away within a couple of days. Was so happy...\nWell, two weeks later I got so sick. High fevers, rigors, increased liver functions, severe leg spasms, and more. Was hospitalized for a week. Multiple tests. No infection. The infectious disease doctors told me they have seen this with tegretol many times before. That I was lucky I got into the hospital when I did. Still trying to recover. Out of work eight weeks so far.\nSo no more tegretol for me. Off for two weeks now and no seizures yet. But just started having weird electrical sensations in my right arm which was happening when I had the seizures. Hoping hoping they aren't coming back.\nTegretol can do wonders but be cautious of its devastating side effects.\nPlease forgive my VERY delayed reply!!!! I read your post and have been praying for you and so sad you had been going through this. I have been praying for you indeed!!!!\n(Reason for my delay is I have been having a joy ride too, not. ER, concussion, new lesions, couldn't stand up, all that jazz...)\nAnyway, I truly hope you have received some relief from the seizures and all of the symptoms. That is very difficult, and through your hardships you even toook the time to post on here and help me. May God bless you with His Favor tenfold and His Healing upon you.\nI have since stopped the Tegretol. And started a medicine called Trokendi XR. I believe the generic is topirimate. I take a very small dose only at night and it helps so much with the tremors. I don't have any side effects nor swelling, just relief so my brain stops getting those surges at night.\nPraying for you! Thank you again for your posts and information. Praying for everyone living with MS and these bizarre, challenging times. And praying for all the angels helping!!!",
    "Titel" : "Tegretol",
    "Date" : "01-25-2017, 06:14 PM",
    "User" : "Ikaika",
    "Number_of_total_posts" : "95"
  }, {
    "Post" : "Hi all,\nI'm 61 yo woman living with Secondary Progressive MS. I've had MS since the beginning of time, and it started before they had DMD's, so I'm a mess.\nMy fatigue has graduated to that level known as \"crippling fatigue.\" I don't need to describe it, I'm sure. I am still walking, with braces on both legs, as my feet no longer evert. I use a walker, walls, husband's jeans waistband, what ever it takes to walk. The neuro has said that people like me, who are still walking in spite of a large disease load, are the patients who have off-the-charts fatigue. So, hurrah for still walking.\nRecently my neuro suggested Aderall, which I had tried and hated many years ago. But, since my fatigue is so much worse now, we thought it may be worth a try. So, I took my 10 mg tablet at 9 on the first day. And, it did give me more focus (I sewed for three hours!). It did not make me feel energetic, it just made me feel like I could do things in spite of the fatigue. And, so I did. And, I paid for that with a great increase in what is already \"crippling\" pain. And, I could not sleep well that night, with a racing feeling lingering from the Aderall. The dosage did give me side effects of racing heart, anxiety, dry mouth, the usual.\nNot one to give up, I got up on day #2 and took my little pill at 8 a.m. And, I had the same results, I sewed for 4 hours! along with some other things. And, I ended up in great pain. And, again I did not sleep well at all.\nThis morning I got up and I felt like I HAD to take that pill. Now there's a feeling I do not want. So, I took 1/2 (5 mgs) and it provided little benefit. So, here I am, fogged out and trashed at 1 p.m., as usual. Soon I will do my usual lay down on the couch which pretty much marks the end of my productivity for the day aside from knitting in the evening.\nI am conflicted because I know that Aderall is Meth and Meth is not a drug to sneeze at. Addiction is rampant with this med, (and I am a 25 year recovered alcoholic) as are long-term side effects and changes in one's brain. Weaning off of it can be a beast. However, I sewed for 4 hours! And that was such a good feeling, to be in my sewing room, doing what I do. However, I do not want to have that feeling at the expense of the health of my brain and personality. If I do stay on it and it continues to interrupt my sleep (in spite of a bomb of pills I take to sleep) then it is game over anyhow.\nI am seriously considering stopping this drug all together before I get in too deep. It's so tough, though, as without this pill, I've got nothing to work with. I do all I can in a day, and just drag on. My morning activities of living like showering, dressing, making the bed, having breakfast, leave me drained to start off the day. And it just goes downhill from there. You'd think with this level of fatigue I'd be willing to take snake oil if it would help.\nAnd, so I turn to all of you to hear from those who have experience with Aderall. BTW, I have tried all of the different supplements and other natural remedies recommended by people here, and all those were was a terrible waste of money. So, I'm not looking for a different solution. I'm looking for advice on this topic, Aderall. (I have in the past also tried Concerta and Ritalin, so those are crossed off the list).\nThank you!!!!!",
    "Titel" : "Aderall, so conflicted",
    "Date" : "12-04-2016, 02:03 PM",
    "User" : "HereIam",
    "Number_of_total_posts" : "228"
  }, {
    "Post" : "Originally posted by HereIam View Post\nI am conflicted because I know that Aderall is Meth and Meth is not a drug to sneeze at.\nI think what you meant to say is that you're conflicted because Adderall is an amphetamine.\nAdderal is not \"meth.\" Adderall is dextroamphetamine. \"Meth\" is short for methamphetamine which, while still an amphetamine, has a different chemical structure and is a different drug. We don't want to mislead people into thinking that Adderall is \"meth\" because they \"read it on the Internet.\"\nOriginally posted by HereIam View Post\nBTW, I have tried all of the different supplements and other natural remedies recommended by people here, and all those were was a terrible waste of money.\nYou may have tried things recommended by people here, but have you considered that there are other drugs and supplements available that haven't been recommended by people here and that there may be other possibilities that you haven't heard of or tried?\nOriginally posted by HereIam View Post\nRecently my neuro suggested Aderall, which I had tried and hated many years ago. But, since my fatigue is so much worse now, we thought it may be worth a try.\nYou also tried Concerta and Ritalin. Is there a reason why you aren't willing to try them again since your fatigue is so much worse now? Is there a particular reason why you picked only one of the three you tried before and decided that that one is your last hope?\nDoes your neuro have no more ideas?",
    "Titel" : "Aderall, so conflicted",
    "Date" : "12-04-2016, 06:56 PM",
    "User" : "jreagan70",
    "Number_of_total_posts" : "897"
  }, {
    "Post" : "J., Thank you for your thoughtful reply,\nYes, me calling Aderall Meth was a bit of a misleading statement. It's what my family calls it as a \"joke,\" albeit an inaccurate one. I must be more thoughtful when posting on a public forum. It's not my living room!\nAs for trying other supplements, I made a point of saying I'd tried many suggested HERE so as to not waste members' time writing about the list of supplements often recommended in this wonderful forum. I've tried so many things, recommended by my neurologist. Amantadine, B12, prescription Vitamin D, acupuncture, PT, gluten free diet, low carb diet (which I stick to, it's a perfect weight control diet for me) oh my gosh the list is endless. So I guess the answer is yes, I've tried many, many ways to treat this fatigue before we headed to the pharmacy shelves. My neuro is very cautious with that prescription pad of his. I also am working with my PCP, she is going over me head to toe to make sure my thyroid and other parts aren't contributing to this fatigue.\nConcerta's time release gave me really serious insomnia. Ritalin gave me wicked ugly crashes as the dose wore off. Yes, these effects may be different now because I am different now, and perhaps revisiting them will become an option if I do not adjust to Adderall.\nI've had such a wicked progression of this disease in the last year, and there is nothing to be done for those with SPMS. I used to think my fatigue was bad, a few years back. Huh, silly me, I had no idea how bad it can get, and even though it is presently crippling, I realize now that it can still get worse. Every thing has worsened over the past year. Any MS symptom you can come up with, I'm dealing with. Brain, bladder, vision, coordination, foot drop, weakness, swallowing problems, vertigo, falling, total numbness of fingers, .... and more.\nOn 1/2 dose today, I was back to my normal of crippling fatigue. And, when I compare the way I felt today to the way I felt on a full dose, I know that I must give this medication a good go. It seems to be the class of drugs that the neuro believes is necessary for me at this stage, and I must listen to him. (I go to the Partners MS Center in Boston.) So, I'm going to take the full dose every day for the next 2 weeks and reassess then. I'll stick with it no matter what the side effects may become, and see if those side effects level off at all. I really have no choice. For the past year I've been barely living.\nIf you have suggestions for me, bring 'em on. I obviously am in a very bad place right now and will remain open to all suggestions.\nThank you for your kindness!",
    "Titel" : "Aderall, so conflicted",
    "Date" : "12-04-2016, 09:05 PM",
    "User" : "HereIam",
    "Number_of_total_posts" : "228"
  }, {
    "Post" : "Here's a complication of me taking a med to increase energy levels with my advanced MS-----Yes, on Aderall I have the drive to do a bit more, although the fatigue is there in the background. So, I do more. And, I end up in so much pain I am worse off than I've ever been. I'll get all OCD at the cutting table in my sewing room and before I know it I've been standing too long and want to scream from the pain. I need to use my walker to get from the sewing room back to the living room.\nAderall makes me do more than I can do... not in a good way.\nWithout a stimulant, my body has been telling me what I can and cannot do. I can do a morning's worth of this and that. Perhaps a bit after lunch. And then my body tells me to take a nap. So I do. After that nap and dinner I can knit and watch TV, and can also rally to go out to an evening social event usually once a week.\nPerhaps the best solution is to do what my body is telling me I can do.",
    "Titel" : "Aderall, so conflicted",
    "Date" : "12-05-2016, 01:41 PM",
    "User" : "HereIam",
    "Number_of_total_posts" : "228"
  }, {
    "Post" : "Do you drink coffee/soda/anything with caffeine? That could make you more wired.\nHave you heard of nuvigil? I took it once when my other doctor didn't like stimulants. I'm not sure it helps so much with focus (or at least as effective as adderall) There's a similar medication call provigil. These are hard to get but there are always the appeals.\nIn terms of increased pain - that's bewildering and unfortunate. Sorry to hear that. Yes the adderall can make you do more which can cause pain. It can also allow you to spend countless hours reading journalists' tweets. :-) Or something else sedentary. Maybe you can find a balance between physical and then sitting down to read.\nI hope you find a regimen that helps. I could not leave the house or design and executive anything slightly challenging without it. I don't like the wired feeling though. I have high lesion load but it's more obvious in my cognitive issues.\nGood luck,\nSo",
    "Titel" : "Aderall, so conflicted",
    "Date" : "12-05-2016, 10:40 PM",
    "User" : "sardi_g",
    "Number_of_total_posts" : "258"
  }, {
    "Post" : "Hello So, and thank you for your input.\nI have cut back to one cup of coffee, trying to slow my racing heart. And, my insurance won't pay for provigil or it's sisters. I did try it, though, as my brother in law has narcolepsy and a big supply of provigil. I raced like mad with absolutely no focus. LOL. It was not pretty. He gets no racing from it, it just stops him from falling asleep at the wheel and other places. I think it's a perfect example of a drug working on a patient who has the disease it was designed to treat. People I know who have real, no bones about it, ADHD take the drugs for it with minor side effects... because they have the disease the drug was designed to treat.\nI did decide to forge ahead committed to take Aderall for two weeks straight and just push until I adjust. 7 days in, that's not feeling so good. I take 10 mg IR at 9 a.m. 1/2 hour later my heart races like a race horse (I'm 61, this is not a good feeling). It levels off a bit and I get 2 hours of focus, initiative, drive, layered on top of my deep fatigue, which does not go away. Around 2 I start to crash and it lasts for hours and is getting worse every day. Total exhaustion without being able to sleep, depressive thoughts, obsessive self-hatred thoughts. It's ugly. Some nights I sleep very poorly, some nights it feels like I didn't sleep at all, and some nights I sleep like the dead.\nThe stomach issues, headaches, blurry vision, dried up mouth, all seem like nothing compared to the crash.\nWorst of all, is I cannot urinate easily, in spite of drinking buckets of water. This is a bigger problem than all the rest, as I have a great big MS bladder problem. I told my neuro about this and his said \"Rats.\" LOL. That's what I say to everything. He pondered that unfortunately I'll probably be self-cathing after I see the urologist in 2 weeks and so it may not matter... as long as I don't get a kidney infection before then. He stated he did not prescribe the XR because he was concerned about bladder problems, and is disappointed to hear the IR has caused them anyways.\nI was believing this was like other meds, that after a while your body will adjust and the side effects will dissipate. From what I've read, that is not the case. There's a whole lotta MS peeps hating the Adderal they are tied to in order to simply get through a day. It's so unfortunate.\nI'm conflicted. I might just have to keep it on hand to use on days that are going to be big (a wedding, a travel day, etc.) and on days without it when I'm in my at home groove, just listen and respond to what my body says. And, ask the neuro about trying LDN, although I know he thinks it's not worth a try. I think when he sees I'm at the end of my rope, he may go for it.",
    "Titel" : "Aderall, so conflicted",
    "Date" : "12-07-2016, 06:53 PM",
    "User" : "HereIam",
    "Number_of_total_posts" : "228"
  }, {
    "Post" : "Hi HereIam,\nPlease check your blood pressure when using any medication for fatigue.\nThrough the years I have not had much luck taking any medication for fatigue but I tried one last time. From past experiences we decided to try Adderall first. Unrelated to MS or the use of Adderall I had 2 Dr. appointments spaced out from each other by a week.\nMy blood pressure was taken at both appointments. The first appointment my blood pressure was elevated above what is normal for me (I usually run on the lower side). It was chalked up to the appointment. My next appointment my blood pressure was at an even higher level (195/100).\nI am aware medications for fatigue can do this so I decided it wasn't worth taking it (my prescribing Dr. agreed) and stopped. We did try Provigil but the other issue that I was having is similar to yours. Neither medications helped the fatigue, in fact my fatigue increased, but I had more energy and did accomplish more. The downside? I started making more mistakes and forgetting things (a sign I was overly tired).\nI am doing what I have always done --- living my life to the best of my ability even with fatigue.",
    "Titel" : "Aderall, so conflicted",
    "Date" : "12-08-2016, 07:58 AM",
    "User" : "SNOOPY",
    "Number_of_total_posts" : "4237"
  }, {
    "Post" : "Originally posted by HereIam View Post\n1/2 hour later my heart races like a race horse...I start to crash and it lasts for hours and is getting worse every day. Total exhaustion without being able to sleep, depressive thoughts, obsessive self-hatred thoughts. ... The stomach issues, headaches, blurry vision, dried up mouth, all seem like nothing compared to the crash. ... I cannot urinate easily ... I'm conflicted.\nFaced with doing serious harm to yourself, it's not understandable why you're conflicted. It's pretty clear to anyone whose view isn't distorted by being in your position that none of what you're describing is worth wrecking your health over. Seriously, triggering obsessive self-hatred thoughts just so you can sew for two hours? There's no conflict -- nothing is worth sacrificing your health and happiness.\nOriginally posted by HereIam View Post\nAnd, ask the neuro about trying LDN, although I know he thinks it's not worth a try. I think when he sees I'm at the end of my rope, he may go for it.\nFor you, it probably is worth trying. The top MS specialist in my region at my HMO told me she prescribes it for her patients. Not because it does anything for MS, but because it seems to give them a sense of well-being with few, if any, side effects. That might help you to cope better with your fatigue. I wish you luck -- I hope he does prescribe it for you and that you do well with it.",
    "Titel" : "Aderall, so conflicted",
    "Date" : "12-09-2016, 05:32 AM",
    "User" : "jreagan70",
    "Number_of_total_posts" : "897"
  }, {
    "Post" : "While it's be maybe 10 years, I have tried adderal and provigil. I took provigil for I think maybe 3-4 months. It gave me what I call a fake awake. No energy really just wired but a tired wired. Like I was awake 18 hours and just downed 3 coffees. It also interacted with my birth control so I had to stop taking it. I then tried adderal. I was so high I felt I could rule the world. No extra energy just determination I could do anything....until the crash...then I couldn't do a thing and I was so down in the dumps. Now I know why people take it recreationally but the crash is too depressing to make it worthwhile.\nI totally can get what you are going through. The drug allows you to ignore your body only to pay the price later. High highs then low lows. I couldn't handle the rollercoaster. The highs were not worth the consequences. So I say dump it. Or see if there are more controlled released versions so maybe instead of giving you the drive to sew for 4 hrs you can only do 2 in the am and 2 in the PM. I've recently begun researching ADHD drugs for my daughters impending diagnosis and was surprised all the different stimulants there are now that have slower more controlled releases.\nI think your asking because you know what you should do but feel you are betraying \"what ifs\" if you give it up. Go with your gut.",
    "Titel" : "Aderall, so conflicted",
    "Date" : "12-10-2016, 09:46 PM",
    "User" : "carriefromMI",
    "Number_of_total_posts" : "59"
  }, {
    "Post" : "Aderol-my experience\nI have had a similar background with the \"ever increasing\" fatigue throughout the years. In the past, I tried everything that has been mentioned (provigil, nuvigel, Ritalin, several others, including aderol. Like you describe now, none worked and they made me too jittery. So, after many many trials, I just stopped trying to help my fatigue. About 5 years passed and my fatigue had become completely debilitating. I was at the point of not being able to function and as we know, the quality of life keeps decreasing, as more functionality that is lost. So my Dr and I revisited it.\nI tried aderol for the second time. It did take a couple weeks or so to adjust, but I don't have the jittery side effects that I had 5 years ago with the first try. I also have insomnia (have had for 16 years), so I was scared it would keep me up. My Ms Specialist prescribed 10mg aderol twice a day and told me to NOT take the second dose after 3 so it would reduce chances of effecting sleep.\nAt first, I tried just taking the morning 10mg dose, but like you mentioned, the crash comes unforgivingly around mid afternoon and my fatigue was worse than even imaginable!\nI wasn't sure about taking it at all for these reasons, and I knew a second 10 mg dose would keep me up at night. So, I tried taking 1/2 tablet at 2:30-3 pm and it is working out very well now (for about 3 months now). My fatigue is still worse in the afternoon and evening (compared to mornings), but it's ok with me to ensure I don't stay awake all night. I have to set my phone alarm for my 5mg dose in afternoon because if I forget it, I just can't function at all afternoons/evening. And, I absolutely will NOT take the medicine after 3! If I forget it, (and I have, despite turning my alarm off), I just make it through to the next day and accept my worsened condition.\nThis is just my experience and I know everyone is different. My b/p has always been very good thankfully, and the aderol did not effect that.\nIt is helping me, esp in mornings, to at least get some basic things done. To me, it is more depressing to only be able to lay on couch or bed for biggest % of day. And that's how bad it was getting for me as well. For me, the inability to get anything done effected my sense of self worth greatly. So, I'm lucky that for now, it is helping me.\nI hope you find the right solution that will help you and improve your quality of life. And, just because it is working for me at the present, we never know what our next days will be like, so I, too, try to just do the best I can each day. My faith in God has been a huge factor in getting me through difficult times!! Best of wishes to you.",
    "Titel" : "Aderall, so conflicted",
    "Date" : "12-12-2016, 08:22 PM",
    "User" : "marie24",
    "Number_of_total_posts" : "11"
  }, {
    "Post" : "Hi Marie and thank you for sharing your experience. It certainly is worthwhile to retry a med that may have been difficult in years gone by. As this disease worsens, the effect of drugs can change.\nI had tried Adderall in 2012 and that was a disaster but I tried again because I am at that point where I am debilitated by fatigue and also by pain. I thought my fatigue was bad in 2012, silly me.\nI came back to finish my story, as I started this thread and wanted to finish it in case people look to it for advice. I'm glad you added your story.\nI kept trying. Taking 5 mg morning, 5 mg at 1 or 10 mg morning, 5 mg mid day.\nI did this for a month. I had to stop for two reasons: the crash did not lighten, it seemed to only get worse. Depression unlike anything I have ever known. And, the second thing was a big surprise to me: Heartburn. Like the depression, unlike any I have ever known. The neuro had me taking double doses of Nexium and others 2 x a day. No coffee, tea, chocolate, tomatoes, etc. The heartburn just did not stop. It was horrid and the neuro decided it may be related to my difficulty swallowing, which often leaves traces of food in my throat. I do tend to get heartburn easily anyhow. So, I drank buckets of water to wash everything down.... which of course filled my gut too much and increased reflux. I was caught in a terrible circle. I kept trying. I had swallowing studies and a scope done of my esophagus, which showed I was developing Barrett's esophagus from all of this madness. So, that was that.\nWhen on Adderall, I never really felt energized, I just felt exhausted but able to do things. And, I could not nap because of the Adderall buzz, even though I felt drained. And, because I could do more, my pain increased.\nSuch a tangled web.\nThis med is so useful for so many people, but I'm not one of them. I'd encourage people suffering from fatigue to try it. You just never know what med will agree with you and which will not, until you try.",
    "Titel" : "Aderall, so conflicted",
    "Date" : "01-07-2017, 02:57 PM",
    "User" : "HereIam",
    "Number_of_total_posts" : "228"
  }, {
    "Post" : "Hello fellow MSers\nI have my new ampyra prescription and I am wondering with the seizure risk should I be safe starting this med while caring for my grandbaby? How long will it take before I am out of the woods so to say with the seizure risk? I fear something happening while I care for her.\nthank you!",
    "Titel" : "Scared to start Ampyra while careing for baby",
    "Date" : "11-16-2016, 04:02 PM",
    "User" : "BDOBBINS",
    "Number_of_total_posts" : "36"
  }, {
    "Post" : "Hi BDOBBINS,\nI'm wondering if you have talked to prescribing Dr. about this and what risks did s/he say?\nHere's what the FDA says:\nThe U.S. Food and Drug Administration (FDA) is updating health care professionals and the public about the risk of seizures in patients with multiple sclerosis (MS) who are starting Ampyra (dalfampridine). Using information received from post-market adverse event reports, FDA recently evaluated seizure risk in MS patients taking Ampyra (dalfampridine). The majority of seizures happened within days to weeks after starting the recommended dose and occurred in patients having no history of seizures.\nIn addition, FDA is updating the Ampyra drug label to clarify recommendations that kidney function should be checked in patients before starting Ampyra and monitored at least annually while Ampyra treatment continues. Additionally, patients who miss a dose should not take extra doses—an extra dose of Ampyra can increase seizure risk.\nhttp://www.fda.gov/Drugs/DrugSafety/ucm312846.htm\nSometimes I help babysit my grandchild along with her other grandma and I can understand your concern. If your grandchild is old enough to call 911 on their own just in case you do have a seizure, you can be better equipped and somewhat more confident in babysitting alone.\nI took Ampyra awhile back for 6 months. It didn't help my walking at all, so I quit. I never had a seizure, but we are all different! Please don't take any others experience as guidance, and talk with your Dr.\nI hope you can work this all out. Maybe have another adult with you to help babysit while you start Ampyra? Best of luck.",
    "Titel" : "Scared to start Ampyra while careing for baby",
    "Date" : "11-16-2016, 05:02 PM",
    "User" : "Seasha",
    "Number_of_total_posts" : "4492"
  }, {
    "Post" : "On this for over a year, no seizures nor any side effects,\nGood luck",
    "Titel" : "Scared to start Ampyra while careing for baby",
    "Date" : "11-17-2016, 09:24 PM",
    "User" : "jlk9498",
    "Number_of_total_posts" : "92"
  }, {
    "Post" : "http://www.medday-pharma.com/news-an...erosis-at-aan/",
    "Titel" : "New results -high dose biotin",
    "Date" : "04-24-2016, 01:40 AM",
    "User" : "AP",
    "Number_of_total_posts" : "6"
  }, {
    "Post" : "my fingers are crossed! Thank you for this info.",
    "Titel" : "New results -high dose biotin",
    "Date" : "04-24-2016, 09:49 AM",
    "User" : "hunterd",
    "Number_of_total_posts" : "3099"
  }, {
    "Post" : "cautiously optimistic\nYes, my fingers crossed too! My UCSF doctor has been awaiting these results so I will check in with her re results. I have PPMS with walking getting more difficult though no active disease past 5 years (no inflammation on MRIs)...from reading the study sounds like this group of us may see some benefit. Stay tuned!",
    "Titel" : "New results -high dose biotin",
    "Date" : "04-26-2016, 11:17 PM",
    "User" : "AP",
    "Number_of_total_posts" : "6"
  }, {
    "Post" : "I was on 300mg of Biotin for about 8 months and saw no improvements. In fact, I just started progressing even more.",
    "Titel" : "New results -high dose biotin",
    "Date" : "05-11-2016, 06:41 AM",
    "User" : "Dreams008",
    "Number_of_total_posts" : "116"
  }, {
    "Post" : "I reckon Biotin works well to be honest. Feel there has been improvement. Would rather take Biotin than Gilenya, trying Tysabri now but Biotin has been great.",
    "Titel" : "New results -high dose biotin",
    "Date" : "05-17-2016, 01:47 AM",
    "User" : "reasonable",
    "Number_of_total_posts" : "22"
  }, {
    "Post" : "Thanks for the article AP.\nIf I understand it correctly (read it a couple of times), MD 1003 Biotin has been shown to be very effective in treating progressive MS, without active relapses.\nI'm pretty sure that the results are from the Phase III clinical trials, shown to be both a safe and effective treatment.\nSo.......anyone know what is next step for this to be available for us? Seems like it should get through quickly?\nI do take biotin, which is included with my B-Complex, but is only a 300 mcg dosage. MD 1003 is 300 mg, which is 1000X what I am taking.\nTake Care",
    "Titel" : "New results -high dose biotin",
    "Date" : "05-23-2016, 03:38 PM",
    "User" : "KoKo",
    "Number_of_total_posts" : "4556"
  }, {
    "Post" : "my doctor told me that she would be more than happy to write me a prescription for it, but the insurance company denied it. the phase 3 trial was not completed yet. I will trying again.",
    "Titel" : "New results -high dose biotin",
    "Date" : "05-23-2016, 09:39 PM",
    "User" : "hunterd",
    "Number_of_total_posts" : "3099"
  }, {
    "Post" : "Originally posted by hunterd View Post\nmy doctor told me that she would be more than happy to write me a prescription for it, but the insurance company denied it. the phase 3 trial was not completed yet. I will trying again.\nOk, thanks Dave.",
    "Titel" : "New results -high dose biotin",
    "Date" : "05-24-2016, 09:59 PM",
    "User" : "KoKo",
    "Number_of_total_posts" : "4556"
  }, {
    "Post" : "My doctor also wrote a script for it, but you don't actually need a script for this. And I found a source for $45/month's supply. I'm pretty sure a link won't survive moderation, but there's a biotin for progressive MS group on Facebook where you can find these suppliers. If you can afford it, I can't think of one rational reason not to do it. Especially since we have nothing else.",
    "Titel" : "New results -high dose biotin",
    "Date" : "05-25-2016, 09:51 PM",
    "User" : "J-Bo",
    "Number_of_total_posts" : "422"
  }, {
    "Post" : "Originally posted by hunterd View Post\nmy doctor told me that she would be more than happy to write me a prescription for it, but the insurance company denied it. the phase 3 trial was not completed yet. I will trying again.\nHey there. I can tell you from my work experience that most insurance companies do not cover this because Biotin is actually an Over-The-Counter medication, even if done as a prescription item.",
    "Titel" : "New results -high dose biotin",
    "Date" : "08-15-2016, 03:33 PM",
    "User" : "LuNap",
    "Number_of_total_posts" : "2"
  }, {
    "Post" : "hi all,\nI tried it for 6 weeks. 100mg x3 daily. compounded by good pharmacy. my energy was better, and I could sleep thru the night, without getting up to pee. infact my bladder became normal. after 4 weeks I started getting weakness when lifting my foot. I stopped and called my ms dr.. I am going to restart in a couple weeks. my doc is going to have me take 50mg x6 daily, to give me a better response. questions have been raised as to whether medday is using a extended release formula. I am ppms and 66 year old.",
    "Titel" : "New results -high dose biotin",
    "Date" : "09-20-2016, 06:34 PM",
    "User" : "barryrado",
    "Number_of_total_posts" : "77"
  }, {
    "Post" : "Originally posted by barryrado View Post\nhi all,\nI tried it for 6 weeks. 100mg x3 daily. compounded by good pharmacy. my energy was better, and I could sleep thru the night, without getting up to pee. infact my bladder became normal. after 4 weeks I started getting weakness when lifting my foot. I stopped and called my ms dr.. I am going to restart in a couple weeks. my doc is going to have me take 50mg x6 daily, to give me a better response. questions have been raised as to whether medday is using a extended release formula. I am ppms and 66 year old.\nBarry Thanks for the update.\nIncreased energy, good sleep, and normal bladder sounds fantastic.\nBest of luck to you when you restart the 50mg 6X daily, and let us know how it goes.\nTake Care",
    "Titel" : "New results -high dose biotin",
    "Date" : "09-20-2016, 08:51 PM",
    "User" : "KoKo",
    "Number_of_total_posts" : "4556"
  }, {
    "Post" : "Originally posted by barryrado View Post\nquestions have been raised as to whether medday is using a extended release formula.\nThat's the obvious question, because an extended release formula is the difference that will allow MedDay to patent high-dose biotin and enable them to have it approved (at least in the US) as a prescription drug. Otherwise it's just another OTC nutrition supplement that other companies can provide more cheaply. And they certainly didn't go to all this trouble and expense to allow anyone else to make money from it.",
    "Titel" : "New results -high dose biotin",
    "Date" : "09-20-2016, 11:47 PM",
    "User" : "jreagan70",
    "Number_of_total_posts" : "897"
  }, {
    "Post" : "Right Level?\nSo, I have been taking 100mg per day for about a year.\nMy last blood test included a test for Biotin.\nThe level was >3600pg/ml, against a reference range of 221 - 3004.\nDoc said to cut back on my dosage.\nIs there a consensus/opinion regarding 'ideal' level in this study?",
    "Titel" : "New results -high dose biotin",
    "Date" : "09-21-2016, 04:41 PM",
    "User" : "jumangi",
    "Number_of_total_posts" : "43"
  }, {
    "Post" : "Originally posted by J-Bo View Post\nMy doctor also wrote a script for it, but you don't actually need a script for this. And I found a source for $45/month's supply. I'm pretty sure a link won't survive moderation, but there's a biotin for progressive MS group on Facebook where you can find these suppliers. If you can afford it, I can't think of one rational reason not to do it. Especially since we have nothing else.\nHey J-Bo where did you find biotin for $45 a month?\nThanks",
    "Titel" : "New results -high dose biotin",
    "Date" : "10-31-2016, 05:44 PM",
    "User" : "04blackcobra",
    "Number_of_total_posts" : "108"
  }, {
    "Post" : "Hi blackcobra,\nI was getting it from Metabiome. To get the $45/90 count 100 mg, you have to purchase six bottles, or a six-month supply. I am now getting it for even less (I think $40) from a brick and mortar compounding pharmacy. My neuro wrote a script and sent it to them. I would give you their name, but they don't sell online. :-( They are near Cleveland, OH.\nHope this helps. - Joan",
    "Titel" : "New results -high dose biotin",
    "Date" : "11-01-2016, 09:08 AM",
    "User" : "J-Bo",
    "Number_of_total_posts" : "422"
  }, {
    "Post" : "From MedPage\nhttp://www.medpagetoday.com/MeetingC...20283d0r&pos=3",
    "Titel" : "Ampyra trial bolsters efficacy claims",
    "Date" : "09-20-2016, 10:56 AM",
    "User" : "ru4cats",
    "Number_of_total_posts" : "888"
  }, {
    "Post" : "I'm not sure if it must be taken 2x a day. It has helped with my strength, my walking speed is significantly better (my physical therapist says it is, too) but I really do think this might be due, at least in part, to an awful, months long relapse finally calming down.\nI was diagnosed in March, had 2 rounds of solumedrol (which maybe made me a little worse for a month or two), and am going for my 3rd tysabri infusion Friday. I still have pretty bad gait and balance issues, which my dr thinks are due to spasms, and tremor. He really wants me to take baclofen, but it makes me way too sleepy and I think it makes my tremor and balance worse. I'm taking clonazepam for the tremor, and it does help a lot, but I hate the idea that it's an addictive drug. And if I take the baclofen too, the tremor comes back.\nAnyway, I think maybe the ampyra 2x a day makes my balance worse, too. I forgot evening doses a few times and I really seemed to be better off the next day. I'm really too skinny (I weigh maybe 104-105 lbs, I'm 5'2) so maybe it's just too much for me?\nAnyway, I know this whole post is crazy, I'm sorry for that. I'm just trying to figure out what to do. Does ampyra HAVE to be taken 2 times a day for any benefit? Is it one of those meds that have to stay constant in your system for any help or can it be taken once a day every day?\nI will ask the neurologist Friday, but I just wondered if anyone here had similar issues? Thanks for any help, ideas, info or advice.",
    "Titel" : "Does anyone take ampyra only once a day?",
    "Date" : "08-16-2016, 12:38 PM",
    "User" : "Sendsun",
    "Number_of_total_posts" : "3"
  }, {
    "Post" : "Hello\nYes Ampyra was doing good for me but the full dose of two pills a day was also giving me balance issues and You can't split those pill.\nSo my Dr gave me 4amino, 4 pills of 4.5 mg ( the same that Ampyra but only $60!!)\nAnd I can take only 3/4 of the dose. Two on the morning and one at nite.\nFor me I did have to stay on 1/2 dose for several weeks before take more.\nI have been on for 9 months now and may try again the full dose again.\nWe are all different so we have try and error.\nGood luck.",
    "Titel" : "Does anyone take ampyra only once a day?",
    "Date" : "08-17-2016, 04:33 PM",
    "User" : "penkalet",
    "Number_of_total_posts" : "85"
  }, {
    "Post" : "I took Ampyra twice a day for about three years but when I started having a lot of trouble sleeping at night I switched to once a day. My doctor was okay with that. And it really helps keep me walking. The once a day was great. I think it's okay to do.\nLast week though I started having myoclonic seizures. So no more Ampyra ever for me. Not sure if they are from the Ampyra or MS yet. Either way it stinks because without Ampyra I'm worried I won't be able to work. Out on leave now because of seizures but hope to get back.",
    "Titel" : "Does anyone take ampyra only once a day?",
    "Date" : "08-24-2016, 07:33 PM",
    "User" : "AriD",
    "Number_of_total_posts" : "351"
  }, {
    "Post" : "Sendsun,\nI have been taking Ampyra for six years, but since I will be going on Medicare in February and losing my $40 a month copay, I have decided to try 4-AP to see if the results are the same. I just received my 1st order from Skips Pharmacy in Florida, and 120, 5mg caps were $40 + $6.95 shipping. I found a \"ramp up\" routine online and will begin tomorrow. I can see how this would really help you, since you can determine how much you need and when. I'd consider asking your neurologist to fax them a prescription and give 4-AP a try.",
    "Titel" : "Does anyone take ampyra only once a day?",
    "Date" : "08-26-2016, 02:06 PM",
    "User" : "ru4cats",
    "Number_of_total_posts" : "888"
  }, {
    "Post" : "So I was put on Gabapetin for pain..thru the be told it is working really well for me after a week of not working😊 my pain areas are now a 1 on the pain scale, my anxiety issues are nonexistent, and I feel like I am communicating more articulate. Only problem is that I am never tired..I mean never...I guess in writing this it means I am not fatigued which,as you know is a favorite side effect. Anyone experience this? Any suggestions on how to get to sleep...I am staying up till 6am and waking up at 9am...for a week and I not tired.",
    "Titel" : "Gabapentin and not sleeping?",
    "Date" : "07-19-2016, 01:04 PM",
    "User" : "Don2480",
    "Number_of_total_posts" : "131"
  }, {
    "Post" : "Hi Don2480,\nIt is very possible you are having a Paradoxical side effect/reaction. In your case the medication is causing insomnia instead of fatigue. It would be best to report this to your Dr.",
    "Titel" : "Gabapentin and not sleeping?",
    "Date" : "07-19-2016, 01:46 PM",
    "User" : "SNOOPY",
    "Number_of_total_posts" : "4237"
  }, {
    "Post" : "Originally posted by SNOOPY View Post\nHi Don2480,\nIt is very possible you are having a Paradoxical side effect/reaction. In your case the medication is causing insomnia instead of fatigue. It would be best to report this to your Dr.\nSo I know what paradoxical means but would you be under the mindset that it is a dangerous reaction?",
    "Titel" : "Gabapentin and not sleeping?",
    "Date" : "07-20-2016, 11:20 AM",
    "User" : "Don2480",
    "Number_of_total_posts" : "131"
  }, {
    "Post" : "timing\nHi i also take gabopentin for pain and have trouble sleeping but i get 6-7 hrs a night ,,I take my last gabo at 7 pm with a muscle relaxer then at 9 PM I take a tylenol PM usually can sleep by 10 or 11 .. Another thing is get allot of exercise each day even if exercise brings on pain it has to be done .\nGood Luck",
    "Titel" : "Gabapentin and not sleeping?",
    "Date" : "07-22-2016, 07:07 PM",
    "User" : "limppy",
    "Number_of_total_posts" : "95"
  }, {
    "Post" : "Provigil is no longer working for me.\nI was wondering what EVERYONE has tried and takes, for fatigue.\nRing in with your thoughts and med/non-med treatment.",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "04-21-2014, 04:03 PM",
    "User" : "fishead",
    "Number_of_total_posts" : "1171"
  }, {
    "Post" : "Non med\nMy fatigue is like clock work, when I wake up at 5am ish it comes just after 3pm. I'm home by 3:15 ish so I just take a nap. I was dx July 2013, I have the fatigue forced nap for 2 to 3 years now.\nGood luck, I'm just so glad it happens when I can be home.",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "04-21-2014, 05:23 PM",
    "User" : "Queen Lavee",
    "Number_of_total_posts" : "112"
  }, {
    "Post" : "I'm same way! But some days its all day! Have same schedule as you! On symmtral spelling sorry. Same as yours and it sucks! Messes with my stomach and moods!",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "04-21-2014, 06:35 PM",
    "User" : "Jamie1992",
    "Number_of_total_posts" : "2"
  }, {
    "Post" : "Provigil is not working for me anymore, either. I have to take 350 mg to get through the workday....and I am only prescribed 200 mg (90-day supply). I have talked to my neuro, so she is aware.....but I'm afraid of what will happen once the supply runs out and they won't refill until the date insurance will cover.\nI want to sleep all the time on the weekends....someone once said it feels like \"gravity is not my friend\", and taking a quick nap like so many suggest will help just won't cut it. I know they mean well, but they don't understand.....",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "04-21-2014, 09:46 PM",
    "User" : "swpanther1",
    "Number_of_total_posts" : "101"
  }, {
    "Post" : "I'm tired all day, everyday regardless of how much sleep I get. I was on Provigil and after about 5 years I felt it was it was no longer working. So, I asked my neuro if I could try other drugs to see if they worked better. I settled on the generic of Adderall (10 mg) because it's cheap. It works the same way as Ritalin did for me.\nI take it twice a day rather than the extended release that is taken once a day.",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "05-03-2014, 08:04 AM",
    "User" : "lorib",
    "Number_of_total_posts" : "212"
  }, {
    "Post" : "It will be rare that you ever find a MSer who takes LDN that complains of fatigue and the drug is actually used to treat Chronic Fatigue Syndrome.\nThe reason LDN works is that it generates a 2-300% increase in Endorphins the day after you take it and most people don't get tired during an Endorphin rush.\nTwo inexpensive supplements worth considering for MS-related fatigue are Alpha Lipoic Acid and Malic Acid\nAlpha Lipoic Acid helps your body efficiently turn food energy into cellular energy. It helps prevent cancer and is even in clinical trial now for SPMS as it is believed to prevent myelin damage.\nMalic Acid has been shown to effectively reduce fatigue in Fibromyalgia, Psoriasis and CFS patients.\nI take all three: LDN, Alpha Lipoic Acid and Malic Acid. 300mg ALA at each meal along with 600mg Malic Acid.\nI'm never really tired and havn't so much as taken a nap in five years. A lot of this I accredit to the LDN and you'll need a prescription for that. The ALA and Malic Acid are less than $5 a bottle.",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "05-03-2014, 12:14 PM",
    "User" : "knuckle",
    "Number_of_total_posts" : "658"
  }, {
    "Post" : "Nuvigil\nOriginally posted by lorib View Post\nI'm tired all day, everyday regardless of how much sleep I get. I was on Provigil and after about 5 years I felt it was it was no longer working. So, I asked my neuro if I could try other drugs to see if they worked better. I settled on the generic of Adderall (10 mg) because it's cheap. It works the same way as Ritalin did for me.\nI take it twice a day rather than the extended release that is taken once a day.\nI take Nuvigil which is the newest version of the Provigil. Like you, I am not getting the relief I once did. My neuro has never mentioned taking Ritalin or any of those type drugs.\nI also can't fall asleep which is pretty strange when you think of how tired I am. I take Amytriptilene. I feel as though I can't get to sleep or wake up without drugs!!!\nThe tiredness, fatigue is the worst of my symptoms aside from my neuropathy.\nMS is the pits.\nDiane",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "05-03-2014, 05:22 PM",
    "User" : "DianeD",
    "Number_of_total_posts" : "984"
  }, {
    "Post" : "Thanks for the replies.\nThink I may try Adderall.",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "05-04-2014, 01:24 PM",
    "User" : "fishead",
    "Number_of_total_posts" : "1171"
  }, {
    "Post" : "My fatigue is not the sleepy kind that I read about from a lot of you. My fatigue is that is takes so much energy to make my arms and legs do what I want them to do. I don't have to take a nap but sitting down and resting is a must.",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "07-22-2014, 10:34 AM",
    "User" : "webbles989898",
    "Number_of_total_posts" : "2"
  }, {
    "Post" : "Originally posted by webbles989898 View Post\nMy fatigue is not the sleepy kind that I read about from a lot of you. My fatigue is that is takes so much energy to make my arms and legs do what I want them to do. I don't have to take a nap but sitting down and resting is a must.\nYeah that's more how I feel. I would like to sleep more but when I lay down I can't and also laying down causes more pain then sitting so I normally curl up in a comfy chair and watch tv, surf the web or even just stare at the wall.\nI don't take any prescription meds for sleep or energy. I sometimes take over the counter sleeping pills to get to sleep. For energy during the day I take caffein pills and drink energy drinks that contain Taurine.\nI did try Amitriptyline before but it did not agree with me or work for me.",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "07-22-2014, 12:29 PM",
    "User" : "Dale76",
    "Number_of_total_posts" : "213"
  }, {
    "Post" : "Originally posted by Dale76 View Post\n,,,or even just stare at the wall.\nOMG, I sit and just \"stare at the wall/other things\" TOO!!! Did not know I wasn't unique to this.\n\"Staring at the wall\" is VERY comforting to me.\nPlease share, if you \"stare\"! How you feel about it? Does it \"do\" anything for you?",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "07-22-2014, 03:31 PM",
    "User" : "fishead",
    "Number_of_total_posts" : "1171"
  }, {
    "Post" : "Originally posted by Queen Lavee View Post\nMy fatigue is like clock work, when I wake up at 5am ish it comes just after 3pm. I'm home by 3:15 ish so I just take a nap. I was dx July 2013, I have the fatigue forced nap for 2 to 3 years now.\nGood luck, I'm just so glad it happens when I can be home.\nWe have a similar situation and I'm very thankful also that it happens when all my work is done and I'm already at home.",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "07-30-2014, 05:09 AM",
    "User" : "Betsy Frank",
    "Number_of_total_posts" : "5"
  }, {
    "Post" : "Originally posted by knuckle View Post\nIt will be rare that you ever find a MSer who takes LDN that complains of fatigue and the drug is actually used to treat Chronic Fatigue Syndrome.\nWhat is LDN?",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "08-01-2014, 11:36 AM",
    "User" : "amyrising",
    "Number_of_total_posts" : "245"
  }, {
    "Post" : "Originally posted by knuckle View Post\nIt will be rare that you ever find a MSer who takes LDN that complains of fatigue and the drug is actually used to treat Chronic Fatigue Syndrome.\nThe reason LDN works is that it generates a 2-300% increase in Endorphins the day after you take it and most people don't get tired during an Endorphin rush.\nTwo inexpensive supplements worth considering for MS-related fatigue are Alpha Lipoic Acid and Malic Acid\nAlpha Lipoic Acid helps your body efficiently turn food energy into cellular energy. It helps prevent cancer and is even in clinical trial now for SPMS as it is believed to prevent myelin damage.\nMalic Acid has been shown to effectively reduce fatigue in Fibromyalgia, Psoriasis and CFS patients.\nI take all three: LDN, Alpha Lipoic Acid and Malic Acid. 300mg ALA at each meal along with 600mg Malic Acid.\nI'm never really tired and havn't so much as taken a nap in five years. A lot of this I accredit to the LDN and you'll need a prescription for that. The ALA and Malic Acid are less than $5 a bottle.\nKnuckle; my neuro said she would RX LDN but I keep holding off... I read about it and it seems the right course; if you could PM me your experience it would be appreciated\nJ",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "08-02-2014, 12:24 AM",
    "User" : "justacowgirl",
    "Number_of_total_posts" : "686"
  }, {
    "Post" : "LDN is...\nLow Dose Naltrexone. I've been on it for about 18 months now and love it!! I don't know the link policy here but you can google it. You need a prescription and some doctors are iffy about it but worth a try.",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "08-02-2014, 12:55 AM",
    "User" : "October22",
    "Number_of_total_posts" : "132"
  }, {
    "Post" : "I &lt;3 LDN\nI take LDN and Wellbutrin SR for fatigue. They work wonderfully for me. The first time I heard of LDN for MS was in an \"Ask Dr.Gott\" column in the local news paper. I researched it and went on the adventure to get it.",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "08-03-2014, 09:51 AM",
    "User" : "KateM",
    "Number_of_total_posts" : "60"
  }, {
    "Post" : "you can find a lot of information here, http://www.msworld.org/forum/showthread.php?t=115804",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "08-03-2014, 01:16 PM",
    "User" : "hunterd",
    "Number_of_total_posts" : "3099"
  }, {
    "Post" : "We are very much alike\nOriginally posted by Dale76 View Post\nYeah that's more how I feel. I would like to sleep more but when I lay down I can't and also laying down causes more pain then sitting so I normally curl up in a comfy chair and watch tv, surf the web or even just stare at the wall.\nI don't take any prescription meds for sleep or energy. I sometimes take over the counter sleeping pills to get to sleep. For energy during the day I take caffein pills and drink energy drinks that contain Taurine.\nI had to laugh out loud when I read your post. I have the same type of fatigue and my recliner is my best friend. I rejuvenate in spurts.\nMy neuro could not prescribe a drug that my insurance covered so for now I'm stuck with no meds for fatigue. (Now I need to ask him about these other drugs Zi see in this thread.) On top of that I now take anti-anxiety meds which do make me sleepy.\nMy son woke up and came by my bedside to greet me. He asked, \"mom, why do you always have that face in the morning?\" I said, \"what face?\" He said, \"you're just staring at the wall and not saying anything!\"\nWow, I do that a lot. Lol.",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "08-04-2014, 01:18 AM",
    "User" : "WithGrace",
    "Number_of_total_posts" : "20"
  }, {
    "Post" : "Fatigue\nOriginally posted by fishead View Post\nProvigil is no longer working for me.\nI was wondering what EVERYONE has tried and takes, for fatigue.\nRing in with your thoughts and med/non-med treatment.\nI take Nuvigil; it is the newer version of Provigil. Ask about taking that. I'm think I'm going to look into the LDN which was suggested here. Got to keep trying.\nDiane",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "08-17-2014, 11:32 PM",
    "User" : "DianeD",
    "Number_of_total_posts" : "984"
  }, {
    "Post" : "ALL FATIGUE TREATMENTS\nI take Provigil at 200 mg 3 times a day in addition to Adderrall. Some years ago I tried the Nuvigil but apparently it didn't work for me as I switched back to provigil. This med has been a life saver for me, my brain cannot function without it. Although I get my sleep, if I don't have my meds, its like sleep deprivation for me.",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "08-18-2014, 04:09 PM",
    "User" : "txgirl57",
    "Number_of_total_posts" : "6"
  }, {
    "Post" : "Originally posted by knuckle View Post\nIt will be rare that you ever find a MSer who takes LDN that complains of fatigue and the drug is actually used to treat Chronic Fatigue Syndrome.\nThe reason LDN works is that it generates a 2-300% increase in Endorphins the day after you take it and most people don't get tired during an Endorphin rush.\nTwo inexpensive supplements worth considering for MS-related fatigue are Alpha Lipoic Acid and Malic Acid\nAlpha Lipoic Acid helps your body efficiently turn food energy into cellular energy. It helps prevent cancer and is even in clinical trial now for SPMS as it is believed to prevent myelin damage.\nMalic Acid has been shown to effectively reduce fatigue in Fibromyalgia, Psoriasis and CFS patients.\nI take all three: LDN, Alpha Lipoic Acid and Malic Acid. 300mg ALA at each meal along with 600mg Malic Acid.\nI'm never really tired and havn't so much as taken a nap in five years. A lot of this I accredit to the LDN and you'll need a prescription for that. The ALA and Malic Acid are less than $5 a bottle.\nPulling up an older post. Can you tell me what LDN is??",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "10-10-2014, 06:53 PM",
    "User" : "marti",
    "Number_of_total_posts" : "1885"
  }, {
    "Post" : "Hi Marti,\nLDN stands for Low Dose Naltrexone. You can learn more about it here:\nhttp://www.msfocus.org/article-detai...?articleID=810\nhttp://www.nationalmssociety.org/Tre...ose-Naltrexone",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "10-10-2014, 09:11 PM",
    "User" : "Kimba22",
    "Number_of_total_posts" : "1636"
  }, {
    "Post" : "Originally posted by DianeD View Post\nI take Nuvigil; it is the newer version of Provigil. Ask about taking that. I'm think I'm going to look into the LDN which was suggested here. Got to keep trying.\nDiane\nI'm is the same boat as Provigil for MS Fatigue is 200mg maximum due to UK guidelines Grrrrrrrrr!\nI am researching Nuvigil as an alternative and will be fighting to have it prescribed.\nI tried Gabapentin - not much good - the was prescribed the newer version Lyrica - result!!\nHoping that Nuvigil will prove as helpful for me.",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "06-24-2015, 05:28 PM",
    "User" : "MrsChip",
    "Number_of_total_posts" : "181"
  }, {
    "Post" : "LDN\nWill your neuro prescribe LDN? I've heard that there are very few doctors that will prescribe it. That's unfortunate as I've also heard that is very effective for MS fatigue.",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "06-26-2015, 07:55 AM",
    "User" : "its2much",
    "Number_of_total_posts" : "819"
  }, {
    "Post" : "LDN is short for Low Dose Naltrexone which in its standard dose is 50 mg and is usually prescribed as an opiate antagonist. I am not a doctor and I learned about this compounded drug through several websites. Knuckle , on this board, has posted about this drug many times. I have been taking it for several years. There is a lot to learn about prescribing and treating with this drug. I hope that you can find a doctor to prescribe it for you. Good luck",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "06-26-2015, 04:21 PM",
    "User" : "JerryD",
    "Number_of_total_posts" : "3045"
  }, {
    "Post" : "This sounds SO much like my life its eerie DianeD !!!\nOriginally posted by DianeD View Post\nI take Nuvigil which is the newest version of the Provigil. Like you, I am not getting the relief I once did. My neuro has never mentioned taking Ritalin or any of those type drugs.\nI also can't fall asleep which is pretty strange when you think of how tired I am. I take Amytriptilene. I feel as though I can't get to sleep or wake up without drugs!!!\nThe tiredness, fatigue is the worst of my symptoms aside from my neuropathy.\nMS is the pits.\nDiane\nIt feels so wrong to need drugs to sleep and to wake up, but that's the story of my life too Diane!",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "07-19-2015, 11:43 AM",
    "User" : "MrsChip",
    "Number_of_total_posts" : "181"
  }, {
    "Post" : "I take modafinil ( provigil) 200 mg every morning. Helped a lot first few months, now not so much. My neuro says to take another 100 mg in afternoon but my pcp thinks that's too much.",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "07-19-2015, 11:39 PM",
    "User" : "AriD",
    "Number_of_total_posts" : "351"
  }, {
    "Post" : "Try switching to Nuvigil\nFor me, Novigil definitely works better.\nI was on Provigil at first, then went to Nuvigil 250 mg every morning. After a couple years on it, now I notice it when it kicks in (about an hour after taking), but then after an hour, I'm right back to where I was. If I don't take in caffeine, I could go to sleep standing up.\nOriginally posted by AriD View Post\nI take modafinil ( provigil) 200 mg every morning. Helped a lot first few months, now not so much. My neuro says to take another 100 mg in afternoon but my pcp thinks that's too much.",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "07-26-2015, 12:18 PM",
    "User" : "AliceWonderland",
    "Number_of_total_posts" : "3"
  }, {
    "Post" : "LDN sounds like something I want to try!\nI am not getting any significant relief from Nuvigil anymore (6+ years), and I won't ever use Adderall again (meth - speed). I am going to ask my neurologist about this tomorrow!\nThank you for posting this!\nOriginally posted by JerryD View Post\nLDN is short for Low Dose Naltrexone which in its standard dose is 50 mg and is usually prescribed as an opiate antagonist. I am not a doctor and I learned about this compounded drug through several websites. Knuckle , on this board, has posted about this drug many times. I have been taking it for several years. There is a lot to learn about prescribing and treating with this drug. I hope that you can find a doctor to prescribe it for you. Good luck",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "07-26-2015, 12:26 PM",
    "User" : "AliceWonderland",
    "Number_of_total_posts" : "3"
  }, {
    "Post" : "Provigil\nI was taking 800 mg per day, yes 800 mg per day but my new doctor disagreed with that much med so they switched me to something else, (I can't remember the name) that had no effect at all. I'm back on Provigil but only 200 mg per day. Everyday around 1300 I can fall asleep I'm so tired but I get a cup of coffee which helps me get to 17:30 when I get home from work. I can usually only make it to 8 or 9 pm then I'm out quickly. Fatigue is the worst part of my MS live. de",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "07-26-2015, 05:10 PM",
    "User" : "Sirike",
    "Number_of_total_posts" : "35"
  }, {
    "Post" : "Originally posted by fishead View Post\nProvigil is no longer working for me.\nI was wondering what EVERYONE has tried and takes, for fatigue.\nRing in with your thoughts and med/non-med treatment.\nI have ms , and I cannot hear myself think anymore, once in awhile I can then it goes away again, I also have tiredness so I just drink coffee in the morning but I noticed with that I just need more and more of it lol I was drinking caffeine since I was in my moms belly so I really am used to it! I wanted to find a doctor that would give me Adderall for add that would also help with memory and tiredness problems...the shot I take everyday for my ms capaxone gives me a little energy did you ever try that?",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "09-03-2015, 07:54 AM",
    "User" : "butterflyblissbabe82",
    "Number_of_total_posts" : "22"
  }, {
    "Post" : "LDN not always so great\nOriginally posted by its2much View Post\nWill your neuro prescribe LDN? I've heard that there are very few doctors that will prescribe it. That's unfortunate as I've also heard that is very effective for MS fatigue.\nMy neuro prescribed LDN a couple years ago for me. I tried it, but had to stop because it caused so much fatigue for me. I was really dragging until I stopped.\nCurrently I'm taking 50mg of Provigil daily. At first it was pure magic, but now it's not working as well as it did when I first started, so I'm probably going to increase my dosage and see if that works better.\n/Scut",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "11-23-2015, 12:03 AM",
    "User" : "ScutFarkus",
    "Number_of_total_posts" : "13"
  }, {
    "Post" : "Nuvigil wakes up my brain\nBefore Nuvigil I would wake up after nine or more hours of sleep; drink a cup of coffee in silence and and fall asleep on the couch for at least another hour. Any chores would be done in spurts \"had to chuckle when I saw that description\" Even more than physical fatigue I was suffering from brain fatigue. I could not carry on a conversation..at least not one that was intelligible! Everyone would ask me if I was angry with them. That question is way to difficult to answer when my brain isn't awake! No! didn't seem to be an adequate response.!\nMy original dosage was 175 mg a day. But from what I hear from family and friends, when I took the full dosage it was like I was vaccinated with a phonograph needle. I have settled on a half of a pill a day. 1/4 in the morning and a 1/4 after lunch. I still lay down and rest cause I figure my body needs it, but I get a little bounce out of the afternoon dosage. I was diagnosed with MS 8 years ago and have been taking Nuvigil for almost 3 years. Thanks to Nuvigil I have an a almost normal life. I'm just thankful for the ability to engage with my surroundings.",
    "Titel" : "ALL fatigue treatments. What do YOU take?",
    "Date" : "11-28-2015, 01:57 AM",
    "User" : "Wonderdog lady",
    "Number_of_total_posts" : "56"
  }, {
    "Post" : "Has anyone ever had botox for spasticity in their lower jaw and/or mouth?\nI have a spastic tongue, had it for years. It was my presenting symptom 20 years ago, before the idea of MS ever came into the picture. Now we know it's MS, and always has been, because I have a lesion in the area of the lower cranial nerves that affect the tongue.\nI've managed it for years with low dose benzos, Baclofen (I still take a low dose of baclofen even though I have a pump..but I take this for my jaw/tongue and upper body spasticity.)\nThe pain is only on one side of my tongue, but my speech has become pretty impaired. I used to be able to distract myself from the pain, but that's not working anymore, I've tried every neurogenic pain med there is, but they don't work because it's really not sensory pain, it's plain old muscle spasm/spasticity pain...so now we're looking into botox.\nBotox had been recommended years ago by a neuro but all the 2nd opinions from other neuros I trusted said only do it when all else has failed. So I'm about at that point where I'm going to have to do something, or quit talking and chewing...that's what triggers the spasm. The caveat to just going ahead and doing it has always been, it could make the situation worse, speaking and swallowing at least.\nI've had a swallow test, I've been to a speech therapist, and my swallowing is okay, some deficits, but okay. Speech therapist says there is nothing speech therapy can do for me.\nBut it's either going to be heavier pain med, no talking, soft foods only, or some other type of treatment, so botox is being investigated. I've been referred to the neuro in the practice that does EMGs, so I think that will be the next move just to see what nerves are firing and which aren't...I have fasciculations on the one side of my tongue that never stop and muscles of my jaw and neck have atrophied quite a lot.\nGood news is: botox results only last 3 months, so eventually if it was bad side effects, they'd wear off. Bad news is: could I go 3 months without talking (i.e. it could make the speaking worse and my speech would become more unintelligible.)\nIt took me awhile to wrap my head around the whole idea of the pump...but this side of it, I was so glad I didn't listen to my own misgivings. So maybe this will be the same.\nI'd love to hear from somebody who's had botox in that region and the side effects caused, specifically swallowing and speaking.",
    "Titel" : "Botox for spasticity in jaw and mouth?",
    "Date" : "01-12-2015, 02:31 PM",
    "User" : "rdmc",
    "Number_of_total_posts" : "2568"
  }, {
    "Post" : "I have never used it for my jaw but I do use it for muscle spasms in my neck, head and upper back. I have been doing the injections for 10 years now. I never experienced any of the side effects. The first year I needed them every 3 months but then I was able to go longer in between injections. Now I only need them about twice a year. The Botox has been a miracle drug for me. I was able to stop taking zanaflex, I was able to lower my dose of Nerotonin from 1800 mg a day to 600 mg a day and also lower my Skelaxin dose.\nI hope it works as well for you as it did for me.",
    "Titel" : "Botox for spasticity in jaw and mouth?",
    "Date" : "01-14-2015, 01:20 AM",
    "User" : "Barrister16",
    "Number_of_total_posts" : "36"
  }, {
    "Post" : "Originally posted by Barrister16 View Post\nI have never used it for my jaw but I do use it for muscle spasms in my neck, head and upper back. I have been doing the injections for 10 years now. I never experienced any of the side effects. The first year I needed them every 3 months but then I was able to go longer in between injections. Now I only need them about twice a year. The Botox has been a miracle drug for me. I was able to stop taking zanaflex, I was able to lower my dose of Nerotonin from 1800 mg a day to 600 mg a day and also lower my Skelaxin dose.\nI hope it works as well for you as it did for me.\nHey Barrister,\nthanks so much for the reply. Knowing you've had Botox in you neck and head with none of the side effects makes me feel much better about Botox shots. All the warnings about swallowing, etc were rather daunting. Your post really helped me have a more balanced view of the injections.",
    "Titel" : "Botox for spasticity in jaw and mouth?",
    "Date" : "01-14-2015, 06:09 AM",
    "User" : "rdmc",
    "Number_of_total_posts" : "2568"
  }, {
    "Post" : "Tongue problems here too\nHello!\nI have had stiffness in my tongue for ten years. However, the main culprit is most probably an operation I had done to my tongue right before. The injured muscle never recovered from the operation in the sense that I feel the area getting stiffer on its own. The stiff feeling comes and goes, on a daily basis usually. Years later, it has become worse. It has spread into the base of my tongue which nowadays feels like getting stiff, too. I tend to describe the feeling like what a man probably feels when he gets an erection, only that it's the tongue\nI was diagnosed with ms soon after the operation. I think I had ms already before, but the operation and everything related to it was such a stress to my physical and mental health, that it triggered the ms to rear its head and I got the diagnosis.\nDoctors think that the spastic feelings I have in my tongue can be both operation related and ms related or that it's impossible to know which one to blame or both.\nI'm so happy to hear of someone else with this weird problem.",
    "Titel" : "Botox for spasticity in jaw and mouth?",
    "Date" : "08-13-2015, 02:06 PM",
    "User" : "Grade1",
    "Number_of_total_posts" : "27"
  }, {
    "Post" : "re: Botox\nHello,\nI have suffered with jaw/mouth pain since April 2011, approx. a month after I was diagnosed with MS it started. It took my neuro forever (it seemed like) to finally diagnose me correctly. She was treating me for Trigeminal Neuralgia when I actually had Oro-facial Dystonia. The treatments are very different.\nAnyway, long story short, I get Botox injections into my jaw (both sides) and scalp (covers the masseter muscles) every 90 days and have for years. It was life changing!!!\nIt was so bad that chewing food, chewing gum, laughing, or talking too much exacerbated the problem. Soft foods became a routine; my teeth hurt, my jaw hurt, which made my head hurt...until she realized I needed Botox to fix the problem.\nAs long as I stay on my 90 day cycle I'm good to go and I have a much better quality of life.\nGood luck.",
    "Titel" : "Botox for spasticity in jaw and mouth?",
    "Date" : "08-26-2015, 06:49 PM",
    "User" : "mlissa67",
    "Number_of_total_posts" : "141"
  }, {
    "Post" : "Hi Grade1 and Mlissa,\nI just saw this thread was \"resurrected\" and found your stories very interesting.\nGrade1, mine feels stiff too, and it won't move. If they say stick out your tongue and say\n\"Ah\"....I can't stick out my tongue, in fact the Ah sound seems to cause it to retreat more down my throat...but this is all one sided issues.\nUpdate to the problem: I was sent to the dystonia, and botox neuro for his opinion. After examining me, he said there was really no fix because my tongue has atrophied on that side, and the muscles are too weak to make it move \"right.\" That whole side of my face is not cooperative at all My lip droops and the face itself doesn't move (with the exception of my forehead...it moves, but evidently that's a different nerve that innervates the forehead. In fact, I believe the way they differentiate Bell's Palsy is if the forehead moves or not.)\nIf it wasn't for the strange sensations, and down right pain that I get when I overdo it (i.e. talk too much, eat something that requires a lot of chewing, or try to eat a thick sandwich or corn on the cob, for that matter)...I wouldn't be concerned about the cosmetic aspect...but it's the pain and altered sensations that drive me batty. They did up my nortriptylene and that did help some. I also take oral baclofen (I have a baclofen pump for lower body spasticity) and a small dose of Klonopin for the face/tongue issues. I really didn't think it helped much, but the other day I forgot and skipped a dose. I was trying to figure out why I was having so many problems with the area, and then realized I missed a dose...so the anti-spasticity, and muscle relaxer do help.\nMlissa, so glad you've had such great success with the botox. That's what I was hoping I could get, but the botox neuro said it probably wouldn't help and where he'd need to inject was the one place he had never botoxed in his career. He indicated the place that would need to be treated with botox would compromise my swallowing.\nBut I'm thrilled to hear it has worked for you. There's a youtube video on oromandibular dystonia, and the man (he doesn't have MS...just the dystonia) who did the video had great success with using a mouthpiece (looks likes a retainer) and eventually botox. It's a really interesting video...you can use oromandibular dystonia in the youtube search engine and come up with his story.\nThanks to both of you for sharing your experiences.",
    "Titel" : "Botox for spasticity in jaw and mouth?",
    "Date" : "08-27-2015, 01:46 PM",
    "User" : "rdmc",
    "Number_of_total_posts" : "2568"
  } ]
}